[
  {
    "title": "Bumi Resources Minerals says Palu operations unaffected by site closure",
    "url": "https://www.thejakartapost.com/business/2026/02/18/bumi-resources-minerals-says-palu-operations-unaffected-by-site-closure.html",
    "date": "2026-02-18T00:00:00",
    "date_parsed": "2026-02-18 00:00:00",
    "summary": "The publicly listed miner, while confirming the closure of a site within subsidiary CPM's forest concession over illegal land clearing, has underlined that the targeted area was not operational and so will not affect its overall operations.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.086683",
    "content": "T Bumi Resources Minerals (BRM) says the government's closure of a contested gold mine at its concession in Palu, Central Sulawesi, will not disrupt core production activities, as the site in question was not yet operational.\n\nThe publicly listed miner said in a statement on Monday that the forest area enforcement task force (Satgas PKH) had sealed off a location within a contract of work area managed by its subsidiary, Citra Palu Minerals (CPM).\n\nThe Satgas PKH team moved to seal the site after discovering that illegal miners had cleared land in the concession area.\n\n\"The River Reef gold mine in Poboya, Palu, which is currently operated by CPM using the open-pit mining method, continues to operate as usual,\" BRM management stated, as quoted byKontan.co.id.\n\nBRM underscored that although the area targeted by the task force lay within its concession, CPM had neither developed nor mined it to date, so its closure was not expected to impact the company's primary operations.\n\nThe miner is currently ramping up the capacity of a CPM-run gold mill to 2,000 tonnes of ore per day from 500 tonnes previously and is on track for completion by October.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nIt is expected to substantially boost the company's gold output this year to \"strengthen the firm’s operational fundamentals amid the evolving dynamics of the national gold mining industry\", according to BRM’s statement.",
    "author": "Divya Karyza",
    "category": "Companies",
    "tags": [
      "BRMS",
      "mining",
      "PKH"
    ]
  },
  {
    "title": "New state miner Perminas signs MoU on Gabon rare earth project",
    "url": "https://www.thejakartapost.com/business/2026/02/18/new-state-miner-perminas-signs-mou-on-gabon-rare-earth-project.html",
    "date": "2026-02-18T00:00:00",
    "date_parsed": "2026-02-18 00:00:00",
    "summary": "PT Perusahaan Mineral Nasional and Danantara may also enter negotiations for equity or debt participation in the Maboumine project, according to a statement, though no value or timeline has been disclosed.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.087314",
    "content": "he country’s newly established state-owned minerals company, PT Perusahaan Mineral Nasional (Perminas), has signed a memorandum of understanding (MoU) with Abu Dhabi-based New Energy Metals (NEM) to explore cooperation on rare earth elements and potential investment in a mine in Gabon.\n\nThe nonbinding agreement would give Indonesia access to the Maboumine polymetallic deposit in the central African country, operated by NEM subsidiary Dusk Gabon, and open the door to downstream processing and manufacturing of rare earth products in Indonesia, said state asset fund Danantara, which oversees state-owned enterprises.\n\nPerminas and Danantara may also enter negotiations for equity or debt participation in the Maboumine project, the statement said, though no financial value or timeline was disclosed.\n\n“This MoU creates a structured pathway to assess opportunities that link upstream resource potential with downstream value creation, consistent with strong governance and long-term national priorities,” Perminas president director Gilarsi Wahju Setijono said in a statement.\n\nRead also:Government maps rare earth reserves for industry goals\n\nThe companies will exchange data and evaluate potential integration between Gabon’s upstream resources and Indonesia’s industrial base.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nUnder the MoU, the parties will assess cooperation spanning upstream resource development and downstream activities, including rare earth separation, refining, alloy production and permanent magnet manufacturing, Danantara said.",
    "author": "Ruth Dea Juwita",
    "category": "Companies",
    "tags": [
      "Perminas",
      "Danantara",
      "rare-earths",
      "investment"
    ]
  },
  {
    "title": "As Global Attention Turns to the US: What Are Its Businesses Doing In Indonesia?",
    "url": "https://www.thejakartapost.com/business/2026/02/18/as-global-attention-turns-to-the-us-what-are-its-businesses-doing-in-indonesia.html",
    "date": "2026-02-18T00:00:00",
    "date_parsed": "2026-02-18 00:00:00",
    "summary": "With much of the global conversation currently focused on developments in and around the United States, attention often gravitates toward politics, policy shifts and geopolitical implications. Less visible, but equally important, is how US businesses continue to operate and invest overseas amid this evolving global context.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.087721",
    "content": "ith much of the global conversation currently focused on developments in and around the United States, attention often gravitates toward politics, policy shifts and geopolitical implications. Less visible, but equally important, is how US businesses continue to operate and invest overseas amid this evolving global context.\n\nIn Indonesia, US companies remain active across a wide range of sectors, contributing capital, expertise and innovation to support economic and human development. Drawing on findings from the 2024 US-ASEAN Business Council’s US Business for Indonesia (BISA) Report, this article examines how US private sector initiatives are translating into tangible outcomes on the ground.\n\nThe discussion focuses exclusively on business activity and its local impact. It does not reflect government policy or political positions, nor does it seek to assess geopolitical dynamics. Instead, it offers a closer look at how the US private sector continues to shape Indonesia’s development in practical ways, often beyond the headlines.\n\nSustaining A Foundational Support\n\nFrom foundational ties dating back to the late 19th century, the US has remained one of Indonesia’s key development partners, playing a sustained role in driving investment across sectors aligned with Indonesia’s Golden 2045 vision.\n\nWith more than US$14.85 billion invested in Indonesia since 2020, US businesses show no signs of slowing their engagement. Investment reached US$1.55 billion by the second quarter of last year alone and spans regions across the archipelago, from Central Papua to East Java.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nBeyond capital, US companies continue to contribute innovation and expertise that support Indonesia’s goals for sustainable growth, job creation and technological advancements. The most significant impact, however, extends beyond monetary figures and is reflected in the empowerment of communities and workers across industries.\n\nBuilding Digital Skills for Indonesia’s Workforce\n\nIn technology and education, several US companies are actively investing in upskilling Indonesia’s youth, educators and entrepreneurs.\n\nGoogle and its subsidiary YouTube have collectively trained more than 3.4 million Indonesians through a range of digital programs. One example is Gapura Digital, which has supported more than two million micro, small and medium enterprises in adopting digital tools to improve their business operations through accessible online training.\n\nAnother initiative, under the Bangkit Bersama AI Google has collaborated with various ministries and partners to bridge the digital skills gap. To date, the program has equipped 300,000 students, educators, developers and professionals with essential AI skills.\n\nAmazon Web Services (AWS) has also played a role through digital skills development programs focused on cloud computing and artificial intelligence capabilities critical to today's economy. Since 2023, more than 16,500 Indonesians have participated in these cloud and AI-focused initiatives. Around 14,000 participants have received training in full-stack programming and digital marketing with cloud technologies, while the remainder were university students across 13 campuses who participated in AI and cloud digital upskilling courses.\n\nDesigned to bridge education and industry, these programs aim to provide practical experience in cloud and AI competencies so Indonesian youths can remain competitive in the global digital economy.\n\n(Image courtesy of Netflix)\n\nIn the creative sector, Netflix partnered with the Jogja-NETPACK Asian Film Festival to establish the Reel Life Film Camp. Over 600 young Indonesians registered, offering 75 selected individuals training and mentorship in creative and technical disciplines. Educating them with know-how in fields like post production and sound design through a holistic platform that networks the youth to industry professionals.\n\nSupporting Food Security and Sustainable Farming\n\nIn Indonesia’s agricultural sector, US companies such as Corteva and Mondelēz International are contributing to food security and nutrition efforts that align with President Prabowo’s priorities.\n\nCorteva supported vulnerable families in the Malang area by distributing 50,000 nutritious meal packages in 2022 during the COVID-19 pandemic. This initiative reflects the company’s commitment to strengthening local communities’ food security, alongside its efforts to promote sustainable farming practices nationwide.\n\nAs of 2024, Corteva’s seed technology programs supported more than 94,000 farmers, primarily in East Java, in transitioning from open-pollinated varieties (OPV) to hybrid corn seeds. Through agronomy training and improved seed solutions, these initiatives aim to increase productivity and income for farming communities, with a focus on empowering women farmers.\n\n(Image courtesy of Mondelez International)\n\nMondelēz International, meanwhile, has focused on sustainable cocoa farming through its Cocoa Life program. Operating since 2013, the initiative supports farmers in Aceh, North Sumatera, West Sumatra, Lampung, Central Sulawesi, South Sulawesi and Southeast Sulawesi by providing training in sustainable agricultural practices. The program helps improve yields while strengthening resilience to environmental and economic challenges.\n\nTo date, Cocoa Life has empowered more than 32,500 registered farmers, reached over 310 communities impacted, distributed over 7 million cocoa seedlings and helped the economic vitality of rural areas.\n\nThese examples represent only a portion of the US businesses featured in the BISA report, all of which share a common focus on delivering tangible human impact alongside commercial activity.\n\nA Partnership Focused on People\n\nTaken together, the presence of US businesses in Indonesia reflects more than an economic relationship. It represents a collaborative platform that prioritizes skills development, sustainability and long-term prosperity.\n\nBy placing people at the center of their engagement, US companies continue to support Indonesia’s progress toward its Golden 2045 vision, contributing in ways that are practical, measurable and rooted in local communities.",
    "author": "Creative Desk",
    "category": "Companies",
    "tags": [
      "adv-BC",
      "adv-usaseanbusinesscouncil",
      "AWS"
    ]
  },
  {
    "title": "Coal must go for climate funds to flow, German ambassador says",
    "url": "https://www.thejakartapost.com/business/2026/02/18/coal-must-go-for-climate-funds-to-flow-german-ambassador-says.html",
    "date": "2026-02-18T00:00:00",
    "date_parsed": "2026-02-18 00:00:00",
    "summary": "Private funds could flow elsewhere without coal cuts, the German ambassador to Indonesia warns, saying renewables cannot scale while coal remains dominant.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.094114",
    "content": "ermany says billions of dollars in private climate finance earmarked for Indonesia’s landmark energy transition initiative will not materialize unless Jakarta takes tougher steps to curb its reliance on coal.\n\n“You can’t do it both ways: fight against climate change and still rely on fossil fuels to the extent the country is doing,” German Ambassador to Indonesia Ralf Beste toldThe Jakarta Postin an interview on Thursday. “But it’s the country’s decision to do that.”\n\nIndonesia’s Just Energy Transition Partnership (JETP), launched in 2022, was designed to mobilize at least US$20 billion in public and private finance to help the country pass the peak in power-sector emissions by 2030 and accelerate its shift from coal to renewables.\n\nBerlin had assumed a larger coordinating leading role alongside Japan in the JETP after the United States stepped down as co-lead, prompting what the ambassador described as a “reorganization” of processes and governance to jointly refocus with Jakarta on project delivery as the initiative enters the implementation phase.\n\nEarlier this month, Germany signed a partnership with Indonesia for a 300-million-euro (US$375 million) power grid project in Saguling, West Java, intended to strengthen transmission infrastructure and support renewable energy integration.\n\nIt has also committed to funding two additional energy transition projects worth a combined 2 billion euros, according to Indonesia’s Office of the Coordinating Economy Minister.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\n“We know we need tangible results,” Beste said, describing the project as evidence that implementation is progressing, but “at the same time, five years on, [Indonesia] is still relying very much on coal, and [we understand] it’s not easy to say goodbye to it.”",
    "author": "Ruth Dea Juwita",
    "category": "Regulations",
    "tags": [
      "Germany",
      "JETP",
      "energy-transition",
      "coal-power-plants-retirement",
      "coal",
      "climate-financing",
      "Just-Energy-Transition-Pact"
    ]
  },
  {
    "title": "Trump says Japan to invest in energy, industrial projects in Ohio, Texas and Georgia",
    "url": "https://www.thejakartapost.com/business/2026/02/18/trump-says-japan-to-invest-in-energy-industrial-projects-in-ohio-texas-and-georgia.html",
    "date": "2026-02-18T00:00:00",
    "date_parsed": "2026-02-18 00:00:00",
    "summary": "United States President Donald Trump's administration on Tuesday announced three projects valued at US$36 billion to be financed by Japan, including an oil export facility in Texas, an industrial diamonds plant in Georgia and a natural gas power plant in Ohio.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.094543",
    "content": "nited States President Donald Trump's administration on Tuesday announced three projects valued at US$36 billion to be financed by Japan, including an oil export facility in Texas, an industrial diamonds plant in Georgia and a natural gas power plant in Ohio.\n\nThe projects are the first investments under Japan's $550 billion US investment pledge as part of a trade deal that cut Trump's tariffs on Japanese imports to 15 percent, Trump said on Truth Social. He gave few details about the projects.\n\nCommerce Secretary Howard Lutnick said in a statement that the Portsmouth, Ohio power plant, valued at $33 billion, would be the largest natural gas-fired generating facility in US history, generating 9.2 gigawatts of electricity annually, more than enough to power all of the homes in Ohio.\n\nThe facility, to be operated by SB Energy, a subsidiary of Japanese tech investor SoftBank Group, would increase baseload power at a time of fast-growing electricity demand from data centers built to power artificial intelligence applications.\n\nThe White House said Japan would invest in the $2.1 billion Texas GulfLink deepwater crude oil export facility off the Texas coast.\n\n\"This project is expected to generate $20–30 billion annually in US crude exports, secure export capacity for our refineries, and reinforce America’s position as the world’s leading energy supplier,\" Lutnick said.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nTexas GulfLink, which is being developed by Sentinel Midstream, confirmed that it was part of the initiative and was \"honored to be a trusted partner with the US Department of Commerce and the government of Japan.\"\n\nTrump said the Texas investments would include a liquefied natural gas project, but Lutnick's statement and a White House fact sheet did not mention LNG.\n\nLutnick said the third major project in Georgia was a synthetic industrial diamond manufacturing plant that would satisfy 100 percent of US demand for synthetic diamond grit, a critical input for advanced manufacturing and semiconductor production.\n\nThe US currently relies largely on China for such supplies.\n\nThe high-pressure synthetic diamond plant valued at about $600 million, will be operated by Element Six, the White House said in a fact sheet. The industrial diamond company is a unit of De Beers Group, the world's largest diamond producer.\n\nIt was unclear how much of the projects' costs would be funded by Japanese entities and under what conditions.\n\nUnder an earlier US-Japan agreement, profits from the projects were due to be shared 50-50 between the US and Japan until Japan's initial investment costs were recouped, after which profits would be split 90-10 in favor of the US.\n\nThe administration's announcements followed meetings last week between Lutnick and Japan's economic and trade minister Ryosei Akazawa.\n\nAkazawa told reporters on Thursday that several issues remained unresolved before deals could be announced.\n\n\"The scale of these projects are so large, and could not be done without one very special word, TARIFFS,\" Trump wrote on Truth Social.",
    "author": "David Lawder and Jarrett Renshaw",
    "category": "Economy",
    "tags": [
      "US-Japan",
      "trade-agreement",
      "investment",
      "oil-and-gas"
    ]
  },
  {
    "title": "Govt urged not to compromise too much for US trade deal",
    "url": "https://www.thejakartapost.com/business/2026/02/17/govt-urged-not-to-compromise-too-much-for-us-trade-deal.html",
    "date": "2026-02-17T00:00:00",
    "date_parsed": "2026-02-17 00:00:00",
    "summary": "The government has issued a loosely-worded statement days ahead of the expected signing of a tariff agreement with the United States, following a weekend meeting at President Prabowo Subianto’s Hambalang estate in Bogor, West Java.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.094985",
    "content": "ays ahead of the expected signing of a bilateral tariff agreement with the United States, analysts have called on the government to tread with caution regarding concessions made, specifically opening the domestic market to US goods.\n\nParamadina University economist Wijayanto Samirin said Jakarta had to pay careful attention to the pricing of US commodities. “It shouldn’t be the case that we are forced to buy products at uncompetitive prices”.\n\nSpeaking toThe Jakarta Poston Monday, Wijayanto said incoming shipments of wheat and soybean, in particular, would need to be properly coordinated with Indonesia’s private sector to prevent excessive market disruption.\n\n“Regarding the commitment to buy airplanes and energy commodities, the government has to be careful, given that our financial situation is not strong,” said Wijayanto, before urging the government not to be afraid to back off from a deal that might disadvantage the archipelago.\n\nThe government issued a loosely-worded statement on Monday, following a weekend meeting at PresidentPrabowo Subianto’s Hambalang estate in Bogor, West Java.\n\nThe meeting on Sunday was attended by State Secretary Prasetyo Hadi, Coordinating Economic Minister Airlangga Hartarto, Finance Minister Purbaya Yudhi Sadewa and Investment and Downstream Minister Rosan Roeslani, who is also the CEO of state asset fund Danantara.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nCabinet Secretary Teddy Indra Wijaya said in a statement afterward that Prabowo wanted any deal to “increase domestic industrial productivity to the fullest extent possible, […] ensuring that the position taken by Indonesia in economic negotiations with any party — particularly in the near term with the United States — is the best and most advantageous for Indonesia,”.",
    "author": "Deni Ghifari",
    "category": "Economy",
    "tags": [
      "Prabowo",
      "Prabowo-Subianto",
      "Donald-Trump",
      "US-tariffs",
      "reciprocal-tariff",
      "Airlangga-Hartarto",
      "import-duties",
      "trump"
    ]
  },
  {
    "title": "Unlocking regional potential to boost economic growth",
    "url": "https://www.thejakartapost.com/business/2026/02/17/unlocking-regional-potential-to-boost-economic-growth.html",
    "date": "2026-02-17T00:00:00",
    "date_parsed": "2026-02-17 00:00:00",
    "summary": "As an archipelagic country, Indonesia is endowed with diverse economic potential across regions, reflected in regional economic structures and export profiles.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.095447",
    "content": "ndonesia’s economic growth remained solid at 5.1 percent in 2025, yet performance across regions was uneven. Java continues to contribute the largest share to the national economy, with its contribution rising over the past two decades from 56.4 percent in 2004 to 58.7 percent in 2025. The highest regional growth in 2025 was recorded in Java and Sulawesi, driven mainly by expansion of the manufacturing sector.\n\nMeanwhile, other regions have yet to fully optimize their economic potential. In fact, each region possesses distinct characteristics and comparative advantages that could serve as engines of growth if managed effectively.\n\nAs an archipelagic country, Indonesia is endowed with diverse economic potential across regions. These differences are reflected in regional economic structures and export profiles.\n\nJava, the largest contributor to the national economy, enjoys strong advantages in manufacturing and a large domestic market. The manufacturing sector accounted for 27.4 percent of Java’s economy in 2025, and Java remained the backbone of national manufacturing, contributing around 66 percent of Indonesia’s total manufacturing output. Key industries in Java include food and beverages, transport equipment, chemicals, electronics and textiles. By province, West Java, Central Java and East Java account for the largest share of manufacturing activity.\n\nMeanwhile, regions outside Java are largely resource-based. In Sumatra, agriculture accounted for 23.7 percent of the regional economy in 2025, supported mainly by plantation crops such as palm oil, rubber and coffee. Similarly, Kalimantan’s economy is heavily based on natural resources, particularly mining. The mining and quarrying sector contributed 24.7 percent to Kalimantan’s economy in 2025, indicating the significant influence of mining commodities, especially coal, on regional economic performance. Moreover, the economies of Sumatra and Kalimantan are highly sensitive to developments in commodity exports such as coal and crude palm oil (CPO).\n\nBali and both East and West Nusa Tenggara recorded the largest share of economic activity in agriculture, accounting for 19.1 percent of regional GDP in 2025. A closer look shows that agriculture plays a dominant role in Nusa Tenggara, while Bali’s economic structure is dominated by accommodation and food services, reflecting the province’s strong comparative advantage in tourism.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nThe Sulawesi-Maluku region shows the largest shares in agriculture and manufacturing, accounting for 21.8 percent and 20.1 percent of the regional economy in 2025, respectively. The manufacturing share in Sulawesi has nearly matched that of agriculture, reflecting the impact of the nickel downstreaming program. Meanwhile, Papua’s economic structure is dominated by mining, which accounted for 33.2 percent of regional GDP in 2025, highlighting the region’s heavy dependence on PT Freeport Indonesia’s mining operations located in Central Papua.",
    "author": "Mamay Sukaesih",
    "category": "Economy",
    "tags": [
      "GDP",
      "economy",
      "manufacturing",
      "manufacturing-activity",
      "mining",
      "regional-growth"
    ]
  },
  {
    "title": "Job threats, rogue bots: five hot issues in AI",
    "url": "https://www.thejakartapost.com/business/2026/02/17/job-threats-rogue-bots-five-hot-issues-in-ai.html",
    "date": "2026-02-17T00:00:00",
    "date_parsed": "2026-02-17 00:00:00",
    "summary": "As artificial intelligence evolves at a blistering pace, world leaders and thousands of other delegates will discuss how to handle the technology at the AI Impact Summit, which opens Monday in New Delhi.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.095866",
    "content": "s artificial intelligence evolves at a blistering pace, world leaders and thousands of other delegates will discuss how to handle the technology at the AI Impact Summit, which opens Monday in New Delhi.\n\nHere are five big issues on the agenda:\n\nJob loss fears\n\nGenerative AI threatens to disrupt myriad industries, from software development and factory work to music and the movies.\n\nIndia -- with its large customer service and tech support sectors -- could be vulnerable, and shares in the country's outsourcing firms have plunged in recent days, partly due to advances in AI assistant tools.\n\n\"Automation, intelligent systems, and data-driven processes are increasingly taking over routine and repetitive tasks, reshaping traditional job structures,\" the summit's \"human capital\" working group says.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\n\"While these developments can drive efficiency and innovation, they also risk displacing segments of the workforce,\" widening socioeconomic divides, it warns.\n\nBad robots\n\nThe Delhi summit is the fourth in a series of international AI meetings. The first in 2023 was called the AI Safety Summit, and preventing real-world harm is still a key goal.\n\nIn the United States, families of people who have taken their own lives have sued OpenAI, accusing ChatGPT of having contributed to the suicides. The company says it has made efforts to strengthen its safeguards.\n\nElon Musk's Grok AI tool also recently sparked global outrage and bans in several countries over its ability to create sexualized deepfakes depicting real people, including children, in skimpy clothing.\n\nOther concerns range from copyright violations to scammers using AI tools to produce perfectly spelled phishing emails.\n\nEnergy demands\n\nTech giants are spending hundreds of billions of dollars on AI infrastructure, building data centers packed with cutting-edge microchips, and also, in some cases, nuclear plants to power them.\n\nThe International Energy Agency projects that electricity consumption from data centers will double by 2030, fueled by the AI boom.\n\nIn 2024, data centers accounted for an estimated 1.5 percent of global electricity consumption, it says.\n\nAlongside concerns over planet-warming carbon emissions are worries about water use to cool the data center servers, which can lead to shortages on hot days.\n\nMoves to regulate\n\nIn South Korea, a wide-ranging law regulating artificial intelligence took effect in January, requiring companies to tell users when products use generative AI.\n\nMany countries are planning similar moves, despite a warning from US Vice President JD Vance last year against \"excessive regulation\" that could stifle innovation.\n\nThe European Union's Artificial Intelligence Act allows regulators to ban AI systems deemed to pose \"unacceptable risks\" to society.\n\nThat could include identifying people in real time in public spaces or evaluating criminal risk based on biometric data alone.\n\n'Everyone dies'\n\nMore existential fears have also been expressed by AI insiders who believe the technology is marching towards so-called \"Artificial General Intelligence\", when machines' abilities match those of humans.\n\nOpenAI and rival startup Anthropic have seen public resignations of staff members who have spoken out about the ethical implications of their technology.\n\nAnthropic warned last week that its latest chatbot models could be nudged towards \"knowingly supporting -- in small ways -- efforts toward chemical weapon development and other heinous crimes\".\n\nResearcher Eliezer Yudkowsky, author of the 2025 book \"If Anyone Builds It, Everyone Dies: Why Superhuman AI Would Kill Us All\" has also compared AI to the development of nuclear weapons.",
    "author": "Katie Forster",
    "category": "Tech",
    "tags": [
      "AI",
      "tech"
    ]
  },
  {
    "title": "Dollar holds gains in thin trading as markets await Fed minutes, US GDP",
    "url": "https://www.thejakartapost.com/business/2026/02/17/dollar-holds-gains-in-thin-trading-as-markets-await-fed-minutes-us-gdp.html",
    "date": "2026-02-17T00:00:00",
    "date_parsed": "2026-02-17 00:00:00",
    "summary": "The dollar held gains on Tuesday as markets awaited signals, expected later this week, about the potential timing of rate cuts by the Federal Reserve.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.101307",
    "content": "he dollar held gains on Tuesday as markets awaited signals, expected later this week, about the potential timing of rate cuts by the Federal Reserve.\n\nThe yen trimmed losses from a day earlier when worse-than-expected Japanese economic data stirred expectations that the government would ramp up stimulus. The Aussie dollar edged lower after the release of Reserve Bank of Australia's minutes from its February meeting.\n\nTrading was thin with many markets in Asia closed for the Lunar New Year holiday and following the President's Day holiday in the US Key economic events lie later in the week, with minutes from the Fed's last meeting and advance figures on US gross domestic product.\n\n\"We're quite positive on the US economy,\" said Kristina Clifton, senior currency strategist at Commonwealth Bank of Australia in Sydney. \"The market is currently pricing a high chance of a June interest rate cut, which is also our view. However, we differ from the market in that we expect a follow-up cut in July.\"\n\n\"We judge that the most important driver of the dollar through 2026 will be the narrative of US exceptionalism,\" she added.\n\nThe dollar index, which measures the greenback against a basket of currencies, was little changed at 97.12, after a 0.2 percent gain in the previous session. The euro fell 0.06 percent to $1.1843.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nThe yen strengthened 0.15 percent to 153.28 per dollar. Sterling weakened 0.07 percent to $1.3616.\n\nData on Friday showed US consumer prices increased less than expected in January, giving the Fed additional leeway for policy easing this year.\n\nMoney market traders are pricing in 62 basis points of easing for the rest of this year, implying two quarter-point cuts and about a 50 percent chance of a third. The next cut is likely in June, with markets assigning an 80 percent chance of a 25-basis-point reduction.\n\nThe Federal Open Market Committee issues minutes from its January meeting on Wednesday. Other key data points this week include inflation readings for Britain, Canada and Japan, as well as preliminary readings of global business activity on Friday.\n\nA recent rally in the yen stalled on Monday when official figures showed Japan's economy barely grew last quarter, eking out an annualized 0.2 percent expansion.\n\nThe Australian dollar weakened 0.07 percent versus the greenback to $0.7064. New Zealand's kiwi weakened 0.08 percent to $0.6026 ahead of the Reserve Bank of New Zealand's policy meeting on Wednesday, when it is widely expected to hold rates steady.\n\nAustralia's central bank concluded inflation would stay stubbornly high if it had not hiked interest rates as it did this month and it was not yet sure if further tightening would be necessary.\n\nMinutes of the RBA's board meeting last month showed members were worried that the risks to its inflation and employment mandates had \"shifted materially.\"\n\nIn cryptocurrencies, bitcoin gained 0.05 percent to $68,881.72, while ether was little changed at $1,999.11.",
    "author": "Rocky Swift",
    "category": "Markets",
    "tags": [
      "dollar"
    ]
  },
  {
    "title": "Idle oil and gas projects risk losing licenses, Bahlil warns",
    "url": "https://www.thejakartapost.com/business/2026/02/16/idle-oil-and-gas-projects-risk-losing-licenses-bahlil-warns.html",
    "date": "2026-02-16T00:00:00",
    "date_parsed": "2026-02-16 00:00:00",
    "summary": "The energy minister has taken an \"all stick, no carrot\" strategy to pressure firms into start pumping oil and gas from stalled projects, threatening hundreds of wells with the prospect of losing their permits.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.101662",
    "content": "nergy and Mineral Resources Minister Bahlil Lahadalia is putting pressure on oil and gas producers to make progress on stalled projects as he warned that hundreds of abandoned areas stood to lose their operating licenses.\n\n“There are 301 working areas that have been explored but have yet to commence [operations]. We are now giving [the concession holders] an ultimatum. If they don’t start operating, we will revoke their licenses,” Bahlil told a panel discussion during the Indonesia Economic Outlook 2026 on Friday at the Wisma Danantara Indonesia, the South Jakarta headquarters of state asset fund Danantara.\n\nBahlil remarked that the government had previously tried a similar approach with investors, threatening them with ultimatums to push them to realize their investments.\n\nHe cited as an example the gas-rich Masela Block managed by Japanese oil and gas giant Inpex, noting that it showed little progress over its 26-year concession.\n\n“However, after they received the ‘love letter’,alhamdulillah[praise be to God], now the investment of around US$18 billion has begun. So I think this is what we will do going forward,” the minister said.\n\nThe country has experienced a long-term decline in oil production since nationwide output peaked at 1.5-1.6 million barrels per day (mbpd) in 1996-1997, gradually falling thereafter to 580,000 barrels per day (bpd) in 2024. Meanwhile, the government’s oil lifting targets have regularly gone unmet since 2016.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nHowever, Bahlil noted that realized production of 605,300 bpd in 2025 marginally surpassed that year’s budget target of 605,000 bpd, marking the first time the national lifting target had been met in nearly a decade.",
    "author": "Ni Made Tasyarani",
    "category": "Regulations",
    "tags": [
      "energy-and-mineral-resources-ministry",
      "Bahlil-Lahadalia",
      "oil-and-gas",
      "oil-and-gas-industry",
      "business-permit"
    ]
  },
  {
    "title": "Site selection for first nuclear plant expected by mid-2026, says renewables official",
    "url": "https://www.thejakartapost.com/business/2026/02/16/site-selection-for-first-nuclear-plant-expected-by-mid-2026-says-renewables-official.html",
    "date": "2026-02-16T00:00:00",
    "date_parsed": "2026-02-16 00:00:00",
    "summary": "According to the ministry's renewables director general, the Bangka Belitung Islands and West Kalimantan are two priority provinces under consideration as a potential site for developing Indonesia's first nuclear power plant toward a 2032 on-grid target.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.102045",
    "content": "he government’s plans to build the first nuclear power plant in Indonesia includes site selection by midyear and a 2032 target to connect the facility to the national electricity grid, according to the Energy and Mineral Resources Ministry.\n\nThe plant is expected to have an initial capacity of 500 megawatts, making it one of the country’s largest low-carbon power projects.\n\n“We are targeting on-grid by 2032, meaning that commissioning must also be completed in 2032. This is the fastest target,” Eniya Listiani Dewi, director general of new and renewable energy, said in the latest episode of theBukan Abulekepodcast, published on Sunday on the ministry’s YouTube channel.\n\nRead also:Govt yet to approve ThorCon plant despite nuclear agency’s green light\n\nElectricity demand in Southeast Asia’s largest economy is expected to rise 50 percent by 2030 and quintuple by 2060. This underscores the challenges of expanding the national power supply without abandoning the country’s net-zero commitment under the Paris Agreement, especially given that 67 percent of its power is currently generated from coal.\n\nEniya told the podcast that the Bangka Belitung Islands and West Kalimantan provinces had been identified as technically suitable for a nuclear facility, though a final decision was still months away.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\n“The location is still being discussed but the process is underway. We expect the formal designation around the middle of this year,” she said.",
    "author": "Ruth Dea Juwita",
    "category": "Regulations",
    "tags": [
      "Nuclear",
      "nuclear-energy",
      "energy-and-mineral-resources-ministry",
      "electricity",
      "electricity-grid",
      "renewable-energy"
    ]
  },
  {
    "title": "Asian markets sluggish as Lunar New Year holiday looms",
    "url": "https://www.thejakartapost.com/business/2026/02/16/asian-markets-sluggish-as-lunar-new-year-holiday-looms.html",
    "date": "2026-02-16T00:00:00",
    "date_parsed": "2026-02-16 00:00:00",
    "summary": "Asian markets were subdued on Monday, as the extended Lunar New Year holiday approached and Japan reported lackluster economic growth.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.102381",
    "content": "sian markets were subdued on Monday, as the extended Lunar New Year holiday approached and Japan reported lackluster economic growth.\n\nThe holiday period meant that trading floors were closed in Shanghai, Seoul and Taipei. Hong Kong and Singapore closed after half-day sessions.\n\nUS markets are also closed for Presidents' Day.\n\nLimp GPD growth in Japan rattled the post-election high of Prime Minister Sanae Takaichi following her recent landslide win.\n\nThe world's fourth-biggest economy expanded just 0.1 percent in the last three months of 2025.\n\nThe figures -- which undershot market forecasts of 0.4 percent -- add pressure on Takaichi, who made boosting economic growth a key pledge ahead of her landslide victory in February 8's snap elections.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nThe weak growth \"implies that the large supplementary budget passed at the end of November provided no boost to public spending last quarter just yet\", Marcel Thieliant at Capital Economics said.\n\n\"In fact, sluggish economic activity increases the chances that Takaichi will not only press ahead with suspending the sales tax on food but enact a supplementary budget during the first half of the fiscal year that starts in April already rather than wait until the end of this year,\" he added.\n\nTokyo closed 0.2 percent down, while Hong Kong rose 0.5 percent as trading closed early for Lunar New Year. Wellington, Jakarta, Manila and Kuala Lumpur posted marginal losses, while Sydney, Mumbai and Bangkok were up and Singapore was little changed.\n\nMarkets showed signs of stabilising after a tech-led plunge last week, when traders reacted to growing concern about the hundreds of billions spent on AI infrastructure and when, if ever, they might see a return on them.\n\nInvestors will keep an eye on artificial intelligence this week as the five-day AI Impact Summit kicks off in New Delhi on Monday, with the likes of OpenAI CEO Sam Altman and Google's Sundar Pichai in attendance.\n\nWhile frenzied demand for generative AI has turbocharged profits and share prices for many technology companies, anxiety is growing over the risks that it poses to society and the environment.\n\nThe sense of calm continued on from Friday, when government data showed consumer inflation in the United States cooling slightly more than expected in January.\n\nAnalysts say the figure allows the US central bank to cut interest rates again later this year, but warn that policymakers need to see sustained improvement in order to do so.\n\n\"US inflation data was good. And the initial response in equities reflected that. But the devil was in the details,\" said Kyle Rodda, senior financial market analyst at Capital.com.\n\n\"Annual headline and core inflation dropped to new lows, with the critical core number falling to the lowest level since March 2021 at 2.4 percent.\"\n\nGold dipped below $5,000 an ounce, slipping after Friday's climb following softer US inflation. Silver fell one percent.\n\n\"Markets have priced in a higher probability of deeper Fed rate cuts this year, driving real yields lower and supporting gold demand,\" Standard Chartered said in a note.\n\n\"We expect gold to remain well-supported.\"",
    "author": "AFP",
    "category": "Markets",
    "tags": [
      "Asian-market",
      "stocks"
    ]
  },
  {
    "title": "Japan's economy limps back to scant growth in Q4, raises test for Takaichi",
    "url": "https://www.thejakartapost.com/business/2026/02/16/japans-economy-limps-back-to-scant-growth-in-q4-raises-test-for-takaichi.html",
    "date": "2026-02-16T00:00:00",
    "date_parsed": "2026-02-16 00:00:00",
    "summary": "Japan's economy limped back to meager growth in the fourth quarter, significantly missing market expectations in a key test for Prime Minister Sanae Takaichi's government as cost-of-living pressures drag on confidence and domestic demand.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.102730",
    "content": "apan's economy limped back to meager growth in the fourth quarter, significantly missing market expectations in a key test for Prime Minister Sanae Takaichi's government as cost-of-living pressures drag on confidence and domestic demand.\n\nFresh off a sweeping election victory, Takaichi's administration is preparing to ramp up investment through targeted public spending in sectors seen as vital to economic security.\n\nMonday's data bring sharp focus to the challenge at hand for policymakers at a time when the Bank of Japan has reiterated its pledge to keep raising interest rates and normalize monetary settings from years of ultra-low borrowing costs.\n\n\"It shows that the economy's recovery momentum is not very strong,\" Meiji Yasuda Research Institute economist Kazutaka Maeda said. \"Consumption, capital expenditure and exports - areas we hoped would drive the economy - just haven't been as strong as we expected.\"\n\nGross domestic product in the world's fourth-largest economy increased an annualized 0.2 percent in the October-December quarter, government data showed, well short of a median market estimate of a 1.6 percent gain in a Reuters poll. It barely scraped back to growth from a larger revised 2.6 percent contraction in the previous quarter.\n\nThe reading translates into a quarterly rise of 0.1 percent, also weaker than the median estimate of a 0.4 percent uptick.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nEconomists project Japan will continue to expand at a gradual pace in coming months, though the fourth quarter's weak outcome suggests the economy might struggle to fire on all cylinders.\n\n\"Whether the economy can achieve sustainable growth really depends on whether real wages can firmly return to positive growth,\" Shinichiro Kobayashi, principal economist at Mitsubishi UFJ Research and Consulting, said. \"In that sense, the key will be the outcome of this year's wage negotiations in the coming months.\"\n\nA survey this month by the Japan Center for Economic Research showed 38 economists forecast an average annualized growth of 1.04 percent in the first quarter and 1.12 percent in the second quarter this year.\n\nKobayashi said the GDP report is unlikely to affect the Bank of Japan's monetary policy decisions. \"Rather than this rate hike causing the economy to stall, the BOJ's focus is likely to be on how to contain inflation,\" he said.\n\nPrivate consumption, which accounts for more than half of economic output, rose 0.1 percent in October-December, matching market estimates.\n\nIt cooled from the 0.4 percent rise in the previous quarter, indicating that persistently high food costs remain a drag on household spending.\n\nCapital spending, a key driver of private demand-led growth, also rose at a slow pace of 0.2 percent in the fourth quarter, versus a rise of 0.8 percent in the Reuters poll.\n\nNet external demand, or exports minus imports, contributed nothing to growth, versus a 0.3 point drag in the July-September period.\n\nExports posted a milder drop after the United States formalized a baseline 15 percent tariff on nearly all Japanese imports, down from 27.5 percent on autos and initially threatened 25 percent on most other goods.\n\n\"The impact of tariffs appears to have peaked in July-September, but judging from the latest results, there is at least some possibility that firms will continue to take a somewhat cautious stance going forward,\" Meiji Yasuda's Maeda said.",
    "author": "Makiko Yamazaki and Chang-Ran Kim",
    "category": "Economy",
    "tags": [
      "Japan-economy",
      "GDP-growth",
      "Japan"
    ]
  },
  {
    "title": "Businesses seek AI regulatory clarity as caution hampers investment",
    "url": "https://www.thejakartapost.com/business/2026/02/15/businesses-seek-ai-regulatory-clarity-as-caution-hampers-investment.html",
    "date": "2026-02-15T00:00:00",
    "date_parsed": "2026-02-15 00:00:00",
    "summary": "Some technology firms deliberately avoid using personally identifiable information in their AI models to reduce compliance risks, despite the limitations this places on their ability to improve operational efficiency.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.105180",
    "content": "echnology firms have warned that regulatory uncertainty in Indonesia is hampering their investment decisions, particularly for those developing artificial intelligence-based products and data-driven platforms, pushing them to be more cautious in pursuing innovation and allocating capital.\n\nRushil Mohan, the founder of logistics technology start-up Pidge, said the lack of clear guidelines forced companies to be more cautious, especially in handling personal data and building predictive models, as the firm explores expansion in Indonesia.\n\n“When you don’t have clarity, you have to choose to be safe, and safety can often be at odds with innovation,” he said toThe Jakarta Poston Feb. 5.\n\n“If there were clearer guardrails and guidelines, what kind of regulation, what kind of models and what kind of outcomes are allowed, supported and encouraged, it would allow us to double down, triple down on our investments into AI.”\n\nPidge deliberately avoids using personally identifiable information in its AI models, relying instead on aggregated and anonymized data.\n\nWhile this reduces compliance risks, Mohan said it limits the company’s ability to generate hyper-personalized recommendations that could significantly improve operational efficiency.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\n“The biggest fear that any company has is that you invest so much in a line of business, in a product, and by the time it reaches the market, governments put a shutdown on it, or regulation puts a shutdown on it,” he said.",
    "author": "Maudey Khalisha",
    "category": "Tech",
    "tags": [
      "AI",
      "artifical-intelligence",
      "AI-regulation",
      "business",
      "business-innovation",
      "policy",
      "regulation"
    ]
  },
  {
    "title": "Vietnam licenses Musk's satellite internet firm Starlink",
    "url": "https://www.thejakartapost.com/business/2026/02/15/vietnam-licenses-musks-satellite-internet-firm-starlink.html",
    "date": "2026-02-15T00:00:00",
    "date_parsed": "2026-02-15 00:00:00",
    "summary": "Vietnam has granted a license to Elon Musk's Starlink to operate its satellite internet services in the communist country, a government agency said.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.105615",
    "content": "ietnam has granted a license to Elon Musk's Starlink to operate its satellite internet services in the communist country, a government agency said.\n\nThe radio frequency regulator said local unit Starlink Services Vietnam Co. can initially deploy four gateway stations and a maximum of 600,000 terminal devices in Vietnam.\n\nThe licensing requires Starlink to ensure \"no interference with existing radio communication networks\", the Radio Frequency Management authority announced on Saturday.\n\nThe Starlink system would contribute to \"expanding satellite internet connectivity\" in the country, it added.\n\nStarlink provides high-speed internet access to remote locations around the world via thousands of low Earth orbit satellites.\n\nNearly 80 percent of Vietnam's around 100 million people are internet users, according to the Vietnam Internet Network Information Center.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nBut gaps in access to internet service remain in rural and mountainous areas.\n\nParent company SpaceX, founded by the world's wealthiest person, Elon Musk, did not immediately reply to a request for comment from AFP on Sunday.\n\nUS-based Starlink says its services in Vietnam are \"coming soon\", according to an availability map on its website.\n\nVietnam and the United States are in the process of negotiating a trade deal after Washington imposed 20 percent tariffs on Vietnamese goods last year.\n\nThe two countries held a sixth round of talks this month, but have not reached a final agreement.\n\nVietnam's top leader To Lam will travel to the United States this week for a meeting of President Donald Trump's \"Board of Peace\", two sources briefed on the visit told AFP last week.\n\nThe board, of which Trump is the chairman, was originally intended to oversee the rebuilding of the Gaza Strip after two years of war, but its charter appears to extend beyond the Palestinian territory.\n\nThe first meeting is scheduled to take place on Feb. 19 in Washington.\n\nIt was not clear if Communist Party General Secretary Lam would also hold trade talks with Trump.\n\nVietnam's government has not confirmed or publicly announced the trip.\n\nThe Southeast Asian manufacturing hub recorded 8.0 percent growth last year despite the US levies many feared would crush its export-oriented growth model.\n\nHanoi is targeting double-digit growth this year.",
    "author": "AFP",
    "category": "Companies",
    "tags": [
      "Vietnam",
      "Starlink",
      "Internet"
    ]
  },
  {
    "title": "China’s ByteDance releases Doubao 2.0 AI model for 'agent era'",
    "url": "https://www.thejakartapost.com/business/2026/02/15/chinas-bytedance-releases-doubao-20-ai-model-for-agent-era.html",
    "date": "2026-02-15T00:00:00",
    "date_parsed": "2026-02-15 00:00:00",
    "summary": "China's ByteDance has rolled out its Doubao 2.0 model, an upgrade of the country's most widely used artificial-intelligence app, the company said on Saturday.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.106038",
    "content": "hina's ByteDance has rolled out its Doubao 2.0 model, an upgrade of the country's most widely used artificial-intelligence app, the company said on Saturday.\n\nByteDance is one of several Chinese firms hoping to generate overseas and domestic buzz around its new AI models during the Lunar New Year holiday, which starts on Sunday, when hundreds of millions of Chinese partake in family gatherings in their hometowns.\n\nThe company, like rival Alibaba, was caught off-guard by DeepSeek's meteoric rise to global fame during last year's Spring Festival, when Silicon Valley and investors worldwide were shocked by how a Chinese firm had come up with a model comparable to OpenAI's best but seemingly developed at a fraction of the cost.\n\nThe release of Doubao 2.0, ahead of a highly anticipated new DeepSeek model, is likely aimed at preventing such a scenario from repeating itself.\n\nA video-generation AI model that ByteDance released on Thursday, Seedance 2.0, has already drawn comparisons with DeepSeek's success last year after going viral on Chinese social media and drawing praise overseas on platforms like X, including from its owner Elon Musk.\n\nDoubao 2.0 is positioned for the \"agent era\", where AI models are expected to execute complex real-world tasks rather than only answer questions, ByteDance said in a statement.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nThe model's pro version includes complex reasoning and multi-step task execution capabilities that match OpenAI's GPT 5.2 and Google's Gemini 3 Pro, while reducing usage costs by roughly an order of magnitude, according to the company.\n\n\"This cost advantage will become even more crucial as real-world, complex tasks involve large-scale inference and multi-step generation that will expend a huge amount of tokens,\" ByteDance said, referring to the unit of data processed by an AI model.\n\nDoubao leads all AI chatbot apps in China with 155 million weekly active users, with DeepSeek second at 81.6 million, according to information provider QuestMobile's most recent data, published in late December.\n\nBut Doubao 2.0's release could help ByteDance fend off recent pressure from domestic competitors.\n\nAlibaba on Feb. 6 announced it was spending 3 billion yuan (US$400 million) on a coupon giveaway campaign to attract more users to its Qwen AI app, allowing them to use the incentives to purchase food and drink directly in the chatbot.\n\nThis led daily active users on Qwen to skyrocket from 7 million to 58 million, just 23 million shy of Doubao's figures on the same day, according to QuestMobile.",
    "author": "Eduardo Baptista",
    "category": "Tech",
    "tags": [
      "Bytedance",
      "AI"
    ]
  },
  {
    "title": "EU proposes extending Russian oil sanctions to maritime services",
    "url": "https://www.thejakartapost.com/business/2026/02/14/eu-proposes-extending-russian-oil-sanctions-to-maritime-services.html",
    "date": "2026-02-14T00:00:00",
    "date_parsed": "2026-02-14 00:00:00",
    "summary": "It has been reported that Karimun, Riau Islands, has been part of a system of traders, shippers and transshipment points, including the floating hub along the Malacca and Singapore straits and Fujairah in the United Arab Emirates, that has helped keep Russian oil and products flowing, despite the sanctions.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.106412",
    "content": "he European Union has proposed extending its sanctions against Russian oil to include full maritime services, which will affect the third-party countries that handle shipping, delivery and financial transactions.\n\nThe proposal, set to affect ports in Kulevi in Georgia and Karimun in Indonesia allegedly involved in handling the oil, would bar EU companies and individuals from conducting transactions with either port.\n\nCommission President Ursula von der Leyen said on Friday the regulation package included sector-wide restrictions, and a shift from the Group of Seven nations' price cap to a full maritime-services ban on Russian crude.\n\nThe latest restriction measures are part of the EU's 20th sanctions package over Russia’s war in Ukraine. The package was jointly drafted by the EU's diplomatic service, the EEAS, and the European Commission, and was presented to EU countries on Monday. EU sanctions require unanimity to be adopted into law.\n\nIf it comes into force, it will be the first time the bloc would target ports in third countries, a proposal document showed on Monday, as reported by Reuters.\n\nRussian oil exports have shifted to Asia from Europe in the aftermath of Moscow's 2022 invasion of Ukraine as Western sanctions aimed at limiting Moscow's oil revenue make direct imports from Russia difficult for many buyers.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nReuters reported that Karimun, Riau Islands, has been part of a system of traders, shippers and transshipment points, including the floating hub along the Malacca and Singapore straits and Fujairah in the United Arab Emirates, that has helped keep Russian oil and products flowing, despite the sanctions.\n\nLocated in a free trade zone on an island about 37 kilometers southwest of Singapore, Karimun terminal has ramped up imports of Russian oil products to become a key transshipment hub where traders store cargoes whose countries of origin are rebranded before re-export.\n\nFrom October 2024 to May 2025, for example, it was reported that the terminal had received Russian oil products every month, ship-tracking data from Kpler showed, with exports to destinations in Malaysia, Singapore and China. Before that, the data show, Russian oil product arrivals at Karimun were only sporadic.\n\nRead also:Pertamina denies claims of Russian crude transshipment\n\nIn a report on Feb. 4, Reuters cited ship-tracking data from Kpler and Vortexa indicating that Indonesia received two cargoes of Russian Sakhalin Blend crude oil, in December 2025 and in January. The cargoes, each measuring approximately 700,000 barrels, were reportedly unloaded at the ports of Balikpapan in East Kalimantan and Cilacap in East Java.\n\nResponding to the February report, Karimun Port operator PT Oil Terminal Karimun said it \"categorically rejects any suggestion that it facilitates or supports Russian oil or petroleum product trade. Such characterizations are unfounded and inaccurate.\"\n\nSeparately, state-owned oil and gas giant Pertamina official Milla Susilo, the former senior communications manager of refinery and petrochemical arm PT Kilang Pertamina Internasional (KPI),toldThe Jakarta Post: “Pertamina has not imported any Russian crude oil.”\n\nPertamina has also claimed that all its oil imports were carried out in accordance with applicable regulations to secure national energy supplies.\n\nThe EU package also adds new import bans on metals such as nickel bars, iron ores and concentrates, unrefined and processed copper and various scrap metals including aluminum. It would also prohibit imports of salt, ammonia, pebbles, silicon and fur skins.\n\nRead also:IEU-CEPA to help iron out ‘any’ remaining bilateral trade issues\n\nThe proposal includes the use of an anti-circumvention tool against a third country for the first time. The new restrictions would ban sales of metal cutting machines and communications machines for voice, image and data transmissions like modems and routers to Kyrgyzstan.\n\nThe EU also proposed adding two Kyrgyz banks, Keremet and OJSC Capital Bank of Central Asia, to its sanctions list for providing crypto asset services to Russia, as well as banks in Laos and Tajikistan, while removing two Chinese lenders. If approved, the listed banks would be barred from transactions with EU individuals and companies.\n\nTo its sanctions framework that includes asset freezes and travel bans, the EEAS proposed adding 30 individuals and 64 companies. These include Bashneft, a listed subsidiary of Russia's oil behemoth Rosneft, as well as eight Russian refineries, among them two major Rosneft-controlled plants, Tuapse and Syzran. The proposal stops short of listing Rosneft or Lukoil, already hit by US sanctions.",
    "author": "Agencies",
    "category": "Regulations",
    "tags": [
      "European-Union",
      "EU",
      "russian-oil",
      "EU-sanction",
      "Karimun",
      "maritime-services",
      "oil-transhipment"
    ]
  },
  {
    "title": "Lunar New Year drives corporate decor boom, but retail demand falters",
    "url": "https://www.thejakartapost.com/business/2026/02/14/lunar-new-year-drives-corporate-decor-boom-but-retail-demand-falters.html",
    "date": "2026-02-14T00:00:00",
    "date_parsed": "2026-02-14 00:00:00",
    "summary": "Sellers of nian gao or kue keranjang in Glodok’s Chinatown area as well as parts of West and Central Java reporting softer sales compared to previous years.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.106804",
    "content": "rders for Lunar New Year (Imlek) decorations began pouring in unusually early this year for Jakarta-based decoration service Party Buddies, as the festive season closely coincides with the fasting month of Ramadan, which starts less than a week later.\n\n“This year, demand is much higher for corporate events with bigger spending. Turnover is maybe 50 to 70 percent higher compared to last year,” the business’s representative, Edhityas Riesta, toldThe Jakarta Poston Wednesday, adding that corporate decoration packages typically range between Rp 2.5 million and Rp 7 million (US$149–$416), depending on scale and customization.\n\nParty Buddies is an example of businesses seeing a surge in corporate demand amid back-to-back festive seasons that are predicted to last until Idul Fitri in mid-March and into the following month. On the other hand, the tight holiday schedule is straining demand from individuals and families, as they prefer to be more cautious with spending.\n\nAccording to Party Buddies, the pickup in corporate demand has been visible since the Christmas and New Year holidays, which rolled directly into Lunar New Year and Ramadan.\n\n“Usually, Ramadan orders come in mid-month, closer to Idul Fitri. But this year, even before Ramadan starts, people are already asking to prepare decorations as early as possible,” she said.\n\nHaving run Party Buddies since 2014, Riesta said demand for Lunar New Year decorations had steadily grown over the past three years, prompting the business to expand its seasonal portfolio.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nDecorations remain central to Imlek celebrations, particularly in malls, offices and public spaces, where red-and-gold color schemes, lanterns and festive installations serve as visual anchors for promotional campaigns and photo spots. Offices, meanwhile, usually prepare elaborate setups for employee open houses and corporate gatherings.",
    "author": "Maudey Khalisha",
    "category": "Economy",
    "tags": [
      "Lunar-New-Year",
      "imlek-tradition",
      "imlek",
      "holiday-season",
      "decoration",
      "business"
    ]
  },
  {
    "title": "'Be realistic' says Prabowo, while defending key programs",
    "url": "https://www.thejakartapost.com/business/2026/02/13/be-realistic-says-prabowo-while-defending-key-programs.html",
    "date": "2026-02-13T00:00:00",
    "date_parsed": "2026-02-13 00:00:00",
    "summary": "President Prabowo Subianto has emphasized the need to be realistic in a speech on the Indonesian economy, where he promoted key initiatives of his administration to drive gross domestic product growth.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.109261",
    "content": "residentPrabowo Subiantohas emphasized the need to be realistic in a speech on the Indonesian economy, where he promoted key initiatives of his administration to drive gross domestic product growth.\n\n“I invite us to be realistic. We have always said that we want to become a developed country. It’s true, we want to become a developed country, but we must not get ahead of ourselves,” Prabowo said in Jakarta on Friday.\n\n“We want to reach the level of countries that have attained an advanced level of technology and industry hundreds of years ahead of us. We may have big dreams, but we must have a realistic attitude,” said the President, speaking at the Indonesia Economic Outlook 2026 event attended by government officials, businesspeople and foreign ambassadors.\n\nThe event comes after concerns expressed by global index compiler MSCI about stock ownership transparency prompted a sell-off in Indonesian equities last month and after credit rating agency Moody’s cut its outlook on Indonesia’s sovereign rating from neutral to negative last week.\n\nOn Monday, Prabowo held a meeting with industry leaders under the Indonesian Employers Association (Apindo) banner to discuss job creation and obstacles businesses face on the ground.\n\nApindo advisory council chairman Sofjan Wanandi toldThe Jakarta Poston Wednesday that one of the topics brought to the table at the meeting was the need to reinvigorate the country’s industrialization.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nSofjan said restrictions on raw material imports created “high costs” for businesses and were among several factors hindering industrial expansion. He said he had brought the matter to the President’s attention and that Prabowo appreciated the concerns expressed and ideas proposed by the attendees.",
    "author": "Ni Made Tasyarani and Deni Ghifari",
    "category": "Economy",
    "tags": [
      "GDP",
      "economy",
      "Prabowo",
      "Purbaya",
      "Indonesia-economy",
      "Indonesia Economic Outlook"
    ]
  },
  {
    "title": "Tiffany & Co stores sealed over alleged illegal imports",
    "url": "https://www.thejakartapost.com/business/2026/02/13/tiffany-co-stores-sealed-over-alleged-illegal-imports.html",
    "date": "2026-02-13T00:00:00",
    "date_parsed": "2026-02-13 00:00:00",
    "summary": "The issue related to items that were not declared in the import notification, resulting in the sealing of the jeweler’s outlets in Plaza Senayan, Plaza Indonesia and Pacific Place.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.109618",
    "content": "he Jakarta Customs and Excise Directorate General has shut down three outlets operated by United States luxury jeweler Tiffany & Co over allegations of illegal imports.\n\nThe authority conducted operations on Wednesday targeting high-value goods suspected of containing items that were not declared in the import notification, resulting in the sealing of the jeweler’s outlets across three Jakarta shopping malls, including Plaza Senayan, Plaza Indonesia and Pacific Place.\n\nFinance Minister Purbaya Yudhi Sadewa confirmed the shutdown on Thursday, stressing that “any company conducting illegal imports will definitely be shut down and sealed”.\n\nHe urged business players to comply with the prevailing regulations, as the government would not tolerate illegal products that potentially harm domestic industries.\n\nPurbaya said the possibility of similar shutdowns at other outlets would depend on “findings on the ground”, adding that businesses would be issued a warning before any closure.\n\n“[Businesses] are usually given a warning first, and if they fail to comply, then they will be sealed,” he said on Thursday, as quoted byTirto.id.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nRead also:Customs office vows to ‘get its act together’ amid dissolution threats",
    "author": "Ni Made Tasyarani",
    "category": "Companies",
    "tags": [
      "Tiffany-and-co",
      "illegal-import",
      "Jakarta-malls",
      "luxury-brand",
      "customs-and-excise",
      "finance-ministry",
      "Purbaya-Yudhi-Sadewa"
    ]
  },
  {
    "title": "High-rise housing still a hard sell in Jakarta, says JLL",
    "url": "https://www.thejakartapost.com/business/2026/02/13/high-rise-housing-still-a-hard-sell-in-jakarta-says-jll.html",
    "date": "2026-02-13T00:00:00",
    "date_parsed": "2026-02-13 00:00:00",
    "summary": "Cumulative sales in high-rise condos stood at just 56 percent last year in a continuation of a decade-long downward trend, while new launches remained subdued in a lackluster market.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.109963",
    "content": "ales performance in Jakarta’s high-rise housing market has been subdued amid a challenging environment and stagnant prices as consumers maintain a strong preference for landed housing, according to leading real estate consultancies.\n\nThe latest research from Jones Lang LaSalle (JLL) Indonesia shows that landed housing in Greater Jakarta last year recorded an 88 percent cumulative sales rate, which measures how quickly a project is absorbed by the market. During the same period, the condominium sector lagged far behind at only 56 percent.\n\nMeanwhile, the Jakarta condominium market experienced a typical slowdown in the last quarter of 2025, when sales declined from the third quarter to reach the year’s lowest level.\n\nJames Taylor, head of research at JLL Indonesia, explained on Thursday at a press briefing in Jakarta that new condominium launches and sales in the capital had followed a downward trend over the past 10 years.\n\n“We didn’t see any new launches and sales decreased quarter-on-quarter [qoq]. So it’s a somewhat challenging market for condominiums. Prices were essentially flat for the same period, and 2025 was no exception,” he said.\n\nOnly one new residential high-rise project launched in the third quarter last year, the JLL report showed, as developers continued to focus their efforts on selling existing stock rather than launching new projects.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nFurthermore, stagnant prices in the fourth quarter reflected subdued market conditions as a result of developers maintaining stable pricing to attract buyers.",
    "author": "Ni Made Tasyarani",
    "category": "Economy",
    "tags": [
      "apartment",
      "property-sector",
      "Jakarta-property-market",
      "high-rise-building",
      "condominium",
      "landed-house"
    ]
  },
  {
    "title": "EU leaders vow to accelerate single market, in struggle to compete with US, China",
    "url": "https://www.thejakartapost.com/business/2026/02/13/eu-leaders-vow-to-accelerate-single-market-in-struggle-to-compete-with-us-china.html",
    "date": "2026-02-13T00:00:00",
    "date_parsed": "2026-02-13 00:00:00",
    "summary": "European Union leaders agreed on Thursday on a wide-ranging set of commitments to improve how the bloc's border-free internal market works so Europe's businesses can be competitive and survive aggressive economic rivalry from the US and China.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.110272",
    "content": "uropean Union leaders agreed on Thursday on a wide-ranging set of commitments to improve how the bloc's border-free internal market works so Europe's businesses can be competitive and survive aggressive economic rivalry from the US and China.\n\nMeeting at a Belgian castle, the leaders stressed how urgent it was to act and agreed to speed up the completion of a savings and investment union, review merger rules to help create European champions, make it easier for companies to get started and scale up and cut red tape throughout, top EU officials said.\n\n\"One Europe one market [...] this is our ambition,\" European Commission chief Ursula von der Leyen said, adding that the EU executive would also crack down on additional layers of legislation that member states add when implementing EU decisions.\n\nSpeed things up\n\nThe European Commission will present in March a plan on how to proceed with this deepening of the European Union's single market of 450 million consumers, with the aim for leaders to agree on a concrete timetable.\n\nThat will include allowing a preference for European goods in public purchases in strategic sectors, von der Leyen told a press conference at the end of the meeting.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nEU growth has persistently lagged that of the United States and China and EU productivity and innovation in fields such as AI has fallen short, with the bloc also squeezed by tariffs and export curbs by its global rivals.\n\n\"The European Union must act quickly and decisively. And this commitment was unanimously emphasized by all participants today,\" German Chancellor Friedrich Merz told reporters.\n\nTo speed things up, von der Leyen said the EU executive arm would push on with a long-delayed capital markets union that would allow some 10 trillion euros (US$11.86 trillion) of savings now languishing in bank accounts to be invested in the EU economy.\n\n\"We agreed that we want to be done with phase one of the Savings and Investment Union, that includes market integration, supervision and securitization by June,\" she said.\n\nIf it is impossible to move forward quickly with all 27 EU countries at the same time, the EU would push on with the project in a smaller group of at least nine member states, she said.\n\nAct together?\n\nA key question now will be whether the EU's 27 member states can overcome self-interest and implement a joint plan of action.\n\nWhile all EU countries want a more competitive bloc, they disagree on how to get there, and have done so for years, on key issues such as whether to issue joint euro bonds, or on how to cut electricity prices.\n\nBut European Council chief Antonio Costa, speaking of Thursday's decisions to speed up unifying Europe's single market, said: \"I think it's really a game changer.\"\n\nOne after the other, EU leaders stressed it was urgent to act.\n\n\"We share the same sense of urgency. We have to accelerate. We are shaken by competition, sometimes by unfair competition and tariffs,\" French President Emmanuel Macron said.\n\nMany leaders also stressed it was vital the EU acts on high energy prices, with Europe's industry facing power prices that are more than double those in the US and China.\n\nWhile no decisions on this were made, the Commission will put forward options on how to proceed at the next EU summit in March, such as whether to continue a system whereby the most expensive energy source, typically gas, sets a common power price, including for cheaper renewables and nuclear.\n\nMeanwhile, von der Leyen defended the EU's emissions trading system (ETS), saying it has \"clear benefits,\" after some government leaders called for the system to be revised.\n\n\"The emission trading system has clear benefits [...] The ETS has also elements that if the price for whatever reason is going too high, or the economic circumstances are tough, that you can with the 'market stability reserve', modulate the price,\" she said.",
    "author": "Julia Payne, Philip Blenkinsop and Ingrid Melander",
    "category": "Economy",
    "tags": [
      "Europe",
      "EU",
      "EU-economy",
      "EU-Institutions"
    ]
  },
  {
    "title": "Asian shares step back from record as tech jitters return, bonds rally",
    "url": "https://www.thejakartapost.com/business/2026/02/13/asian-shares-step-back-from-record-as-tech-jitters-return-bonds-rally.html",
    "date": "2026-02-13T00:00:00",
    "date_parsed": "2026-02-13 00:00:00",
    "summary": "Asian shares retreated from record highs on Friday as worries about shrinking margins in the tech sector hit the likes of Apple, driving investors into safe-haven bonds ahead of key US inflation data.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.110595",
    "content": "sian shares retreated from record highs on Friday as worries about shrinking margins in the tech sector hit the likes of Apple, driving investors into safe-haven bonds ahead of key US inflation data.\n\nOvernight on Wall Street, the technology-heavy Nasdaq Composite tumbled 2 percent after Cisco Systems posted quarterly adjusted gross margin below estimates as costs of memory chips surged. That drove its shares down 12 percent and wiped out about US$40 billion of its market cap.\n\nThe selloff spilled over into tech giants like Apple, which tumbled 5 percent in the biggest daily drop since April last year when US President Donald Trump's sweeping “Liberation Day” tariffs spooked markets. Transportation companies also got caught up in worries about AI disruption.\n\n“The prevailing tone in markets is a rotation toward more defensive areas of the equity market and companies with steady, less cyclical and more predictable earnings,” said Chris Weston, head of research at Pepperstone.\n\n“It is clear that investors are viewing developments in AI and AGI through a new lens, attempting to price a future that feels more uncertain and structurally disruptive than before.”\n\nOn Friday, MSCI's broadest index of Asia-Pacific shares outside Japan fell 0.6 percent, trimming this week's gain to 4.1 percent. Japan's Nikkei skidded 0.9 percent, but was still up 5.3 percent for the week.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nChinese blue chips dropped 0.6 percent while Hong Kong's Hang Seng index slid 1.5 percent.\n\nBoth Nasdaq futures and S&P 500 futures were up 0.1 percent, while Euro STOXX 50 futures climbed 0.2 percent.\n\nPrecious metals attempted to recover from heavy losses. Gold rose 1 percent to $4,972 an ounce, after losing over 3 percent on Thursday, while silver climbed 2 percent to $76.8 an ounce, having plunged 10 percent overnight.\n\nTraders await US inflation test\n\nThe broad selloff in stocks pushed buyers toward US Treasuries, with the yield on the benchmark 10-year note tumbling 7 basis points overnight, its biggest drop since Oct. 10. It was steady in early Friday trade at 4.1154 percent.\n\nA very strong auction of the 30-year bonds helped drive longer-term yields lower. Thirty-year yields slumped 8.5 basis points overnight to 4.728 percent, its lowest since Dec. 3.\n\nFed funds futures also rallied to reverse most of the losses after the payrolls data that led markets to pare back the chance of a rate cut in June. A move in June is now back in play, with the chance priced at 70 percent, and a total easing of 60 basis points is expected this year.\n\nMuch attention will be on the US inflation data due later in the day. Forecasts are centered on a monthly rise of 0.3 percent in the core measure, which is enough to see the annual rate slow to 2.5 percent from 2.7 percent previously.\n\n“Even an in-line result would reflect a meaningful deceleration from December and that could bolster animal spirits and spark energy back into the cyclical trade,” said Jose Torres, a senior economist at Interactive Brokers.\n\nIn the currency markets, the risk-sensitive Australian and New Zealand dollars took a step back. The Aussie was steady at $0.7089, having lost 0.5 percent overnight, while the kiwi traded at $0.6033, after slipping 0.3 percent overnight.\n\nOil prices were flat after a sharp 3 percent slide overnight on falling demand, easing fears of renewed Middle East conflict and an expected increase in supply.\n\nUS West Texas Intermediate crude tacked on 0.2 percent to $62.95 per barrel, while Brent crude futures edged up 0.2 percent to $67.65 per barrel.",
    "author": "Stella Qiu",
    "category": "Markets",
    "tags": [
      "Asian-market",
      "global-markets",
      "stocks"
    ]
  },
  {
    "title": "Danantara’s poultry push raises concerns over market distortion",
    "url": "https://www.thejakartapost.com/business/2026/02/12/danantaras-poultry-push-raises-concerns-over-market-distortion.html",
    "date": "2026-02-12T00:00:00",
    "date_parsed": "2026-02-12 00:00:00",
    "summary": "Indonesia has enjoyed a surplus in chicken meat production since 2020, Statistics Indonesia (BPS) data show, with excess supply continuing even after the free meals program began.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.112976",
    "content": "he government is rolling out integrated poultry farming projects across 12 regions through state asset fund Danantara to supply PresidentPrabowo Subianto’s flagship free nutritious meals program, but economists and industry groups warn the move could distort an already well-supplied market.\n\nThe projects, led by state-owned food holding company PT Rajawali Nusantara Indonesia, or ID Food, via its subsidiary PT Berdikari, will focus on upstream production such as day-old chicks (DOC), vaccines and animal feed, areas long controlled by major private players.\n\nID Food on Friday inaugurated a 5.6-hectare facility in Malang, East Java, with capacity for 18,000 grandparent stock, projected to produce 900,000 parent stock and 130 million final stock.\n\nSimilar facilities are under construction in South Sulawesi, East Kalimantan, Lampung, Gorontalo and West Nusa Tenggara, with total planned investment reaching Rp 20 trillion (US$1.28 billion), fully funded by Danantara.\n\nRead also:Danantara breaks ground on $7b downstream industry projects\n\nBerdikari president director Maryadi said on Monday the project was aimed at addressing what he described as a 1 million tonne gap between national chicken meat demand of 5 million tonnes, and production of about 4 million tonnes annually, much of it concentrated on Java.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\n“The parent stock will be distributed to regions outside Java to support sustainable, efficient and competitive broiler production, with potential output of around 169 million kilograms of chicken carcasses,” Maryadi said in a statement.",
    "author": "Ruth Dea Juwita",
    "category": "Companies",
    "tags": [
      "Poultry",
      "poultry-feed",
      "Danantara",
      "chicken-farmers",
      "ID-Food",
      "Berdikari"
    ]
  },
  {
    "title": "Pertamina to spin off airlines, hospitals, non-oil units this year",
    "url": "https://www.thejakartapost.com/business/2026/02/12/pertamina-to-spin-off-airlines-hospitals-non-oil-units-this-year.html",
    "date": "2026-02-12T00:00:00",
    "date_parsed": "2026-02-12 00:00:00",
    "summary": "Divested assets include hospital groups currently managed by Indonesia Healthcare Corporation (IHC), as well as aviation subsidiary Pelita Air, which is set to be merged with national flag carrier Garuda Indonesia.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.113406",
    "content": "tate-owned oil and gas giant Pertamina will offload 38 noncore subsidiaries in 2026, including hospital, aviation, hotel and insurance businesses, as part of a broader effort to streamline operations and refocus on its core energy business.\n\nPertamina director for transformation and business sustainability Agung Wicaksono said on Wednesday that some of the entities being streamlined are special purpose vehicles under the shipping subholding company, which will remain operational but be folded into a leaner structure.\n\nMeanwhile, noncore units outside the oil and gas sector, such as healthcare, hospitality and aviation, will be gradually divested and grouped under state asset fund Danantara by sector.\n\nDivested assets including hospital groups currently managed by Indonesia Healthcare Corporation (IHC).\n\n“We have already reached an agreement with Danantara on the valuation of IHC, and the process will be continued. Around 38 entities including 12 hospitals are already prepared,” Agung said on Wednesday, as quoted byKumparan.\n\n“But once again, we are ready, and if there are further directions from Danantara, we will execute them,” he added.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nRead also:Danantara breaks ground on $7b downstream industry projects",
    "author": "Ruth Dea Juwita",
    "category": "Companies",
    "tags": [
      "pertamina",
      "Pelita-Air-Service",
      "IHC",
      "hospital",
      "divestment"
    ]
  },
  {
    "title": "Prabowo ordered purge of IDX, OJK leadership, brother says",
    "url": "https://www.thejakartapost.com/business/2026/02/12/prabowo-ordered-purge-of-idx-ojk-leadership-brother-says.html",
    "date": "2026-02-12T00:00:00",
    "date_parsed": "2026-02-12 00:00:00",
    "summary": "Hashim Djojohadikusumo, who is the special envoy for climate change and the brother of President Prabowo Subianto, said the five IDX and OJK officials who resigned soon after last month’s market crash did so in direct response to the President’s order.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.113786",
    "content": "residentPrabowo Subiantowas furious with the recent stock market collapse and ordered the resignations of top leaders at the Indonesia Stock Exchange (IDX) and the Financial Services Authority (OJK), according to his close aide and brother, Hashim Djojohadikusumo.\n\nHashim, who is the special envoy for climate change, said the President had “asked several people to resign” following the market collapse, which was triggered by a warning from global investment research firm MSCI.\n\n“It was because of the absence of transparency. [The IDX] is considered nontransparent. [MSCI] sent four letters to the Indonesian government,” he said on Wednesday, in a speech he delivered during an event at the IDX in South Jakarta.\n\nHashim also warned the bourse’s acting president director Jeffrey Hendrik and OJK commissioner Hasan Fawzi, both of whom attended the IDX event, that the government was closely watching the market as well as its performance.\n\n“I met eight investors last Monday. They asked me and the government to maintain our market credibility,” he continued.\n\n“ForPak[Mr.] Prabowo, the country’s dignity is very important. So he is watching very closely.”\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nFive finance officials, including IDX president director Iman Rachman and OJK chairman Mahendra Siregar,tendered their resignationafter the two-day collapse on Jan. 28 and 29, dubbedthe worst stock market crashin the country since the 1998 Asian financial crisis.",
    "author": "News Desk",
    "category": "Regulations",
    "tags": [
      "Indonesia-Stock-Exchange",
      "IDX",
      "OJK",
      "market-transparency",
      "market-credibility",
      "hashim-djojohadikusumo",
      "Prabowo-Subianto"
    ]
  },
  {
    "title": "Gold edges lower on firmer dollar after strong US jobs data",
    "url": "https://www.thejakartapost.com/business/2026/02/12/gold-edges-lower-on-firmer-dollar-after-strong-us-jobs-data.html",
    "date": "2026-02-12T00:00:00",
    "date_parsed": "2026-02-12 00:00:00",
    "summary": "Gold prices dipped on Thursday, as the U.S. dollar firmed after stronger-than-expected January jobs data dented expectation for near-term interest rate cuts, while investors awaited inflation data due on Friday for more monetary policy cues.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.114203",
    "content": "Gold prices dipped on Thursday, as the U.S. dollar firmed after stronger-than-expected January jobs data dented expectation for near-term interest rate cuts, while investors awaited inflation data due on Friday for more monetary policy cues.\n\nSpot gold edged 0.3 percent lower to $5,065.98 per ounce by 0318 GMT. It closed Wednesday with a more than 1% gain.\n\nUS gold futuresGCcv1for April delivery lost 0.2 percent to $5,087.30 per ounce.\n\n\"The stronger jobs report leading to a slight pare back in Fed rate-cut expectations may have played a role in gold's lackluster move,\" said Christopher Wong, a strategist at OCBC.\n\nThe US dollar index rose following the surprisingly strong employment report that suggested underlying US economic health. A stronger dollar makes greenback-priced metals more expensive for other currency holders.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\n\"Sensitivity to the dollar, yield repricing, and uncertainty around Fed policy should continue to pose two-way risks for gold in the interim,\" Wong said.\n\nUS job growth unexpectedly accelerated in January and the unemployment rate fell to 4.3 percent, though the largest increase in payrolls in 13 months likely exaggerates the labor market's health, as revisions showed the economy added only 181,000 jobs in 2025 instead of the previously estimated 584,000.\n\nThe US budget deficit will grow slightly in fiscal 2026 to $1.853 trillion, the Congressional Budget Office forecast on Wednesday, showing that on balance, President Donald Trump's economic policies are worsening the country's fiscal picture amid low economic growth.\n\nThe Federal Reserve will keep rates unchanged through Chair Jerome Powell's term ending in May but cut immediately afterward in June, a Reuters poll showed, with economists warning that policy under his likely successor, Kevin Warsh, could become too loose.\n\nInvestors now await the weekly jobless claims report on Thursday and inflation data on Friday for more cues on the Fed's monetary policy path.",
    "author": "Ishaan Arora",
    "category": "Markets",
    "tags": [
      "gold-prices",
      "global-markets",
      "US-economy"
    ]
  },
  {
    "title": "Danantara’s IDX ownership plan gets guarded welcome",
    "url": "https://www.thejakartapost.com/business/2026/02/12/danantaras-idx-ownership-plan-gets-guarded-welcome.html",
    "date": "2026-02-12T00:00:00",
    "date_parsed": "2026-02-12 00:00:00",
    "summary": "Danantara CEO Rosan Roeslani pointed out that it is common practice for sovereign wealth funds (SWFs) to hold stakes in bourses, typically ranging from 15 percent to 30 percent.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.114592",
    "content": "tate asset fund Danantara is gearing up to secure stakes in the Indonesia Stock Exchange (IDX) as authorities aim to demutualize the bourse, transforming it from a member-owned entity dominated by brokerages into a regular corporation that can include external stakeholders.\n\nAnalysts have expressed cautious optimism about the government fund’s entry into the capital market, acknowledging that the move could help stabilize market shocks while warning of potential risks to the bourse’s independence.\n\nDanantara CEO Rosan Roeslani has said that the institution is assessing plans to become one of the IDX’s future shareholders once the demutualization is rolled out. He pointed out that it is common practice for sovereign wealth funds (SWFs), a role Danantara partly fulfills, to hold stakes in several global bourses, typically ranging from 15 to 30 percent.\n\nHe stressed that ownership after the IDX’s demutualization would not be limited to Danantara, as opportunities would also be open to other SWFs and foreign investors.\n\n“We’re currently waiting for the process from the OJK [Financial Services Authority] and IDX. But of course, once the demutualization is implemented, with a separation between membership and ownership, we’re open to the possibility of participating in the IDX in terms of ownership,” he told reporters on the sidelines of the CNA Summit on Thursday.\n\nDanantara has been highly involved in the capital market reform agenda following a rout triggered by global stock market index compiler MSCI over transparency concerns regarding the ownership of Indonesian stocks, which raised the risk of a status downgrade from emerging market to frontier market.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nRead also:IDX plunges after MSCI warning about RI stocks",
    "author": "Ni Made Tasyarani",
    "category": "Markets",
    "tags": [
      "IDX",
      "Danantara",
      "OJK",
      "bourse-regulation",
      "capital-market",
      "stock-market",
      "MSCI"
    ]
  },
  {
    "title": "Indonesia ready to bridge trade, investment in Islamic world",
    "url": "https://www.thejakartapost.com/business/2026/02/11/indonesia-ready-to-bridge-trade-investment-in-islamic-world.html",
    "date": "2026-02-11T00:00:00",
    "date_parsed": "2026-02-11 00:00:00",
    "summary": "According to \"State of Global Islamic Economy Report 2024-2025\", Indonesia is ranked third in the global Islamic economy, after Malaysia and Saudi Arabia.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.337705",
    "content": "ndonesia has the strategic position to become a hub connecting Islamic trade and investment in the Asia Pacific region, chairman of the Indonesian Business Council’s (IBC) supervisory board Arsjad Rasjid said recently.\n\n“Indonesia has geographical advantages and trust from Muslim countries. We are ready to connect Muslim businesspeople with real business opportunities, from partnership to big investment,” he said on Wednesday at the Indonesia-Business 57+ (B57+) Roundtable, which was held in conjunction with the Indonesia Economic Summit (IES) 2026 in Jakarta.\n\n“And we are also open to cooperation with global investors who are interested in the Islamic economy.”\n\nThe B57+ business forum is designed as an inclusive platform that brings together governments, businesspeople and international partners to discuss concrete strategies to strengthen economic connectivity among Islamic countries and their strategic partners.\n\nIndonesia is positioned as a main cooperation node through the establishment of the B57+ Asia-Pacific chapter during IES 2026.\n\n“The initiative is aimed at uniting leaders from the private sector from the Organization for Islamic Cooperation [OIC] to strengthen trade, investment and economic collaboration in the world’s Islamic markets,” Arsjad said.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\n“Islamic countries have tremendous market scales and production bases, but the potential can be maximized through stronger connectivity in which Indonesia could become the center.”\n\nThe Islamic economic performance has grown strongly, with the halal sector amounting to US$2.43 trillion in 2023 and is expected to reach $3.36 trillion by 2028. The Islamic finance sector showed even greater growth, with asset values expected to rise from $4.93 trillion to $7.53 trillion in the same period.\n\nAccording to “State of Global Islamic Economy Report 2024-2025”, Indonesia ranked third in the global Islamic economy, after Malaysia and Saudi Arabia.\n\nPresident of the Islamic Chamber of Commerce and Development (ICCD) and chairman of the Federation of Saudi Chambers of Commerce, Abdullah Saleh Kamel supported Indonesia’s role in strengthening economic integration in the Islamic world through the B57+ Asia-Pacific regional chapter.\n\n“B57+ provides a practical cooperation framework for businesspeople in Islamic countries to get connected,” he said.\n\n“Indonesia has a vital role in building bridges for cross-region trade and investment.”\n\nReligious Affairs Minister Nasaruddin Umar also supported the B57+ initiative, saying it was in line with Islamic economic principles of justice and cooperation, and related to the real sector.\n\n“The halal economy is one of the important economic movers in Indonesia,” he said.\n\n“With a large market and integrated from upstream to downstream, the halal economy can push growth, widen financing access and improve Indonesia’s competitiveness in global supply chains.”",
    "author": "News Desk",
    "category": "Economy",
    "tags": [
      "OIC",
      "Islamic",
      "economy",
      "IBC",
      "Arsjad-Rasjid",
      "cooperation"
    ]
  },
  {
    "title": "Indosat Ooredoo Hutchison shows healthy fundamentals in 2025 with 12.2% net profit growth",
    "url": "https://www.thejakartapost.com/business/2026/02/11/indosat-ooredoo-hutchison-shows-healthy-fundamentals-in-2025-with-12-2-net-profit-growth.html",
    "date": "2026-02-11T00:00:00",
    "date_parsed": "2026-02-11 00:00:00",
    "summary": "Indosat Ooredoo Hutchison (ISAT) demonstrated robust performance throughout 2025, recording revenue of Rp 56.5 trillion (US$3.37 billion) in addition to double-digit profit growth of 12.2 percent year-on-year (yoy) and 51 percent quarter-on-quarter (qoq) to Rp 5.5 trillion.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.338186",
    "content": "ndosat Ooredoo Hutchison (ISAT) demonstrated robust performance throughout 2025, recording revenue of Rp 56.5 trillion (US$3.37 billion) in addition to double-digit profit growth of 12.2 percent year-on-year (yoy) and 51 percent quarter-on-quarter (qoq) to Rp 5.5 trillion.\n\nReflecting the company’s healthy business fundamentals in an increasingly dynamic industry, revenue rose 9 percent qoq to Rp 15.36 trillion in the fourth quarter of 2025, while earnings before interest, tax, depreciation and amortization (EBITDA) increased 12 percent qoq to Rp 26.6 trillion with an EBITDA margin of 47.1 percent, demonstrating healthy financial fundamentals and disciplined execution.\n\nAccording to Vikram Sinha, president director and CEO of Indosat Ooredoo Hutchison, 2025 was an important year for the company, which continued to strengthen its foundation for long-term sustainable growth.\n\n“We closed 2025 with strong momentum, delivering on our guidance and ending the year on a solid trajectory into 2026, marked by robust revenue growth, accelerating profitability and strong net profit,” Sinha said in a statement.\n\nIn addition, Indosat enhanced customer value and experience, as reflected in its blended average revenue per user (ARPU), which increased 6.4 percent yoy to Rp 44,000.\n\nThe company attributed this growth to rising data consumption and stronger engagement across both the prepaid and postpaid segments. In particular, the postpaid customer base grew 19.7 percent yoy, reflecting increasing trust in the company’s service quality and reliability.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nIndosat also attributed last year’s performance to consistent execution of artificial intelligence-powered hyper-personalization, a superior network experience and customer-centric innovations such as the AI-powered 360 Scam and Spam Protection, which safeguards users across multiple digital channels through an advanced agentic platform.\n\n“Our progressive ARPU growth is driven by AI-powered hyper-personalization, a stronger network and our relentless focus on delivering a remarkable customer experience,” said Sinha.\n\n“Guided by our purpose to empower Indonesia, we are strengthening our foundation through disciplined investment, operational excellence and AI-driven transformation to build a resilient, inclusive and future-ready digital ecosystem.”\n\nExpanding connectivity\n\nAs Indonesians increasingly rely on digital connectivity for work, learning, commerce and daily communication, Indosat continued to strengthen its network through improved nationwide coverage.\n\nBy the end of 2025, the company’s total network footprint grew 11.1 percent yoy to over 278,000 base transceiver stations (BTS), including more than 213,000 4G BTS, ensuring broader coverage and improved capacity across key regions.\n\nMeanwhile, Indosat significantly accelerated its 5G rollout, increasing its reach to more than 6,800 5G BTS sites nationwide, or over 60 times the previous year’s figure.\n\nWith faster speeds, lower latency and future-ready connectivity, the rapid expansion reinforces the company’s role in laying the foundation for the next phase of digital growth in Indonesia.\n\nWhile maintaining high network reliability, Indosat has introduced its fixed wireless access (FWA) solution through the HiFi Air brand, which aims to support the evolving digital needs of Indonesian customers. With 5G services and HiFi Air now available in 24 cities, Indosat closed 2025 with approximately 400,000 Home Broadband (HBB) customers.\n\nBeyond speed and coverage, Indosat has also emphasized the importance of building a safe and trusted digital environment as digital interactions continue to grow, strengthening customer protection through the 2025 rollout of its AI-powered anti-spam and anti-scam features, which help customers identify and avoid fraudulent calls and suspicious messages.\n\nThe initiatives are set against the backdrop of Indosat’s broader AI integration with advanced network capabilities to deliver smarter, more adaptive and more human-centered connectivity.\n\nThrough continuous investment in digital infrastructure, data-driven operations and innovation, Indosat is accelerating its transformation into an AI-driven company committed to advancing Indonesia’s digital ecosystem.",
    "author": "Creative Desk",
    "category": "Companies",
    "tags": [
      "adv-BC",
      "adv-IndosatOoredooHutchison",
      "Indosat",
      "Indosat-Ooredoo",
      "profit",
      "growth"
    ]
  },
  {
    "title": "PLN EPI breaks ground on Rp1 trillion gas pipeline",
    "url": "https://www.thejakartapost.com/business/2026/02/11/pln-epi-breaks-ground-on-rp1-trillion-gas-pipeline.html",
    "date": "2026-02-11T00:00:00",
    "date_parsed": "2026-02-11 00:00:00",
    "summary": "PT PLN Energi Primer Indonesia has begun the construction of a Rp 1 trillion (US$59.57 million) gas pipeline linking the West Natuna Transportation System (WNTS) to Pemping Island, Batam.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.338549",
    "content": "T PLN Energi Primer Indonesia has begun the construction of a Rp 1 trillion (US$59.57 million) gas pipeline linking the West Natuna Transportation System (WNTS) to Pemping Island, Batam.\n\nThe pipeline is designed to reorient gas supplies toward domestic consumption and provide electricity for the rapidly growing industrial hub.\n\nPLN EPI president director Rakhmad Dewanto said the pipeline was built to provide for Batam's escalating energy demand.\n\n“Batam's future electricity demand will continue to increase and will be met primarily with gas. While most associated gas is currently exported to Singapore, this pipeline will prioritize channeling supply toward meeting Batam's domestic needs,\" Rakhmad said on Tuesday, as reported byBisnis.com.\n\nRead also:Industry group decries supply shortage, high prices in cheap gas program\n\nHe added that the project would be executed in several phases.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nThe initial stage targeted a distribution capacity of approximately 33 million standard cubic feet per day (mmscfd), which would later be increased to 111 billion British thermal units per day (bbtud) under an 11-year supply commitment.",
    "author": "Divya Karyza",
    "category": "Companies",
    "tags": [
      "PLN-EPI",
      "gas-pipeline",
      "industrial-growth",
      "Batam"
    ]
  },
  {
    "title": "SWA RoboKnights to represent Indonesia at VEX Robotics World Championship in the US",
    "url": "https://www.thejakartapost.com/business/2026/02/11/swa-roboknights-to-represent-indonesia-at-vex-robotics-world-championship-in-the-us.html",
    "date": "2026-02-11T00:00:00",
    "date_parsed": "2026-02-11 00:00:00",
    "summary": "In a masterclass of skill and strategy, Sinarmas World Academy’s SWA RoboKnights powered through the VEX Robotics Indonesia National Championship 2025/2026, earning six major awards and securing a coveted spot on the global stage.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.338949",
    "content": "n a masterclass of skill and strategy, Sinarmas World Academy’s SWA RoboKnights powered through the VEX Robotics Indonesia National Championship 2025/2026, earning six major awards and securing a coveted spot on the global stage.\n\nWith this historic sweep, the teams will represent Indonesia at the VEX Robotics World Championship in the United States.\n\nAmid fierce competition, SWA RoboKnights excelled across multiple categories, with the elementary, middle and high school teams winning the Skills Only award.\n\nIn addition, the teams also took home another three awards, including the Excellence Award by the 50251A SWA RoboKnights HS team, the Design Award courtesy of 85968B SWA RoboKnights MS team, and the Judges Award by the 85968A SWA RoboKnights ES team.\n\n“We are incredibly proud of how far our students have come. To have all elementary, middle and high school teams qualify for the VEX Robotics World Championship simultaneously speaks volumes about the strength of SWA’s robotics program,” said Dr. Haoken, SWA’s IBDP coordinator.\n\n“This is what innovation looks like in an IB learning environment. Students build, test, fail forward, reflect and improve through a disciplined design cycle. They learn to collaborate under pressure, communicate decisions with evidence and lead with purpose – skills that matter in life.”\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nIsabel, a member of 50251A SWA RoboKnights HS, said she learned many new and complicated skills that will help her in the future.\n\n“I learned that through collaboration, brainstorming and problem-solving, we would be able to accomplish difficult tasks. While building the robot, we felt frustrated while troubleshooting, but we still got through it. The most nerve-racking part was competing, as I had to have full belief in my team, which taught me that in order to be successful, we need a good and solid team.”\n\nThe milestone extended beyond the arena. In partnership with PT Provisi Mandiri Pratama, Sinarmas World Academy also made history by becoming the pioneer host of a VEX Robotics competition in Indonesia, bringing together top young talents from various international schools and serving as a platform to showcase the growing strength and quality of STEM education in Indonesia.\n\n“As the pioneer host of the VEX Robotics national competition in Indonesia, SWA strengthens its position as the leader in delivering globally aligned STEM education,” said Deddy Djaja Ria, general manager of Sinarmas World Academy.\n\n“SWA remains committed to equipping students with future-ready skills through innovation, collaboration and real-world challenges.”\n\nBuilding a track record on the world stage\n\n(Courtesy of Sinarmas World Academy)\n\nBeyond this year’s victories, SWA RoboKnights’ achievements over the past two years reflect a longer-term blueprint for developing future innovators with personal focus and proven results.\n\nHighlights include first place at the World Robot Olympiad (WRO) International Final 2024 in Izmir, Türkiye (Future Innovators, Junior Category); first place at WRO Indonesia 2025 in Surabaya (Future Innovators, Senior Category); and three gold medals along with the Start-Up Award at the WRO International Final 2025 in Singapore (Future Innovators, Senior Category).\n\nThrough project-based learning and international competitions, students are trained to think systemically, solve real-world problems and develop leadership skills from an early age. Through these accomplishments, SWA RoboKnights carry Indonesia’s name onto the world stage.\n\nThis journey underscores a simple truth seen across elite robotics programs worldwide: when education is built on long-term vision, consistent processes, and trust in students’ potential, achievement is no longer the end goal, instead becoming part of a lifelong path toward the future.",
    "author": "Creative Desk",
    "category": "Companies",
    "tags": [
      "adv-BC",
      "adv-sinarmasworldacademy",
      "Sinarmas",
      "Sinarmas-World-Academy",
      "robotic"
    ]
  },
  {
    "title": "Buoyant stocks pause for breath on signs of softening US consumption",
    "url": "https://www.thejakartapost.com/business/2026/02/11/buoyant-stocks-pause-for-breath-on-signs-of-softening-us-consumption.html",
    "date": "2026-02-11T00:00:00",
    "date_parsed": "2026-02-11 00:00:00",
    "summary": "Bonds jumped and a rebound in stock markets slowed down on Wednesday after softer-than-expected US retail sales figures, while a rally in the yen has extended and might be beginning to signal a shift in investor thinking since Japan's election.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.339299",
    "content": "onds jumped and a rebound in stock markets slowed down on Wednesday after softer-than-expected US retail sales figures, while a rally in the yen has extended and might be beginning to signal a shift in investor thinking since Japan's election.\n\nTrade in Asia was lightened by a holiday in Japan and markets in Hong Kong and China opened around flat.\n\nGold rose back above US$5,000 an ounce and Treasury futures climbed a little, with the cash market closed.\n\nBenchmark 10-year US Treasury yields fell nearly six basis points overnight and touched a one-month low of 4.14 percent after data showed a 0.1 percent dip in core US retail sales in December and downward revisions to November and October figures.\n\nYields fall when bond prices rise. The S&P 500 closed 0.3 percent lower, as a recovery from last week's heavy selling in software shares starts to lose momentum.\n\nAlphabet shares, which fell 1.8 percent, weighed on the market as the Google parent is in the midst of raising debt to fund an AI infrastructure spending spree.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nIn Asia, S&P 500 futures were 0.2 percent higher. Nikkei futures rose, though the cash market was shut for a holiday, and earnings drove moves in the Australian market, which was up 1 percent around the middle of the day in Sydney.\n\nCommonwealth Bank of Australia shares jumped 7 percent as Australia's top mortgage lender posted record earnings, loan growth, held market share and lifted its dividend.\n\nShares in CSL, a biotech company that makes most of its money selling blood plasma treatments for rare illnesses, dived 12 percent and touched eight-year lows after the company reported a fall in first-half profit and, late on Tuesday, announced the departure of its CEO.\n\nAustralia's beleaguered bourse operator ASX, which has run into trouble with regulators as it tries to overhaul its trading technology, also announced the departure of its CEO late on Tuesday and shares were down 5.5 percent on Wednesday.\n\n**Jury's out on yen bounceback**\n\nIn currency markets, a resurgent yen and a rising yuan have the dollar on the back foot.\n\nThe yen, trading at 153.96 per dollar, gained nearly 1 percent on the greenback on Tuesday and has bounced 2 percent since Japan's Prime Minister Sanae Takaichi and her ruling Liberal Democratic Party swept to a landslide election win on Sunday.\n\nMany investors had been expecting a weaker currency on nerves about how Takaichi would pay for stimulus plans. But bond markets have been surprisingly steady since her victory, stocks have soared and so some investors are rethinking assumptions.\n\n“To be long yen, you need to believe that the correlation to Nikkei will break and it becomes an unhedged ‘buy Japan’ trade,” said Brent Donnelly, a currency trader and founder of analytics firm Spectra Markets.\n\n“That’s possible. I just think the jury’s still out.”\n\nThe yen also rose sharply on crosses overnight. The euro was steady at $1.1894 while the kiwi and Aussie held on above 60 cents and 70 cents, respectively.\n\nChina's yuan was steady in early trade after surging to its highest in almost three years on Tuesday, riding corporate demand for cash ahead of the Lunar New Year break.\n\nData showed China's consumer prices rose just 0.2 percent in January from the same month last year, missing expectations for a 0.4 percent rise and underlining the weakness of domestic demand.\n\nThat supported Chinese government bond futures.\n\nBrent crude oil futures steadied at $68.80 a barrel with markets hanging on US-Iran diplomacy. Bitcoin has struggled to progress beyond the $70,000 barrier and was pinned around $69,000 on Wednesday.",
    "author": "Tom Westbrook",
    "category": "Markets",
    "tags": [
      "global-markets",
      "stocks",
      "bonds",
      "US-economy"
    ]
  },
  {
    "title": "Pertamina denies Russian crude imports as EU mulls sanctions",
    "url": "https://www.thejakartapost.com/business/2026/02/10/pertamina-denies-russian-crude-imports-as-eu-mulls-sanctions.html",
    "date": "2026-02-10T00:00:00",
    "date_parsed": "2026-02-10 00:00:00",
    "summary": "The European Union has proposed unprecedented sanctions against Indonesia’s Karimun Port for handling Russian oil.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.339620",
    "content": "tate-owned energy firm Pertamina has denied importing Russian oil as the European Union reportedly considers unprecedented sanctions against Indonesia’s Karimun Port.\n\nIn a report on Feb. 4, Reuters cited ship-tracking data from Kpler and Vortexa indicating that Indonesia received two cargoes of Russian Sakhalin Blend crude oil, in December 2025 and January 2026.\n\nThe cargoes, each measuring approximately 700,000 barrels, were reportedly unloaded at the ports of Balikpapan and Cilacap.\n\nResponding to the report, Pertamina official Milla Susilo, the former senior communications manager of refinery and petrochemical arm PT Kilang Pertamina Internasional (KPI), toldThe Jakarta Post: “Pertamina has not imported any Russian crude oil.”\n\nPreviously, Pertamina noted that all its oil imports were carried out in accordance with applicable regulations to secure national energy supplies.\n\nPertamina vice president of corporate communications Muhammad Baron said the firm was liaising with relevant subsidiaries to assess the accuracy of the circulating reports.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\n\"Pertamina always follows prevailing rules in carrying out its operations, including the oil import mechanism to meet national energy needs,\" Baron said on Feb. 4, as reported byKontan.",
    "author": "Divya Karyza",
    "category": "Economy",
    "tags": [
      "crude-oil",
      "import",
      "Russia",
      "EU",
      "trade"
    ]
  },
  {
    "title": "Retail sales post strong annual gain as consumer confidence holds up",
    "url": "https://www.thejakartapost.com/business/2026/02/10/retail-sales-post-strong-annual-gain-as-consumer-confidence-holds-up.html",
    "date": "2026-02-10T00:00:00",
    "date_parsed": "2026-02-10 00:00:00",
    "summary": "The retail sales index dipped slightly in January when compared with the holiday month of December but is up a strong 7 percent year-on-year.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.339965",
    "content": "ndonesian consumers are upbeat heading into the new year thanks to rising optimism about the near-term outlook, and retail sales are far stronger than a year ago, according to preliminary data.\n\nSurvey results published by Bank Indonesia (BI) on Tuesday show the retail sales index (RSI) dipping to 228.3 points in January from 229.8 points in December, marking a 0.6 percent contraction when compared with the preceding month, which had benefited from the seasonal holiday spending boost.\n\nThe index was up a strong 7.9 percent year-on-year (yoy), however, jumping from 211.5 points logged in January 2025. The monthly contraction was also far less intense than last year, when the RSI dipped by 4.7 percent month-to-month (mtm) heading into January.\n\nBI spokesman Ramdan Denny Prakoso said in a statement released together with the data that the growth was “primarily supported” by increased sales in cultural and recreational goods, as well as food, beverages and tobacco, alongside clothing.\n\nThe central bank had initially projected an RSI reading of 231.7 points for December, but that figure was revised down by 0.8 percent.\n\nSales of information and communication devices, such as mobile phones, were still projected to be deep in contraction in January, as has been the case for the last two years, while sales of any other goods were projected to be in positive territory. Sales of clothing were projected to grow by 8 percent yoy in January after four months of sustained contraction.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nRead also:Indonesia retail sales pick up but consumer confidence flatlines",
    "author": "Deni Ghifari",
    "category": "Economy",
    "tags": [
      "consumer-confidence",
      "consumer-confidence-index",
      "retail-sales",
      "retail-sales-index",
      "RSI",
      "CCI",
      "bank-indonesia",
      "BI"
    ]
  },
  {
    "title": "Finance Ministry’s SMI secures $9.3m grants to expand green finance",
    "url": "https://www.thejakartapost.com/business/2026/02/10/finance-ministrys-smi-secures-9-3m-grants-to-expand-green-finance.html",
    "date": "2026-02-10T00:00:00",
    "date_parsed": "2026-02-10 00:00:00",
    "summary": "PT SMI operates as a development finance institution providing corporate and public financing alongside project advisory and preparation services.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.340274",
    "content": "tate-owned infrastructure financier PT Sarana Multi Infrastruktur (PT SMI) on Tuesday signed two grant agreements and two memorandums of understanding (MoUs) with international development partners, to secure new funding to deepen Indonesia’s sustainable finance market and accelerate the country’s energy transition.\n\nThe agreements were signed during the Donor Coordination Meeting in Jakarta on Feb. 4, bringing together multilateral lenders and bilateral development agencies to support blended finance schemes under PT SMI’s SDG Indonesia One (SIO) platform and the Energy Transition Mechanism (ETM).\n\nOne of the commitments came from Germany’s KfW Development Bank, which agreed to provide grant funding of up to €7.82 million (US$9.3 million) to establish a Green Bond Development Facility aimed at accelerating the issuance of green and sustainability bonds in Indonesia.\n\nThe facility is expected to strengthen environmental, social and governance (ESG) standards among bond issuers while mobilizing greater private capital into climate-aligned investments.\n\nPT SMI also signed an extension of a grant agreement with France’s Agence Française de Développement (AFD) to optimize the use of remaining grant funds for project preparation, particularly in green and inclusive infrastructure development.\n\nRead also:Why a just land transition needs real funding\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nAt the same event, the state-owned firm entered into MoUs with the Global Green Growth Institute (GGGI) and the Japan International Cooperation Agency (JICA) to expand cooperation on energy transition financing, project development, waste management and sustainable infrastructure.",
    "author": "Maudey Khalisha",
    "category": "Companies",
    "tags": [
      "SMI",
      "grant",
      "green-finance",
      "green-economy"
    ]
  },
  {
    "title": "Indonesia’s growth: Resilient but uneven",
    "url": "https://www.thejakartapost.com/business/2026/02/10/indonesias-growth-resilient-but-uneven.html",
    "date": "2026-02-10T00:00:00",
    "date_parsed": "2026-02-10 00:00:00",
    "summary": "Although formal job creation has improved, job quality, reflected in income stability, benefits and productivity, remains unequal.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.340569",
    "content": "ndonesia’s economy continues to record steady growth, reaching 5.11 percent in 2025, a modest acceleration from 5.03 percent in 2024. Amid a global environment characterized by heightened geopolitical tensions, market fluctuation and slowing growth momentum, an expansion of around 5 percent reflects a degree of macroeconomic resilience.\n\nHeadline indicators remain broadly supportive, with inflation kept under control, fiscal deficits contained and public debt ratios relatively low compared with many peer economies. Overall, the macroeconomic outlook appears stable.\n\nHowever, beyond these aggregate indicators, questions remain about how widely economic gains are being shared. While overall macroeconomic performance has been maintained, certain segments, particularly middle- and lower-income households, continue to face persistent pressures.\n\nBased on the latest twice-yearly National Socioeconomic Survey (Susenas) data, the size of the middle class, defined as households with monthly spending between Rp 2 million and Rp 10 million (US$119 - $596), has continued to decline. The middle-class share of the population now stands at 16.6 percent, down from around 21 percent prior to the pandemic.\n\nThe middle class has long been a key pillar of Indonesia’s consumption-driven growth model. In recent years, however, this segment has encountered growing structural challenges. Rising living costs, modest real income growth and limited availability of quality jobs have weighed on discretionary spending. This has been reflected in softer demand for non-essential goods and services, even as basic consumption remains relatively resilient.\n\nAgainst this backdrop, Indonesia’s key challenge is increasingly about the quality and inclusiveness of growth. Economic expansion delivers its full value when it translates into improvements in living standards, yet for many households this transmission has been less evident. Real wage growth has been relatively modest, particularly in labor-intensive and informal sectors that employ a large share of the workforce.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nFurthermore, although formal job creation has improved, job quality, reflected in income stability, benefits and productivity, remains uneven.\n\nBased on the National Labor Force Survey (Sakernas) data, the proportion of formal workers has risen to 42 percent, though still below pre-pandemic level at 44 percent. This also suggests that the proportion of informal workers is still larger, at 57.8 percent. Consequently, many households are employed but continue to face financial pressure, with income gains largely used to maintain, rather than improve, living standards. These pressures reflect not only cyclical factors, but also underlying structural constraints.\n\nJob availability, skills mismatches and limited productivity gains have limited income growth. Without stronger income growth among middle-income households, consumption, as the main engine of Indonesia’s economy, risks losing momentum over time.\n\nIn recent years, labor market development has been accompanied by limited growth in quality jobs. Although overall employment has improved alongside the economic recovery, much of the increase has been concentrated in informal, low-productivity or lower-paying roles. This has limited income growth and weakened the transmission of employment gains to stronger household purchasing power.\n\nUneven sectoral growth has also been a key contributing factor. Capital-intensive sectors, such as commodities, mining-related activities and downstreaming industries, have expanded more rapidly, supporting investment and export performance but generating relatively fewer jobs. In contrast, labor-intensive sectors that traditionally absorb a large share of the workforce, including parts of manufacturing, construction and agriculture, have grown more modestly in the past few years. This imbalance has constrained overall job absorption despite steady headline GDP growth.\n\nWithin manufacturing and services, growth has also become increasingly concentrated in lower value-added activities. Manufacturing expansion has been led by resource-based processing and basic assembly, while progress in higher-value, globally competitive industries, such as advanced manufacturing, electronics, textiles and garments, has been more limited. Similarly, services growth has been driven largely by low value segments such as retail trade and vehicle repair, rather than higher value areas including professional, digital and knowledge-based services. This structure continues to limit the creation of higher-quality jobs with stronger productivity and wage prospects.\n\nAddressing these challenges will not be straightforward and will require a renewed focus on structural reforms. With much of the country’s physical infrastructure already in place, policy priorities increasingly need to shift toward strengthening human capital, particularly by aligning skills development with evolving industry needs. Advancing the manufacturing sector also remains crucial, as it has the potential to generate higher-quality employment and support more sustainable income growth.\n\nAt the same time, greater policy predictability and clearer communication are essential to strengthen investor confidence and encourage long-term capital deployment into higher-value, job-creating sectors. More consistent regulatory frameworks, transparent industrial policies and clearer reform priorities would help improve business confidence, encouraging capital mobilization toward more competitive manufacturing and services, ultimately supporting better-quality employment over time.\n\nEconomic growth, after all, is not measured solely in percentages, but in whether people feel their economic future is moving forward. Indonesia’s economy remains resilient, the next challenge is ensuring that this resilience is more widely felt.\n\n*****\n\nThe writer is a senior economist at Bank Mandiri.",
    "author": "Dian Ayu Yustina",
    "category": "Economy",
    "tags": [
      "GDP",
      "economic-growth",
      "factory",
      "labor",
      "labor-affairs",
      "equality"
    ]
  },
  {
    "title": "Fiscal discipline remains intact, govt insists, after Moody’s outlook cut",
    "url": "https://www.thejakartapost.com/business/2026/02/10/fiscal-discipline-remains-intact-govt-insists-after-moodys-outlook-cut.html",
    "date": "2026-02-10T00:00:00",
    "date_parsed": "2026-02-10 00:00:00",
    "summary": "State Secretary Prasetyo Hadi said on Monday that the government continued to adhere to fiscal rules and had not breached statutory deficit limits, stressing that budget management remained on a prudent footing.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.340856",
    "content": "he government has asserted that it remains confident in its ability to keep the budget deficit under control, after credit ratings agency Moody’s Investors Service cut the country’s sovereign outlook to negative from stable.\n\nState Secretary Prasetyo Hadi said on Monday the government continued to adhere to fiscal rules and had not breached statutory deficit limits, stressing that budget management remained on a prudent footing.\n\n“There have been no violations. The deficit ceiling is still being maintained,” Prasetyo told reporters at the State Palace.\n\nThe government was focused on strengthening economic fundamentals by boosting real-sector activity and accelerating early-year spending to support growth, he said, adding that the administration remained optimistic about its fiscal management and continued to engage with international stakeholders.\n\n“What matters is that we stay focused on ensuring strong economic fundamentals, pushing the real sector, and maximizing early-year government spending,” Prasetyo said.\n\nMoody’s last week affirmed Indonesia’s sovereign credit rating at Baa2, one notch above the minimum investment-grade level, but revised the credit rating outlook to negative.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nThe ratings agency cited concerns over policy effectiveness and signs of weakening governance, trends that it said could erode the country’s long-established policy credibility if they persisted.",
    "author": "Ruth Dea Juwita",
    "category": "Economy",
    "tags": [
      "moodys",
      "Moodys-Investors-Service",
      "budget-deficit",
      "State-Palace",
      "credit-rate",
      "sovereign-rating"
    ]
  },
  {
    "title": "Jury told that Meta, Google 'engineered addiction' at landmark US trial",
    "url": "https://www.thejakartapost.com/business/2026/02/10/jury-told-that-meta-google-engineered-addiction-at-landmark-us-trial.html",
    "date": "2026-02-10T00:00:00",
    "date_parsed": "2026-02-10 00:00:00",
    "summary": "Meta and Google-owned YouTube were accused Monday of pushing highly addictive apps on children as a landmark social media trial began in earnest in a California court.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.341213",
    "content": "eta and Google-owned YouTube were accused Monday of pushing highly addictive apps on children as a landmark social media trial began in earnest in a California court.\n\nThe blockbuster trial in front of a Los Angeles jury could establish a legal precedent on whether the social media juggernauts deliberately designed their platforms to lead to addiction in children.\n\nThe proceedings are expected to see Meta chief Mark Zuckerberg on the stand next week and Instagram boss Adam Mosseri in the courtroom as early as Wednesday. In addition to Instagram, Meta's platforms include Facebook and WhatsApp.\n\n\"This case is about two of the richest corporations in history who have engineered addiction in children's brains,\" plaintiffs' attorney Mark Lanier told the jury in his opening statement.\n\n\"This case is as easy as A-B-C,\" Lanier said as he stacked children's toy blocks bearing the letters.\n\nHe contended the A was for addicting, the B for brains and the C for children.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\n\"They don't only build apps; they build traps,\" Lanier said, saying Meta and YouTube pursued \"addiction by design,\" making his arguments using props like a toy Ferrari and a mini slot machine.\n\nMeta attorney Paul Schmidt countered in opening remarks to the jury that evidence will show problems with the plaintiff's family and real-world bullying took a toll on her self-esteem, body image and happiness rather than Instagram.\n\n\"If you took Instagram away and everything else was the same in Kaley's life, would her life be completely different, or would she still be struggling with the same things she is today?\" Schmidt asked, pointing out an Instagram addiction is never mentioned in medical records included in the evidence.\n\nThe trial before Judge Carolyn Kuhl focuses on allegations that a 20-year-old woman identified as Kaley G.M. suffered severe mental harm because she became addicted to social media as a child.\n\nThe case is being treated as a bellwether proceeding because its outcome could set the tone, and the level of payouts to successful plaintiffs, for a tidal wave of similar litigation across the United States.\n\nSocial media firms are accused in hundreds of lawsuits of leading young users to become addicted to content and suffer from depression, eating disorders, psychiatric hospitalization and even suicide.\n\nLawyers for the plaintiffs are borrowing strategies used in the 1990s and 2000s against the tobacco industry, which faced a similar onslaught of lawsuits arguing that companies knowingly sold a harmful product.\n\nLanier told the jurors that Kaley began watching YouTube at six years old because the company never told her mother \"the goal was viewer addiction,\" or that toddlers as young as two were being targeted despite \"critical\" risk of addiction.\n\n\"This is the first time that a social media company has ever had to face a jury for harming kids,\" Social Media Victims Law Center founder Matthew Bergman, whose team is involved in more than 1,000 such cases, told AFP.\n\nInternet titans have argued that they are shielded by Section 230 of the US Communications Decency Act, which frees them from responsibility for what social media users post.\n\nHowever, this case argues that those firms are culpable for business models designed to hold people's attention and to promote content that can harm their mental health.\n\nThe plaintiffs said they would call expert witnesses that will argue that young people's brains are not yet developed to withstand the powers of the algorithms being flung at them on Instagram and YouTube.\n\nThe company pointed to recent efforts to provide more safeguards for young people, adding that \"we're always working to do better.\"\n\nJose Castaneda, a YouTube spokesperson, said \"the allegations in these complaints are simply not true.\"\n\nLawyers for YouTube are to present opening remarks to the jury on Tuesday.\n\nSnapchat and TikTok were named as defendants in the suit, but struck settlement deals before the start of the trial. The terms were not disclosed.\n\nLawsuits, including some brought by school districts, accusing social media platforms of practices endangering young users are making their way through federal court in northern California and state courts across the country.\n\nA separate lawsuit accusing Meta of putting profit over the wellbeing of young users was also getting under way in New Mexico on Monday.",
    "author": "Benjamin Legendre",
    "category": "Tech",
    "tags": [
      "Meta",
      "Google",
      "YouTube",
      "addiction",
      "trial",
      "social-media"
    ]
  },
  {
    "title": "Bulog proposes Mecca warehouse to stock haj rice exports",
    "url": "https://www.thejakartapost.com/business/2026/02/10/bulog-proposes-mecca-warehouse-to-stock-haj-rice-exports.html",
    "date": "2026-02-10T00:00:00",
    "date_parsed": "2026-02-10 00:00:00",
    "summary": "Bulog’s planned warehouse in the Haj Village will also be used to store other food commodities from Indonesia, such as meat and fish, to meet the consumption needs of the haj pilgrims.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.341535",
    "content": "tate-owned logistics agency Bulog has proposed building a warehouse within Indonesia’s upcoming Haj village in Mecca, Saudi Arabia, as the government plans to export 2,280 tonnes of premium rice this year for haj pilgrims.\n\nBulog president director Ahmad Rizal Ramdhani said that in the first phase, the exported rice would be distributed through organizers or kitchens that cook for Indonesian haj pilgrims in Saudi Arabia, followed by plans to build its own warehouse in the Haj Village to manage the rice supply directly.\n\n“We have coordinated with the Haj Minister and submitted a request for Bulog to be given a space in the Haj Village. If allowed, Bulog will build a warehouse there, so that the rice from Indonesia can be stored and distributed directly to meet the needs of pilgrims,” Rizal said on Monday, as quoted byKumparan.\n\nBulog’s planned warehouse in the Haj Village will also be used to store other food commodities from Indonesia, such as meat and fish, to meet the consumption needs of the haj pilgrims.\n\nRizal said that rice exports to Saudi Arabia would continue to be implemented as long as Indonesia could maintain its food self-sufficiency, helping reduce the haj pilgrims’ reliance on supplies from other countries, such as Thailand and Vietnam.\n\n“This is a matter of national pride. For the initial stage, the scheme will still operate on a business-to-business basis, which later will be incorporated into the operational financing components of the haj [program],” he added.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nRead also:Industry wants clarity on Indonesia’s ‘Haj Village’ in Mecca",
    "author": "Ni Made Tasyarani",
    "category": "Economy",
    "tags": [
      "Bulog",
      "rice",
      "rice-export",
      "food-self-sufficiency",
      "haj-village",
      "Agriculture-Ministry"
    ]
  },
  {
    "title": "EU proposes sanctions on Indonesian ports for handling Russian oil",
    "url": "https://www.thejakartapost.com/business/2026/02/10/eu-proposes-sanctions-on-indonesian-ports-for-handling-russian-oil.html",
    "date": "2026-02-10T00:00:00",
    "date_parsed": "2026-02-10 00:00:00",
    "summary": "The proposal would bar EU companies and individuals from conducting transactions with Karimun Port in Indonesia and Kulevi Port in Georgia.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.341865",
    "content": "he European Union has proposed extending its sanctions against Russia to include ports in Georgia and Indonesia that handle Russian oil, the first time the bloc would target ports in third countries, a proposal document showed on Monday.\n\nThe proposal, reviewed by Reuters, would add Kulevi in Georgia and Karimun in Indonesia to the sanctions list, barring EU companies and individuals from conducting transactions with either port.\n\nThe measures form part of the EU's 20th sanctions package over Russia’s war in Ukraine. The package was jointly drafted by the EU's diplomatic service, the EEAS, and the European Commission, and was presented to EU countries on Monday. EU sanctions require unanimity in order to be adopted into law.\n\nOn Friday, Commission President Ursula von der Leyen said the package included sector-wide restrictions, and a shift from the Group of Seven nations' price cap to a full maritime-services ban on Russian crude.\n\nThe package also adds new import bans on metals such as nickel bars, iron ores and concentrates, unrefined and processed copper, and various scrap metals including aluminum. It would also prohibit imports of salt, ammonia, pebbles, silicon and furskins.\n\nThe proposal includes the use of an anti-circumvention tool against a third country for the first time. The new restrictions would ban sales of metal cutting machines and communications machines for voice, image and data transmissions like modems and routers to Kyrgyzstan.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nThe EU also proposed adding two Kyrgyz banks, Keremet and OJSC Capital Bank of Central Asia, to its sanctions list for providing crypto asset services to Russia, as well as banks in Laos and Tajikistan, while removing two Chinese lenders. If approved, the listed banks would be barred from transactions with EU individuals and companies.\n\nTo its sanctions framework that includes asset freezes and travel bans, the EEAS proposed adding 30 individuals and 64 companies. These include Bashneft, a listed subsidiary of Russia's oil behemoth Rosneft, as well as eight Russian refineries, among them two major Rosneft-controlled plants, Tuapse and Syzran. The proposal stops short of listing Rosneft or Lukoil, already hit by US sanctions.",
    "author": "Julia Payne",
    "category": "Regulations",
    "tags": [
      "oil",
      "Russia",
      "Russia-Ukraine-war",
      "port",
      "oil-imports",
      "EU"
    ]
  },
  {
    "title": "FTSE Russell postpones Indonesia index review",
    "url": "https://www.thejakartapost.com/business/2026/02/10/ftse-russell-postpones-indonesia-index-review.html",
    "date": "2026-02-10T00:00:00",
    "date_parsed": "2026-02-10 00:00:00",
    "summary": "About US$120 billion has been wiped from the benchmark Jakarta Composite after larger rival MSCI warned last month the country risked a downgrade to frontier status.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.342222",
    "content": "ndex provider FTSE Russell has postponed a scheduled review for Indonesia, due to uncertainty about how freely stocks trade, in a fresh blow for markets in Southeast Asia's biggest economy which are facing criticism over trading and transparency.\n\nAbout US$120 billion has been wiped from the benchmark Jakarta Composite after larger rival MSCI warned last month the country risked a downgrade to frontier status.\n\nMoody's cut its credit rating outlook last week.\n\nFTSE Russell said in a Feb. 9 statement that it will postpone a review planned for March following feedback from an advisory committee comprising of investment professionals and considering \"adverse turnover and the uncertainty in determining the accurate free float percentages of Indonesian securities.\"\n\nWith immediate effect, it said, newly listed Indonesian stocks will not be added to its products nor will they be updated to reflect other additions, deletions or changes in weighting that usually form part of regular index reviews.\n\nMSCI had similarly frozen updates for Indonesian securities in its products.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nMSCI and FTSE indexes are widely used as benchmarks for investors and are tracked by billions of dollars in passive funds, meaning their decisions can drive capital flows.",
    "author": "Reuters",
    "category": "Markets",
    "tags": [
      "stock-market",
      "stock",
      "IDX",
      "FTSE",
      "MSCI"
    ]
  },
  {
    "title": "Poverty at record low as govt seeks to redefine threshold",
    "url": "https://www.thejakartapost.com/business/2026/02/09/poverty-at-record-low-as-govt-seeks-to-redefine-threshold.html",
    "date": "2026-02-09T00:00:00",
    "date_parsed": "2026-02-09 00:00:00",
    "summary": "The poverty rate rests at a historic low of 8.25 percent of the total population, continuing its declining trend from September 2022.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.344229",
    "content": "ndonesia has yet again recorded a historic low poverty rate amid a state agenda of lifting the poverty line that statistically will double the population of poor people and risk bad political optics. This data point is one to which government officials attach great importance as a benchmark for creating better economic policies.\n\nPoverty Alleviation Acceleration Agency (BP Taskin) head Budiman Sudjatmiko toldThe Jakarta Poston Monday that current poverty line was set “very low” and therefore risked “statistical invisibility” as the population vulnerable to poverty is out of the equation even though they are just “one shock away” from falling into extreme poverty.\n\n“Because the poverty database is artificially shrunk, it could risk structural mistargeting of social aid and subsidy, not just due to a technical error. The working poor, such as informal laborers, small farmers and gig workers, are often ineligible [for social aid],” said Budiman.\n\nHe claimed that PresidentPrabowo Subiantohas passed on to him the need to revise the poverty line in keeping with the up-to-date method to alleviate prosperity, “not just stopping at survival mode”.\n\nStatistics Indonesia (BPS) head Amalia Adininggar Widyasanti revealed in a press conference on Thursday that the population in poverty has decreased by about half a million from 23.85 million in March to 23.36 million people in September of last year.\n\nThe poverty rate rested at 8.25 percent of total population, continuing its declining trend from September 2022 and is the lowest ever measured since the statistics bureau began logging the metric in 1960.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nBPS defines a poor person as anyone consuming goods and services valued at no more than Rp 641,443 (US$38.14) per month, which was a 5.3 percent increase from the threshold applied at the previous survey in March.",
    "author": "Deni Ghifari",
    "category": "Economy",
    "tags": [
      "poverty",
      "poverty-alleviation",
      "poverty-rate",
      "budiman-sudjatmiko",
      "BPS",
      "Gini-coefficient",
      "Statistics-Indonesia",
      "National-Economic-Council",
      "DEN"
    ]
  },
  {
    "title": "Indonesia proposes 3 measures to meet MSCI's transparency demands",
    "url": "https://www.thejakartapost.com/business/2026/02/09/authorities-propose-3-measures-to-meet-mscis-transparency-demands.html",
    "date": "2026-02-09T00:00:00",
    "date_parsed": "2026-02-09 00:00:00",
    "summary": "As part of their eight-point plan, Indonesian authorities have come up with three proposed measures to meet MSCI's transparency demands and avoid potential downgrading to emerging market status.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.344708",
    "content": "he Financial Services Authority (OJK) and the Indonesian capital market’s self-regulatory organizations (SROs) have proposed a series of measures to meet demands from global index compiler MSCI, which flagged transparency concerns over Indonesian stocks and sparked a major sell-off last month.\n\nThe SROs, which include the Indonesia Stock Exchange (IDX) and the Indonesia Central Securities Depository (KSEI), are set to make policy changes as market authorities prepare for a second meeting with MSCI on Wednesday.\n\n“The OJK and SROs have reiterated a strong commitment to implementing bold and ambitious reforms to align with regional and global practices,” Hasan Fawzi, interim chief executive of capital markets at the OJK, told a press conference on Monday.\n\nHe elaborated that the authorities had discussed three proposed measures following their first meeting with MSCI on Feb. 2.\n\nThe first is to improve transparency by disclosing the names of shareholders that own stakes of 1 percent and above, beginning in February.\n\nThe second is to improve data granularity by expanding the KSEI’s investor classification from nine main categories currently to a more detailed breakdown into 28 subsectors, for implementing by the end of March.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nFinally, the third is to raise the minimum free float in listed stocks from 7.5 percent to 15 percent, which is also targeted for completion by the end of March.",
    "author": "Ni Made Tasyarani",
    "category": "Regulations",
    "tags": [
      "IDX",
      "OJK",
      "MSCI",
      "stock-market",
      "bourse-regulation"
    ]
  },
  {
    "title": "Thomas Djiwandono sworn in as BI deputy governor",
    "url": "https://www.thejakartapost.com/business/2026/02/09/thomas-djiwandono-sworn-in-as-bi-deputy-governor.html",
    "date": "2026-02-09T00:00:00",
    "date_parsed": "2026-02-09 00:00:00",
    "summary": "The former deputy finance minister, who also President Prabowo Subianto's nephew, replaced Juda Agung, who resigned as BI deputy governor on Jan. 13 and was inaugurated as deputy finance minister on Thursday.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.348097",
    "content": "homas “Tommy” Djiwandono was officially sworn in as a deputy governor of Bank Indonesia (BI) on Monday at the Supreme Court in Jakarta, marking the start of his 2026-2031 term in the central bank’s leadership.\n\nThe former deputy finance minister replaced Juda Agung, who resigned as BI deputy governor on Jan. 13. The two officials effectively swapped positions, with Juda having earlier been inaugurated by PresidentPrabowo Subiantoas deputy finance minister at the State Palace in Jakarta on Thursday.\n\nTommy was appointed under Presidential Decree No. 10/P of 2026 on the appointment of a Bank Indonesia deputy governor.\n\nHe was selected as BI’s new deputy governor after passing a fit-and-proper test at House of Representatives Commission XI on Jan. 26, defeating two long-serving central bank officials, Dicky Kartikoyono and Solikin M. Juhro, before being formally approved in the House’s plenary session.\n\nRead also:Ex-BI deputy replaces Tommy as deputy finance minister\n\nDuring the selection process, Tommy outlined his support for a pro-growth monetary policy stance and proposed ending the burden-sharing scheme between the government and BI, which allows the central bank to bear part of the cost of financing the state budget.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nWhile the scheme “was necessary” during the pandemic, he said the policy focus had since shifted toward driving economic growth.",
    "author": "Maudey Khalisha",
    "category": "Economy",
    "tags": [
      "Thomas-Djiwandono",
      "BI",
      "bank-indonesia",
      "Prabowo"
    ]
  },
  {
    "title": "Danantara breaks ground on $7b downstream industry projects",
    "url": "https://www.thejakartapost.com/business/2026/02/09/danantara-breaks-ground-on-7b-downstream-industry-projects.html",
    "date": "2026-02-09T00:00:00",
    "date_parsed": "2026-02-09 00:00:00",
    "summary": "The projects, launched simultaneously across 13 regions on Friday, are fully funded from Danantara’s internal resources and are expected to create about 6,000 direct jobs, the fund said in a statement.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.348578",
    "content": "tate asset fund Danantara has begun construction of six downstream industrial projects worth a combined US$7 billion, marking the first phase of a broader, multi-stage investment program aimed at strengthening domestic processing industries.\n\nThe projects, launched simultaneously across 13 regions on Friday, are fully funded from Danantara’s internal resources and are expected to create about 6,000 direct jobs, the fund said in a statement.\n\nInvestment and Downstream Minister Rosan Roeslani, the CEO of Danantara, said that the first-phase projects span the minerals, renewable energy and food sectors, supporting the government’s push to shift economic growth away from raw commodity exports toward higher-value industrial processing.\n\nMinerals account for the largest share of the initial investment, with about $3 billion allocated to an integrated aluminum smelter project covering the full value chain from bauxite processing into alumina and aluminum.\n\nState-owned mining holding company PT Mineral Industri Indonesia, known as MIND ID, together with its subsidiaries PT Indonesia Asahan Aluminium (Inalum) and PT Aneka Tambang (Antam), inaugurated construction of a bauxite-alumina-aluminum processing complex in Mempawah, West Kalimantan.\n\nThe complex comprises a new aluminum smelter with an annual capacity of 600,000 tonnes and a Phase II smelter grade alumina refinery (SGAR) with a capacity of 1 million tonnes per year.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nTotal investment for the Mempawah project amounts to Rp 87.7 trillion ($5.6 billion), including Rp 14.8 trillion for the SGAR Phase II, Rp 40.6 trillion for the aluminum smelter and Rp 32.3 trillion for power generation facilities, according to MIND ID data.",
    "author": "Ruth Dea Juwita",
    "category": "Companies",
    "tags": [
      "Danantara",
      "processing-industry",
      "downstream-industry",
      "state-assets"
    ]
  },
  {
    "title": "Japan's Takaichi may struggle to soothe voters and markets",
    "url": "https://www.thejakartapost.com/business/2026/02/09/japans-takaichi-may-struggle-to-soothe-voters-and-markets.html",
    "date": "2026-02-09T00:00:00",
    "date_parsed": "2026-02-09 00:00:00",
    "summary": "Japanese stocks soared to record highs Monday after Prime Minister Sanae Takaichi's election triumph, but experts warned that the country's first woman leader could struggle to keep both voters and markets happy.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.349025",
    "content": "apanese stocks soared to record highs Monday after Prime Minister Sanae Takaichi's election triumph, but experts warned that the country's first woman leader could struggle to keep both voters and markets happy.\n\nIn its best result since its founding in 1955, Takaichi's conservative Liberal Democratic Party won a two-thirds majority in Sunday's snap lower house election, according to Japanese media.\n\nWith the result, Takaichi, 64, managed to capitalize on her strong popularity since taking the helm of a moribund LDP in October and becoming Japan's fifth premier in five years.\n\nOn Monday the Nikkei 225 briefly jumped more than five percent to pass 57,000 points for the first time, while the yen strengthened against the dollar.\n\nAnalyst Kyle Rodda of Capital.com said the victory handed Takaichi \"the mandate she was looking for for her big-spending agenda\".\n\nEquities are \"poised to benefit from higher fiscal spending but interest rates that remain accommodative and negative in real terms\", he said.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nAnd SPI Asset Management's Stephen Innes said: \"Politically, the win hands [...] Takaichi freedom of movement and removes the need to bargain every decision down to the lowest common denominator.\"\n\nBut a major reason for voters deserting the party in past elections was inflation, an unwelcome phenomenon for households after several decades of stable or falling prices.\n\nThe cost of rice, for example, doubled in 2025.\n\nFood tax\n\nAfter a $US135-billion stimulus last year, economists said Takaichi's room for maneuver was limited because of market concerns about Japan's debt, which at more than twice the size of gross domestic product is a bigger ratio than any other major economy.\n\nThe yen has also weakened, prompting speculation that Japanese authorities -- potentially in partnership with US officials -- might intervene to provide support.\n\nOff-the-cuff remarks by Takaichi earlier this month talking up the benefits for Japanese exporters of a weaker yen added to pressure on the currency.\n\nIn the election campaign Takaichi floated the idea of suspending a consumption tax on food items, but this sent yields on long-term Japanese bonds to record levels.\n\nOn Sunday she told local media further discussions were needed on such a move, which Bloomberg News reported would cost 5 trillion yen ($32 billion) in lost annual revenue.\n\n\"Most parties are in favor of reducing the consumption tax [...] I strongly want to call for the establishment of a supra-party forum to speed up discussion on this, as it is a big issue,\" Takaichi said.\n\nShe also reiterated her mantra of having a \"responsive and proactive\" fiscal policy.\n\nBut she added: \"We will ensure necessary investments. Public and private sectors must invest. We will build a strong and resilient economy.\"\n\n'Betrayed'\n\nTetsuo Kotani at the Japan Institute of International Affairs said Takaichi could struggle to keep voters happy and that they could end up feeling \"betrayed\".\n\n\"In reality, the policies of a Takaichi administration are unlikely to curb the inflation that voters expect her to address,\" he warned.\n\n\"An income tax hike linked to increased defense spending will also be unavoidable. If these policies lead to a triple decline in stocks, the yen, and government bonds, people's lives will become even more difficult.\"\n\nTakaichi has also pledged to increase defense spending as part of commitments to US President Donald Trump that Japan will be less reliant on Washington.\n\nKotani said that because of a personnel shortage -- linked to Japan's low birth rate -- this will \"not amount to a fundamental strengthening of Japan's defense capabilities\".\n\nMarcel Thieliant at Capital Economics added that he did not expect Takaichi to embark on any new major spending splurges or tax cuts.\n\n\"[We] view the recent fiscal expansion as an attempt to bolster public support ahead of the election rather than as a sign of things to come,\" he said in a note.\n\n\"With Upper House elections not due until 2028, we don't expect any further major fiscal loosening.\"\n\nHiroshi Shiratori, politics professor of Hosei University, said Takaichi wanted to emulate the \"Abenomics\" of former premier Shinzo Abe -- her mentor -- of big spending and lower interest rates.\n\n\"But Abemonics was done at the time of deflation in Japan and a higher yen,\" Shiratori told AFP.\n\n\"Now is the time of inflation, and the cheaper yen exacerbating inflation, with the market reacting on worries over potential worsening of fiscal conditions,\" he said.\n\n\"But not all voters understand this logic.\"",
    "author": "Julien Girault",
    "category": "Economy",
    "tags": [
      "Japan",
      "Japan-election",
      "financial-market"
    ]
  },
  {
    "title": "Asian markets rally as Japan shares surge to record peak",
    "url": "https://www.thejakartapost.com/business/2026/02/09/asian-markets-rally-as-japan-shares-surge-to-record-peak.html",
    "date": "2026-02-09T00:00:00",
    "date_parsed": "2026-02-09 00:00:00",
    "summary": "Nikkei jumped 4.2 percent to all-time highs as the government's decisive majority after the election clears the way for more spending and tax cuts.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.349368",
    "content": "sian markets leapt higher on Monday as a resounding win for Japanese Prime Minister Sanae Takaichi whetted appetites for more reflationary policies, while there was widespread investor relief at Wall Street's last gasp rebound.\n\nA rally in chip stocks and bargain hunting in beaten-down momentum plays including silver had helped shore up sentiment, as did wagers of more rate cuts from the US Federal Reserve.\n\nA rate cut by June is now seen as an odds-on bet, with a slew of economic data this week on jobs, inflation and spending expected to reinforce the case for stimulus.\n\nJapan's Nikkei led the gains with a jump of 4.2 percent to all-time highs as the government's decisive majority clears the way for more spending and tax cuts.\n\n\"Cutting the consumption tax on food is a positive for domestic consumption spending, increased military spending is a positive for defense stocks,\" said Jamie Halse, managing director at Senjin Capital in Sydney.\n\n\"The real question is what other measures may be possible now with the huge mandate granted by gaining a two-thirds majority,\" he added. \"The voters have clearly endorsed Sanaenomics, so it is possible further measures may be announced.\"\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nMSCI's broadest index of Asia-Pacific shares outside Japan rose 1.0 percent, while South Korea's tech-heavy index climbed 3.9 percent.\n\nS&P 500 futures rose 0.4 percent and Nasdaq futures added 0.6 percent, having both bounced more than 2 percent on Friday to break a run of heavy losses.\n\nChip stocks saved the day with Nvidia jumping almost 8 percent, while Advanced Micro Devices surged over 8 percent and Broadcom rose 7 percent.\n\nYet concerns remained about whether the truly massive amounts being spent on AI will ever make a return, and which companies will ultimately benefit or fail. The four largest US tech giants alone plan to spend US$650 billion on capex this year.\n\n\"Investors are sensibly rotating from AI spenders to beneficiaries, services to manufacturing, US exceptionalism to global rebalancing,\" wrote analysts at BofA in a note. \"We are long Main St, short Wall St.\"\n\nUS data to test Fed wagers\n\nTo keep the rally going, US data this week would need to be benign enough to keep rate cuts alive, but not so weak as to threaten consumer demand and earnings.\n\nPayrolls are forecast to rise 70,000 in January, to leave the unemployment rate at 4.4 percent, though payroll growth over 2025 is also expected to be revised down quite sharply.\n\nRetail sales are seen up a moderate 0.4 percent, while headline and core consumer price inflation is forecast to slow a little to 2.5 percent in January.\n\nAny downside misses would tend to pull Treasury yields and the dollar lower, though the yen and pound have plenty of troubles of their own.\n\nInvestors have already sold the yen and JGBs in anticipation of Takaichi's debt-funded expansionary policies, leaving the dollar steady at 157.22, and some way from the recent peak at 159.45. Analysts assume a push toward 160 would likely draw threats of intervention from Tokyo.\n\nThe euro was flat at $1.1810, having held to a tight range for the past week or so, while sterling was stuck at $1.3597 still plagued by political uncertainty amid speculation UK Prime Minister Keir Starmer could lose his job.\n\nStarmer's chief of staff, Morgan McSweeney, quit on Sunday, saying he took responsibility for advising Starmer to name Peter Mandelson as ambassador to the US despite his known links to Jeffrey Epstein.\n\n\"Should Starmer be replaced, gilt yields initially rise and the pound weakens,\" said Ruth Gregory, deputy chief UK economist at Capital Economics.\n\n\"The most likely longer-lasting influence is a loosening in fiscal policy that leads to higher gilt yields than otherwise and a weaker pound than otherwise.\"\n\nIn commodity markets, silver added 2.4 percent to $79.82, after swinging wildly from a 15 percent loss to a 9 percent closing gain on Friday. The metal had plunged in the last two weeks as leveraged positions were caught in a vicious squeeze triggering margin calls and forced selling.\n\nGold was also up 1.5 percent at $5,033 an ounce, having been as low as $4,403 at one stage last week.\n\nOil prices continued to gyrate as markets waited on the outcome of talks between the US and Iran, which have so far failed to reduce the risk of a military conflict between the two countries.\n\nBrent edged down 0.8 percent to $67.52 a barrel, while US crude fell 0.7 percent to $63.09 per barrel.",
    "author": "Wayne Cole",
    "category": "Markets",
    "tags": [
      "Nikkei",
      "Sanae-Takaichi",
      "Japan",
      "stock-market",
      "gold",
      "silver",
      "AI"
    ]
  },
  {
    "title": "Crackdown on mining permits faces legal scrutiny",
    "url": "https://www.thejakartapost.com/business/2026/02/08/crackdown-on-mining-permits-faces-legal-scrutiny.html",
    "date": "2026-02-08T00:00:00",
    "date_parsed": "2026-02-08 00:00:00",
    "summary": "A potential lawsuit over halted mining operations could expose the state to fiscal risks reaching tens of trillions of rupiah, extending far beyond legal fees to include lost revenue and compensation claims.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.349705",
    "content": "potential lawsuit over halted mining operations could expose the state to fiscal risks amounting to tens of trillions of rupiah, extending far beyond legal fees to include lost revenue and compensation claims.\n\nJosua Pardede, chief economist at Permata Bank, stated that the costs from such disputes stem primarily from legal fees and, more significantly, the financial impact of the settlement or ruling.\n\nThe latter includes possible obligations to reinstate permits or pay compensation for halted operations.\n\n\"The decisive component is the outcome: compensation, lost revenue. The bill's size is based on the project's cash flow and economic value, not merely courtroom costs,\" Josua toldThe Jakarta Poston Tuesday.\n\nThe Martabe gold mine, operated by PT Agincourt Resources, recorded approximately US$558 million in sales and a net profit of $158 million in 2024. Its contributions to government revenue, including royalties, taxes and fees, totaled $113 million.\n\nAgincourt Resources is a subsidiary of publicly listed PT United Tractors, which itself is a subsidiary of diversified conglomerate PT Astra International.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\n\"At this scale, the state's fiscal risk includes not just legal costs, but also potential lost revenue from operational disruption and compensation claims,\" Josua said.",
    "author": "Divya Karyza",
    "category": "Regulations",
    "tags": [
      "Martabe",
      "Martabe-gold-mine"
    ]
  },
  {
    "title": "Danantara steps in as primary funder for new Krakatau Steel plant",
    "url": "https://www.thejakartapost.com/business/2026/02/08/danantara-steps-in-as-primary-funder-for-new-krakatau-steel-plant.html",
    "date": "2026-02-08T00:00:00",
    "date_parsed": "2026-02-08 00:00:00",
    "summary": "Danantara has stepped up to fill the funding gap for a new Krakatau Steel facility at KIEC, which previously attracted interest from Chinese investors.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.352956",
    "content": "ublicly listed state-owned steelmaker PT Krakatau Steel revealed that state asset fund Danantara was stepping in as the main investor for a new steel plant set to break ground in March this year, signaling a U-turn from a potential joint partnership with a Chinese investor.\n\nHernowo, Krakatau Steel’s commercial, business development and portfolio director, said the company was originally eyeing potential investment from China to shore up its weak financial capacity. However, Danantara’s entry meant the company no longer needed to seek other investors to serve as the project’s primary funder.\n\n“Now the considerations have changed. Danantara plans to come in. If Danantara enters [the project], there will be no need for other investors. Partnerships [with other countries] will still be allowed, but control remains in Indonesia,” he said on Thursday, as quoted byBisnis.com.\n\nThe country’s largest steel producer previously explored a partnership with China’s Delong Steel Group to build a steel plant, projected to have an annual capacity of 3 million tonnes, on a 500-hectare plot in the Krakatau Industrial Estate Cilegon (KIEC) in Banten.\n\nThe potential investment from Delong Steel Group, one of the world’s largest steelmakers, aimed at increasing production volume and providing technology transfers through the development of so-called green steel.\n\n“China was the top [priority investor] yesterday, now China must be put behind. Technological cooperation may come from China or Korea as it does today, but they won’t be the majority [investor],” Hernowo underlined.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nKrakatau Steel’s planned upstream iron and steel plant, he explained, was part of the government’s broader downstream mining agenda to process raw minerals such as iron ore and iron sand into higher-value products like carbon steel.",
    "author": "Ni Made Tasyarani",
    "category": "Companies",
    "tags": [
      "Krakatau-Steel",
      "Danantara",
      "downstreaming",
      "steel",
      "steel-production"
    ]
  },
  {
    "title": "EU tells TikTok to change 'addictive' design",
    "url": "https://www.thejakartapost.com/business/2026/02/08/eu-tells-tiktok-to-change-addictive-design.html",
    "date": "2026-02-08T00:00:00",
    "date_parsed": "2026-02-08 00:00:00",
    "summary": "The EU said Friday that TikTok needs to change its \"addictive design\" or risk heavy fines under the bloc's digital content rules, drawing a sharp pushback from the Chinese-owned platform.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.353330",
    "content": "he EU said Friday that TikTok needs to change its \"addictive design\" or risk heavy fines under the bloc's digital content rules, drawing a sharp pushback from the Chinese-owned platform.\n\nIn preliminary conclusions of a probe opened two years ago, the European Commission said it found TikTok was not taking effective steps to address the app's negative impacts, especially on minors and vulnerable adults.\n\n\"TikTok's addictive design is in breach of the Digital Services Act,\" said commission spokesperson Thomas Regnier, citing concerns with features such as infinite scroll, autoplay, push notifications, and a highly personalized recommender system.\n\n\"These features lead to the compulsive use of the app, especially for our kids, and this poses major risks to their mental health and wellbeing,\" Regnier said, adding: \"The measures that TikTok has in place are simply not enough.\"\n\nTikTok rejected the commission's findings, with a spokesperson saying it presented \"a categorically false and entirely meritless depiction of our platform\".\n\n\"We will take whatever steps are necessary to challenge these findings through every means available to us,\" they added in a statement.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nAllies of US President Donald Trump in the US Congress said the European Commission's \"punitive actions\" were a pretext for curbing political speech and pressuring companies.\n\nThe DSA is part of a bolstered legal armory adopted by the EU in recent years to curb Big Tech's excesses, and officials had until now said TikTok was cooperating with the bloc's digital regulators.\n\nTikTok will now have access to the EU's findings in order to defend itself against the claims.\n\nEU tech chief Henna Virkkunen told reporters that \"TikTok has to take actions, they have to change the design of their service in Europe to protect our minors and their wellbeing\".\n\nThe commission gave examples of what the platform could alter, such as:\n\n-- the platform's \"infinite scroll\" offering users an uninterrupted feed\n\n-- implementing effective \"screen time breaks\", including during the night\n\n-- adapting its recommender system, the algorithms used by platforms to feed users more personalized content.\n\n'Compulsive use' of TikTok\n\nThe February 2024 investigation was the first opened into TikTok under the DSA, the bloc's powerful content moderation law that has faced the wrath of the US administration under President Donald Trump.\n\nIn presenting the probe findings, Regnier cited what he called \"extremely alarming\" statistics on the app's use in the EU.\n\nTikTok was \"by far\" the most-used platform after midnight by children between 13 and 18, he said, with seven percent of children aged 12 to 15 spending four to five hours daily on it.\n\nBrussels accused TikTok of disregarding \"important indicators of compulsive use of the app\" such as the time minors spent on the platform at night.\n\nIt also said TikTok had not implemented effective measures to mitigate risks, taking particular aim at screen time management and parental control tools.\n\nIts time management tools were \"easy to dismiss\" including for young users, the commission found, while parental controls required \"additional time and skills from parents to introduce\" them.\n\n'Safe by design'\n\nThe findings come as several European countries move to curb access to social media for younger teenagers, with officials weighing whether it is time to follow suit at EU level.\n\nBriefing reporters Friday, Virkkunen said her priority was to make platforms safe for all users, children included.\n\n\"Social media should be so safe by design that we shouldn't have that kind of very high age restriction,\" she said.\n\nIf the regulator's views on TikTok are confirmed, the commission can impose a fine of up to 6 percent of the company's total worldwide annual turnover.\n\nThe EU began a separate probe into TikTok in December 2024 on alleged foreign interference during the Romanian presidential elections.\n\nEU spokesman Regnier said earlier this week that TikTok was \"extremely cooperative\" during that investigation and was taking measures to address the commission's concerns.\n\nHe added that while the probe remained open, regulators could monitor how TikTok behaves during other elections.",
    "author": "Raziye Akkoc",
    "category": "Companies",
    "tags": [
      "TikTok",
      "EU"
    ]
  },
  {
    "title": "Crypto firm accidentally sends $40 billion in bitcoin to users",
    "url": "https://www.thejakartapost.com/business/2026/02/07/crypto-firm-accidentally-sends-40-billion-in-bitcoin-to-users.html",
    "date": "2026-02-07T00:00:00",
    "date_parsed": "2026-02-07 00:00:00",
    "summary": "According to local reports, Bithumb was meant to send about 2,000 won (US$1.37) to each customer as part of a promotion, but mistakenly transferred roughly 2,000 bitcoins per user.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.353724",
    "content": "South Korean cryptocurrency exchange apologized on Saturday after mistakenly transferring more than US$40 billion worth of bitcoin to users, which briefly prompted a selloff on the platform.\n\nBithumb said it accidentally sent 620,000 bitcoins, currently worth more than $40 billion, and blocked trading and withdrawals for the 695 affected users within 35 minutes after the error occurred on Friday.\n\nAccording to local reports, Bithumb was meant to send about 2,000 won (US$1.37) to each customer as part of a promotion, but mistakenly transferred roughly 2,000 bitcoins per user.\n\n\"We sincerely apologize for the inconvenience caused to our customers due to the confusion that occurred during the distribution process of this [promotional] event,\" Bithumb said in a statement released Saturday.\n\nThe platform said it had recovered 99.7 percent of the mistakenly sent bitcoins, and that it would use its own assets to fully cover the amount that was lost in the incident.\n\nIt admitted the error briefly caused \"sharp volatility\" in bitcoin prices on the platform as some recipients sold the tokens, adding that it brought the situation under control within five minutes.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nIts charts showed the token's prices briefly went down 17 percent to 81.1 million won on the platform late Friday.\n\nThe platform stressed that the incident was \"unrelated to external hacking or security breaches\".\n\nBitcoin, the world's biggest cryptocurrency, sank this week, wiping out gains sparked by United States President Donald Trump's presidential election victory in November 2024.",
    "author": "AFP",
    "category": "Tech",
    "tags": [
      "Bitcoin",
      "cryptocurrency",
      "crypto-exchange",
      "South-Korea"
    ]
  },
  {
    "title": "Unemployment figure subsides despite growing layoffs",
    "url": "https://www.thejakartapost.com/business/2026/02/07/unemployment-figure-subsides-despite-growing-layoffs.html",
    "date": "2026-02-07T00:00:00",
    "date_parsed": "2026-02-07 00:00:00",
    "summary": "Data from the Manpower Ministry in January showed a 13 percent layoff increase in 2025 compared with the preceding year.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.354358",
    "content": "ecent employment data has pointed to an improvement last year as joblessness subsided in Indonesia, a trend that contradicts other data released by a different government institution and which shows growing layoffs.\n\nStatistics Indonesia (BPS) head Amalia Adininggar Widyasanti revealed in a press conference on Thursday that the number of unemployed Indonesians had dropped by more than 110,000 people from 7.46 million in August to 7.35 million in November last year.\n\n“The three business sectors that employed the most workers were the agriculture sector, trade and manufacturing industry,” said Amalia. The three sectors provided jobs for more than 60.5 percent of the country’s 147.9 million employed people.\n\nThe unemployment rate rested at 4.74 percent in November, down from 4.85 percent in August. The rate has been maintained well below 5 percent since February 2024 and has trended downward since the pandemic.\n\nThis improvement in employment went against the trend recorded in the layoff data released by the Manpower Ministry in January, which registered a 13 percent increase in layoffs in 2025 compared with the preceding year.\n\nThe layoff figures have been constantly climbing since 2022 and the Confederation of Indonesian Trade Unions (KSPI) has postulated that last year’s real layoff figure was higher than reported.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nAs opposed to the official figure of 88,519 people axed last year, the KSPI claimed that the real figure might amount to 100,000 workers as indicated in increasing claims on the pension program (JHT) under the Workers Social Security Agency (BPJS Ketenagakerjaan).",
    "author": "Deni Ghifari",
    "category": "Economy",
    "tags": [
      "BPS",
      "unemployment",
      "jobless-claim",
      "employment",
      "Statistics-Indonesia",
      "layoffs",
      "KSPI",
      "labor-union",
      "labor",
      "workforce",
      "said-iqbal"
    ]
  },
  {
    "title": "Economic fundamentals solid, govt insists, after Moody’s lowered outlook",
    "url": "https://www.thejakartapost.com/business/2026/02/06/economic-fundamentals-solid-govt-insists-after-moodys-lowered-outlook.html",
    "date": "2026-02-06T00:00:00",
    "date_parsed": "2026-02-06 00:00:00",
    "summary": "Economists interpret the rating agency’s latest assessment as a serious corrective signal, noting that a downgrade in Indonesia’s credit rating could sharply raise borrowing costs and pile pressure on the rupiah.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.354848",
    "content": "he government has sought to reassure markets after Moody’s Investors Service downgraded Indonesia’s credit rating outlook from “stable” to “negative”, noting that the country’s economic fundamentals remain strong despite growing concerns over governance risks.\n\n“Over the past year, reduced predictability and coherence in the policy making process, alongside less effective policy communication, have raised risks to Indonesia's policy credibility among investors, as reflected in increased equity and foreign-exchange market volatility,” the credit rating agency said in its latest assessment, released on Thursday.\n\nThe press release from Moody’s also notes “weaker policy cohesion and credibility,” which, if sustained, “could point to institutional strength lower than currently assessed, and undermine economic and fiscal strength through reduced investment attractiveness and higher borrowing costs.”\n\nMoody’s affirmed Indonesia’s long-term issuer ratings at Baa2, reflecting its expectation of “continued resilience in economic strength” and a monetary policy seen “to continue supporting price stability”.\n\nYet, the downward revision in the outlook triggered a negative market reaction, with the Indonesia Stock Exchange (IDX) Composite index opening at 7,945 points and sliding 2.08 percent to close at 7,935 on Friday.\n\nMoody’s noted “emerging weaknesses in policy planning and communication, with implications for policy credibility” and elaborated on policy uncertainty, specifically around state asset fund Danantara.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nFurthermore, it warned of “risks to domestic political stability” from “rising public dissatisfaction” over income and employment prospects.",
    "author": "Maudey Khalisha",
    "category": "Economy",
    "tags": [
      "moodys",
      "policy-making",
      "Prabowo",
      "Airlangga-Hartarto",
      "bank-indonesia",
      "perry-warjiyo",
      "outlook"
    ]
  },
  {
    "title": "Ex-BI deputy replaces Tommy as deputy finance minister",
    "url": "https://www.thejakartapost.com/business/2026/02/06/ex-bi-deputy-replaces-tommy-as-deputy-finance-minister.html",
    "date": "2026-02-06T00:00:00",
    "date_parsed": "2026-02-06 00:00:00",
    "summary": "In what appears to be a coordinated role swap, the President has appointed a former BI deputy governor to fill the deputy finance minister post left vacant by his nephew Tommy Djiwandono, who is set to take up his new job as BI deputy governor.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.356734",
    "content": "ormer Bank Indonesia (BI) deputy governor Juda Agung was installed as deputy finance minister on Thursday to replace Thomas “Tommy” Djiwandono, a nephew of PresidentPrabowo Subianto, who is set to begin his new post as a deputy governor at the central bank.\n\nJuda served in his previous role at BI from 2022 for a term that was originally set to run until next year. However, he resigned from his post with immediate effect on Jan. 13, just a week before the President nominated Tommy as the next BI deputy governor on Jan. 19.\n\n“The reason for my resignation [as BI deputy governor] is clearly because I have been tasked to serve as deputy finance minister. I certainly cannot hold the role of BI deputy governor simultaneously. These are two different authorities,” Juda said on Feb. 5, after his inauguration at the State Palace in Central Jakarta.\n\nHe also said the President had emphasized the importance of policy coordination between the Finance Ministry and the central bank, including “policies in the real sector”, as part of “effective” efforts “to drive economic growth in the future”.\n\nJuda said he believed the role swap could strengthen synergy between the fiscal and monetary authorities as well as improve economic policymaking.\n\n“My extensive experience at Bank Indonesia, and subsequently at the fiscal authority, will certainly create better synergy as willPak[Mr.] Thomas, who formerly served at the fiscal authority before moving to the monetary authority,” he added.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nRead also:Thomas Djiwandono secures BI deputy governor post",
    "author": "Ni Made Tasyarani",
    "category": "Economy",
    "tags": [
      "finance-ministry",
      "bank-indonesia",
      "central-bank",
      "fiscal-policy",
      "monetary-policy"
    ]
  },
  {
    "title": "Indonesian markets slide again after Moody's cuts outlook",
    "url": "https://www.thejakartapost.com/business/2026/02/06/indonesian-markets-slide-again-after-moodys-cuts-outlook.html",
    "date": "2026-02-06T00:00:00",
    "date_parsed": "2026-02-06 00:00:00",
    "summary": "The benchmark Jakarta Composite Index lost 2.5 percent while the rupiah dropped as much as 0.37 percent to 16,888 per dollar, its lowest since January 22 and down 1 percent for the year.",
    "is_existing": false,
    "scraped_at": "2026-02-18T08:57:37.357157",
    "content": "ndonesia's stocks and currency skidded on Friday after Moody's lowered the country's credit rating outlook, the latest jolt for Southeast Asia's largest economy, wiping about $120 billion off its equity market in a turbulent start to the year.\n\nInternational investors have reacted nervously to PresidentPrabowo Subianto's attempt to ramp up growth to 8 percent, as concerns over fiscal health and central bank independence cool sentiment on Indonesia.\n\nThe benchmark Jakarta Composite Index lost 2.5 percent while the rupiah dropped as much as 0.37 percent to 16,888 per dollar, its lowest since January 22 and down 1 percent for the year.\n\nStocks have fallen 5 percent for the week so far, after last week's decline of 6.9 percent.\n\nMoody's move to cut the outlook to negative from stable for the $1.4-trillion G20 economy, citing reduced predictability in policymaking, came a week after MSCI flagged transparency issues that triggered the market rout.\n\nThe agency also cited concerns about policy effectiveness and signs of weakening governance, which could erode Indonesia's long-established policy credibility if they persist.\n\nWith exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape.\n\nBy registering, you agree withThe Jakarta Post'sPrivacy Policy\n\nPlease check your email for your newsletter subscription.\n\nMoody's on Friday also cut its outlook for five of the country's biggest banks and seven companies, including its biggest telecoms firm Telkom Indonesia, its cellular provider unit Telkomsel, instant-noodle maker Indofood CBP Sukses Makmur and heavy equipment and mining company United Tractors, due to their sensitivity to a potential decline in the sovereign rating.\n\nThe outlook reduction also affected energy firm Pertamina, its upstream unit and miner MIND ID. Telkom, Pertamina, MIND ID and the four banks are state-owned.\n\nFinance Minister Purbaya Yudhi Sadewa brushed off the concerns on Friday, saying Indonesian economic fundamentals were strong, with economic growth accelerating and the fiscal deficit, though swelling, under control.\n\n\"There's no strong reason to downgrade,\" Purbaya told reporters, adding that fiscal policy was on track to boost growth.\n\n\"On the flip side, we should slowly see prospects for an upgrade. Maybe by year-end, when our economic growth is 6 percent or more.\"\n\n[RA::2025 GDP growth misses target;;/business/2026/02/05/2025-gdp-growth-misses-target.html?utm_source=(direct)&utm_medium=home_headlines]\n\nPrabowo's year-old sovereign wealth fund Danantara Indonesia, his main vehicle to push growth, said Moody's outlook cut \"a constructive reminder to strengthen our institutional foundations\".\n\nMoody's said that without sufficient policy coordination and cohesiveness, Danantara's establishment raised risks to policy credibility and potential contingent liability for the government.\n\nIn a statement, Danantara chief Rosan Roeslani said the fund was still in an institution-building phase and would follow global best practices.\n\n\"The Moody's outlook downgrade is a warning shot, which could trigger other ratings agencies to follow suit, particularly if the nature of policymaking remains subject to a heightened degree of uncertainty,\" OCBC economists said.\n\nAuthorities' responses to avert a rating downgrade would be watched closely over the next year or more, they added in a note.\n\nIndonesia's dollar bonds stayed under pressure, though they recouped some small losses from Thursday. The yield on 10-year benchmark bonds was little changed at 6.317 percent, LSEG data showed.\n\nThe country's five-year credit default swap spread, or the cost of insuring against a default, climbed to a 15-month high.\n\n\"The main potential impact on Indonesian markets is a higher risk premium across asset classes,\" said Rully Arya Wisnubroto, a market analyst at Mirae Asset Sekuritas Indonesia.\n\nThis would put pressure on long-term government bonds, state companies' and major banks' stocks, as well as sentiment toward the rupiah and capital flows, he added.\n\nMoody's Baa2 rating for Indonesia puts the sovereign at the second-lowest tier of investment grade.\n\nThe two other major agencies, S&P Global Ratings and Fitch Ratings, currently rate Indonesia similarly, both with a \"stable\" outlook. They have yet to issue reviews this year.\n\n\"Recent volatility in Indonesian stock prices have not materially affected our views on the sovereign ratings,\" Rain Yin, a sovereign analyst at S&P, told Reuters in an emailed response.\n\nYin, however, cautioned that fiscal deterioration could exert more downward pressure on S&P's rating in the absence of offsetting improvements.\n\nRead also:Manufacturing PMI climbs on rising domestic demand\n\nFitch did not immediately respond to a request for comment.\n\nOfficial's vows for changes and the resignations of five top officials of the financial regulator and stock exchange have failed to stabilize the market.\n\nForeigners have already dumped about $860 million worth of shares in net terms since last Wednesday, exchange data showed, versus $1 billion in sales for the whole of 2025.",
    "author": "Ankur Banerjee and Stanley Widianto",
    "category": "Markets",
    "tags": [
      "IDX",
      "Indonesia-Stock-Exchange",
      "IDX-Composite",
      "JCI",
      "JKSE"
    ]
  }
]