[
  {
    "title": "",
    "url": "https://www.thejakartapost.com/business/2026/02/15/businesses-seek-ai-regulatory-clarity-as-caution-hampers-investment.html",
    "published_date": "",
    "summary": "Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Some technology firms deliberately avoid using personally identifiable information in their AI models to reduce compliance risks, despite the limitations this places on their ability to improve operational efficiency. Published on 2026-02-13T18:41:12+07:00 http://www.thejakartapost.com/business/2026/02/15/businesses-seek-ai-regulatory-clarity-as-caution-hampers-investment.html A message reading “AI artificial intelligence“, a keyboard and robot hands are seen in this illustration taken on Jan. 27, 2025. (Reuters/Dado Ruvic) echnology firms have warned that regulatory uncertainty in Indonesia is hampering their investment decisions, particularly for those developing artificial intelligence-based products and data-driven platforms, pushing them to be more cautious in pursuing innovation and allocating capital. Rushil Mohan, the founder of logistics technology start-up Pidge, said the lack of clear guidelines forced companies to be more cautious, especially in handling personal data and building predictive models, as the firm explores expansion in Indonesia. “When you don’t have clarity, you have to choose to be safe, and safety can often be at odds with innovation,” he said to on Feb. 5. “If there were clearer guardrails and guidelines, what kind of regulation, what kind of models and what kind of outcomes are allowed, supported and encouraged, it would allow us to double down, triple down on our investments into AI.” Pidge deliberately avoids using personally identifiable information in its AI models, relying instead on aggregated and anonymized data. While this reduces compliance risks, Mohan said it limits the company’s ability to generate hyper-personalized recommendations that could significantly improve operational efficiency. With exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape. By registering, you agree with for signing up our newsletter! Please check your email for your newsletter subscription. “The biggest fear that any company has is that you invest so much in a line of business, in a product, and by the time it reaches the market, governments put a shutdown on it, or regulation puts a shutdown on it,” he said. Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund Job threats, rogue bots: five hot issues in AI China’s ByteDance releases Doubao 2.0 AI model for 'agent era' Job threats, rogue bots: five hot issues in AI China’s ByteDance releases Doubao 2.0 AI model for 'agent era' When education becomes conditional, the impact is suicidal Illegal tobacco excise plan casts haze over market fairness, policy certainty Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund Trump says Japan to invest in energy, industrial projects in Ohio, Texas and Georgia Govt urged not to compromise too much for US trade deal Unlocking regional potential to boost economic growth Indonesia ramps up UN talks ahead of Board of Peace meeting Govt urged not to compromise too much for US trade deal Indonesia, BRICS and the rise of the Global South Indonesia, BRICS and the rise of the Global South Indonesia, BRICS and the rise of the Global South Trump says Japan to invest in energy, industrial projects in Ohio, Texas and Georgia From the US-led rules-based order to multipolar international law Balancing the blaze at home: Blue in the year of fire horse Bima police chief, subordinates arrested for drug trafficking Those who most need to understand AI don't get it Get the latest news in your inbox",
    "category": "company",
    "author": "",
    "content": "Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Some technology firms deliberately avoid using personally identifiable information in their AI models to reduce compliance risks, despite the limitations this places on their ability to improve operational efficiency. Published on 2026-02-13T18:41:12+07:00 http://www.thejakartapost.com/business/2026/02/15/businesses-seek-ai-regulatory-clarity-as-caution-hampers-investment.html A message reading “AI artificial intelligence“, a keyboard and robot hands are seen in this illustration taken on Jan. 27, 2025. (Reuters/Dado Ruvic) echnology firms have warned that regulatory uncertainty in Indonesia is hampering their investment decisions, particularly for those developing artificial intelligence-based products and data-driven platforms, pushing them to be more cautious in pursuing innovation and allocating capital. Rushil Mohan, the founder of logistics technology start-up Pidge, said the lack of clear guidelines forced companies to be more cautious, especially in handling personal data and building predictive models, as the firm explores expansion in Indonesia. “When you don’t have clarity, you have to choose to be safe, and safety can often be at odds with innovation,” he said to on Feb. 5. “If there were clearer guardrails and guidelines, what kind of regulation, what kind of models and what kind of outcomes are allowed, supported and encouraged, it would allow us to double down, triple down on our investments into AI.” Pidge deliberately avoids using personally identifiable information in its AI models, relying instead on aggregated and anonymized data. While this reduces compliance risks, Mohan said it limits the company’s ability to generate hyper-personalized recommendations that could significantly improve operational efficiency. With exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape. By registering, you agree with for signing up our newsletter! Please check your email for your newsletter subscription. “The biggest fear that any company has is that you invest so much in a line of business, in a product, and by the time it reaches the market, governments put a shutdown on it, or regulation puts a shutdown on it,” he said. Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund Job threats, rogue bots: five hot issues in AI China’s ByteDance releases Doubao 2.0 AI model for 'agent era' Job threats, rogue bots: five hot issues in AI China’s ByteDance releases Doubao 2.0 AI model for 'agent era' When education becomes conditional, the impact is suicidal Illegal tobacco excise plan casts haze over market fairness, policy certainty Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund Trump says Japan to invest in energy, industrial projects in Ohio, Texas and Georgia Govt urged not to compromise too much for US trade deal Unlocking regional potential to boost economic growth Indonesia ramps up UN talks ahead of Board of Peace meeting Govt urged not to compromise too much for US trade deal Indonesia, BRICS and the rise of the Global South Indonesia, BRICS and the rise of the Global South Indonesia, BRICS and the rise of the Global South Trump says Japan to invest in energy, industrial projects in Ohio, Texas and Georgia From the US-led rules-based order to multipolar international law Balancing the blaze at home: Blue in the year of fire horse Bima police chief, subordinates arrested for drug trafficking Those who most need to understand AI don't get it Get the latest news in your inbox",
    "negative_score": 12,
    "sentiment_score": 0.7786,
    "is_negative": true,
    "source": "jakartapost_business",
    "processed_at": "2026-02-18T04:15:18.234258"
  },
  {
    "title": "",
    "url": "http://www.thejakartapost.com/business/economy",
    "published_date": "",
    "summary": "Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Japanese Prime Minister Sanae Takaichi reacts as U.S. President Donald Trump speaks, aboard the aircraft carrier USS George Washington, during a visit to US Navy's Yokosuka base in Yokosuka, Japan, on Oct. 28, 2025. Trump says Japan to invest in energy, industrial projects in Ohio, Texas and Georgia United States President Donald Trump's administration on Tuesday announced three projects valued at US$36 billion to be financed by Japan, including an oil export facility in Texas, an industrial diamonds plant in Georgia and a natural gas power plant in Ohio. Get the latest news in your inbox Govt urged not to compromise too much for US trade deal The government has issued a loosely-worded statement days ahead of the expected signing of a tariff agreement with the United States, following a weekend meeting at President Prabowo Subianto’s Hambalang estate in Bogor, West Java. ... Unlocking regional potential to boost economic growth As an archipelagic country, Indonesia is endowed with diverse economic potential across regions, reflected in regional economic structures and export profiles. ... Japan's economy limps back to scant growth in Q4, raises test for Takaichi Japan's economy limped back to meager growth in the fourth quarter, significantly missing market expectations in a key test for Prime Minister Sanae Takaichi's government as cost-of-living pressures drag on confidence and domestic demand. Lunar New Year drives corporate decor boom, but retail demand falters Sellers of nian gao or kue keranjang in Glodok’s Chinatown area as well as parts of West and Central Java reporting softer sales compared to previous years. 'Be realistic' says Prabowo, while defending key programs President Prabowo Subianto has emphasized the need to be realistic in a speech on the Indonesian economy, where he promoted key initiatives of his administration to drive gross domestic product growth. Cumulative sales in high-rise condos stood at just 56 percent last year in a continuation of a decade-long downward trend, while new launches remained subdued in a lackluster market. EU leaders vow to accelerate single market, in struggle to compete with US, China European Union leaders agreed on Thursday on a wide-ranging set of commitments to improve how the bloc's border-free internal market works so Europe's businesses can be competitive and survive aggressive economic rivalry from the US and China. Indonesia ready to bridge trade, investment in Islamic world Prabowo leans on businesses to create jobs President Prabowo Subianto held meetings with Indonesian business leaders at his private Hambalang estate, during which he stated his commitment to improving the ease of doing business. New deputy finance minister guns for 5.6% first-quarter GDP growth Just under a week since he was sworn in last Thursday, the ex-Bank Indonesia deputy governor is setting his sights accelerated state spending this quarter to reach up to 5.6 percent growth from an initial 5.5 percent target. Pertamina denies Russian crude imports as EU mulls sanctions The European Union has proposed unprecedented sanctions against Indonesia’s Karimun Port for handling Russian oil. Retail sales post strong annual gain as consumer confidence holds up The retail sales index dipped slightly in January when compared with the holiday month of December but is up a strong 7 percent year-on-year. Indonesia’s growth: Resilient but uneven Although formal job creation has improved, job quality, reflected in income stability, benefits and productivity, remains unequal. Fiscal discipline remains intact, govt insists, after Moody’s outlook cut State Secretary Prasetyo Hadi said on Monday that the government continued to adhere to fiscal rules and had not breached statutory deficit limits, stressing that budget management remained on a prudent footing. Bulog proposes Mecca warehouse to stock haj rice exports Bulog’s planned warehouse in the Haj Village will also be used to store other food commodities from Indonesia, such as meat and fish, to meet the consumption needs of the haj pilgrims. Poverty at record low as govt seeks to redefine threshold The poverty rate rests at a historic low of 8.25 percent of the total population, continuing its declining trend from September 2022. Thomas Djiwandono sworn in as BI deputy governor The former deputy finance minister, who also President Prabowo Subianto's nephew, replaced Juda Agung, who resigned as BI deputy governor on Jan. 13 and was inaugurated as deputy finance minister on Thursday. Japan's Takaichi may struggle to soothe voters and markets Japanese stocks soared to record highs Monday after Prime Minister Sanae Takaichi's election triumph, but experts warned that the country's first woman leader could struggle to keep both voters and markets happy. Unemployment figure subsides despite growing layoffs Data from the Manpower Ministry in January showed a 13 percent layoff increase in 2025 compared with the preceding year. Economic fundamentals solid, govt insists, after Moody’s lowered outlook Economists interpret the rating agency’s latest assessment as a serious corrective signal, noting that a downgrade in Indonesia’s credit rating could sharply raise borrowing costs and pile pressure on the rupiah. Ex-BI deputy replaces Tommy as deputy finance minister In what appears to be a coordinated role swap, the President has appointed a former BI deputy governor to fill the deputy finance minister post left vacant by his nephew Tommy Djiwandono, who is set to take up his new job as BI deputy governor. Govt waives airfare VAT for Idul Fitri The government has announced a temporary waiver on value-added tax (VAT) for airline tickets for the upcoming Idul Fitri holiday period, when travel demand spikes across the country. Indonesian markets face more pressure after Moody's cuts outlook Indonesian stocks and currency traded weaker in early trade on Friday after Moody's lowered the country's credit rating outlook, the latest jolt in a turbulent start to the year for Southeast Asia's largest economy. Economic growth improved slightly last year but failed to meet the government’s target set out in the state budget. Indonesian economic growth tops 5% on consumption boost The figures come days after the country's stock market suffered its worst crash in decades after index compiler MSCI threatened a downgrade over the transparency of the free-float stocks. Purbaya calls out Citi economist over deficit projection The finance minister stated that the 2025 deficit was deliberately pushed close to the 3 percent limit to ensure that the economic downturn did not spiral into a recession. Weather woes, demand strain may keep inflation above target Statistics Indonesia (BPS) reported that annual inflation reached 3.55 percent year-on-year (yoy) in January, citing a low base effect after the figure fell below its normal trend in January last year because of electricity tariff discounts. WTO must 'reform or die': talks facilitator Successfully reforming the WTO is a matter of life and death for the organization, warns the facilitator of talks on revamping the global trade body. Indonesia imports Russian oil in December and January, data shows The imports, tracked by Kpler and Vortexa, came as the prospect of declining demand from India, one of the main buyers of Russian crude, has depressed prices of the western-sanctioned oil, sales of which are vital in helping fund the war in Ukraine. Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Legacy, landscapes and lives: The tales of Nusantara Black and White of RI Fiesta of Democracy Silent, invisible danger on Cirebon coast Some 5.7 tonnes of shrimp contaminated with Cesium 137 disposed InterContinental Bali Resort introduces restorative Silent Retreat BPJS Kesehatan ends 2024 with prestigious international awards Love unveiled at Adriana Cocina & Bar: A new Mexican rooftop experience in Bali Get the latest news in your inbox",
    "category": "company",
    "author": "",
    "content": "Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Japanese Prime Minister Sanae Takaichi reacts as U.S. President Donald Trump speaks, aboard the aircraft carrier USS George Washington, during a visit to US Navy's Yokosuka base in Yokosuka, Japan, on Oct. 28, 2025. Trump says Japan to invest in energy, industrial projects in Ohio, Texas and Georgia United States President Donald Trump's administration on Tuesday announced three projects valued at US$36 billion to be financed by Japan, including an oil export facility in Texas, an industrial diamonds plant in Georgia and a natural gas power plant in Ohio. Get the latest news in your inbox Govt urged not to compromise too much for US trade deal The government has issued a loosely-worded statement days ahead of the expected signing of a tariff agreement with the United States, following a weekend meeting at President Prabowo Subianto’s Hambalang estate in Bogor, West Java. ... Unlocking regional potential to boost economic growth As an archipelagic country, Indonesia is endowed with diverse economic potential across regions, reflected in regional economic structures and export profiles. ... Japan's economy limps back to scant growth in Q4, raises test for Takaichi Japan's economy limped back to meager growth in the fourth quarter, significantly missing market expectations in a key test for Prime Minister Sanae Takaichi's government as cost-of-living pressures drag on confidence and domestic demand. Lunar New Year drives corporate decor boom, but retail demand falters Sellers of nian gao or kue keranjang in Glodok’s Chinatown area as well as parts of West and Central Java reporting softer sales compared to previous years. 'Be realistic' says Prabowo, while defending key programs President Prabowo Subianto has emphasized the need to be realistic in a speech on the Indonesian economy, where he promoted key initiatives of his administration to drive gross domestic product growth. Cumulative sales in high-rise condos stood at just 56 percent last year in a continuation of a decade-long downward trend, while new launches remained subdued in a lackluster market. EU leaders vow to accelerate single market, in struggle to compete with US, China European Union leaders agreed on Thursday on a wide-ranging set of commitments to improve how the bloc's border-free internal market works so Europe's businesses can be competitive and survive aggressive economic rivalry from the US and China. Indonesia ready to bridge trade, investment in Islamic world Prabowo leans on businesses to create jobs President Prabowo Subianto held meetings with Indonesian business leaders at his private Hambalang estate, during which he stated his commitment to improving the ease of doing business. New deputy finance minister guns for 5.6% first-quarter GDP growth Just under a week since he was sworn in last Thursday, the ex-Bank Indonesia deputy governor is setting his sights accelerated state spending this quarter to reach up to 5.6 percent growth from an initial 5.5 percent target. Pertamina denies Russian crude imports as EU mulls sanctions The European Union has proposed unprecedented sanctions against Indonesia’s Karimun Port for handling Russian oil. Retail sales post strong annual gain as consumer confidence holds up The retail sales index dipped slightly in January when compared with the holiday month of December but is up a strong 7 percent year-on-year. Indonesia’s growth: Resilient but uneven Although formal job creation has improved, job quality, reflected in income stability, benefits and productivity, remains unequal. Fiscal discipline remains intact, govt insists, after Moody’s outlook cut State Secretary Prasetyo Hadi said on Monday that the government continued to adhere to fiscal rules and had not breached statutory deficit limits, stressing that budget management remained on a prudent footing. Bulog proposes Mecca warehouse to stock haj rice exports Bulog’s planned warehouse in the Haj Village will also be used to store other food commodities from Indonesia, such as meat and fish, to meet the consumption needs of the haj pilgrims. Poverty at record low as govt seeks to redefine threshold The poverty rate rests at a historic low of 8.25 percent of the total population, continuing its declining trend from September 2022. Thomas Djiwandono sworn in as BI deputy governor The former deputy finance minister, who also President Prabowo Subianto's nephew, replaced Juda Agung, who resigned as BI deputy governor on Jan. 13 and was inaugurated as deputy finance minister on Thursday. Japan's Takaichi may struggle to soothe voters and markets Japanese stocks soared to record highs Monday after Prime Minister Sanae Takaichi's election triumph, but experts warned that the country's first woman leader could struggle to keep both voters and markets happy. Unemployment figure subsides despite growing layoffs Data from the Manpower Ministry in January showed a 13 percent layoff increase in 2025 compared with the preceding year. Economic fundamentals solid, govt insists, after Moody’s lowered outlook Economists interpret the rating agency’s latest assessment as a serious corrective signal, noting that a downgrade in Indonesia’s credit rating could sharply raise borrowing costs and pile pressure on the rupiah. Ex-BI deputy replaces Tommy as deputy finance minister In what appears to be a coordinated role swap, the President has appointed a former BI deputy governor to fill the deputy finance minister post left vacant by his nephew Tommy Djiwandono, who is set to take up his new job as BI deputy governor. Govt waives airfare VAT for Idul Fitri The government has announced a temporary waiver on value-added tax (VAT) for airline tickets for the upcoming Idul Fitri holiday period, when travel demand spikes across the country. Indonesian markets face more pressure after Moody's cuts outlook Indonesian stocks and currency traded weaker in early trade on Friday after Moody's lowered the country's credit rating outlook, the latest jolt in a turbulent start to the year for Southeast Asia's largest economy. Economic growth improved slightly last year but failed to meet the government’s target set out in the state budget. Indonesian economic growth tops 5% on consumption boost The figures come days after the country's stock market suffered its worst crash in decades after index compiler MSCI threatened a downgrade over the transparency of the free-float stocks. Purbaya calls out Citi economist over deficit projection The finance minister stated that the 2025 deficit was deliberately pushed close to the 3 percent limit to ensure that the economic downturn did not spiral into a recession. Weather woes, demand strain may keep inflation above target Statistics Indonesia (BPS) reported that annual inflation reached 3.55 percent year-on-year (yoy) in January, citing a low base effect after the figure fell below its normal trend in January last year because of electricity tariff discounts. WTO must 'reform or die': talks facilitator Successfully reforming the WTO is a matter of life and death for the organization, warns the facilitator of talks on revamping the global trade body. Indonesia imports Russian oil in December and January, data shows The imports, tracked by Kpler and Vortexa, came as the prospect of declining demand from India, one of the main buyers of Russian crude, has depressed prices of the western-sanctioned oil, sales of which are vital in helping fund the war in Ukraine. Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Legacy, landscapes and lives: The tales of Nusantara Black and White of RI Fiesta of Democracy Silent, invisible danger on Cirebon coast Some 5.7 tonnes of shrimp contaminated with Cesium 137 disposed InterContinental Bali Resort introduces restorative Silent Retreat BPJS Kesehatan ends 2024 with prestigious international awards Love unveiled at Adriana Cocina & Bar: A new Mexican rooftop experience in Bali Get the latest news in your inbox",
    "negative_score": 39,
    "sentiment_score": 0.9898,
    "is_negative": true,
    "source": "jakartapost_business",
    "processed_at": "2026-02-18T04:15:18.293292"
  },
  {
    "title": "",
    "url": "http://www.thejakartapost.com/index.php/business/economy",
    "published_date": "",
    "summary": "Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Japanese Prime Minister Sanae Takaichi reacts as U.S. President Donald Trump speaks, aboard the aircraft carrier USS George Washington, during a visit to US Navy's Yokosuka base in Yokosuka, Japan, on Oct. 28, 2025. Trump says Japan to invest in energy, industrial projects in Ohio, Texas and Georgia United States President Donald Trump's administration on Tuesday announced three projects valued at US$36 billion to be financed by Japan, including an oil export facility in Texas, an industrial diamonds plant in Georgia and a natural gas power plant in Ohio. Get the latest news in your inbox Govt urged not to compromise too much for US trade deal The government has issued a loosely-worded statement days ahead of the expected signing of a tariff agreement with the United States, following a weekend meeting at President Prabowo Subianto’s Hambalang estate in Bogor, West Java. ... Unlocking regional potential to boost economic growth As an archipelagic country, Indonesia is endowed with diverse economic potential across regions, reflected in regional economic structures and export profiles. ... Japan's economy limps back to scant growth in Q4, raises test for Takaichi Japan's economy limped back to meager growth in the fourth quarter, significantly missing market expectations in a key test for Prime Minister Sanae Takaichi's government as cost-of-living pressures drag on confidence and domestic demand. Lunar New Year drives corporate decor boom, but retail demand falters Sellers of nian gao or kue keranjang in Glodok’s Chinatown area as well as parts of West and Central Java reporting softer sales compared to previous years. 'Be realistic' says Prabowo, while defending key programs President Prabowo Subianto has emphasized the need to be realistic in a speech on the Indonesian economy, where he promoted key initiatives of his administration to drive gross domestic product growth. Cumulative sales in high-rise condos stood at just 56 percent last year in a continuation of a decade-long downward trend, while new launches remained subdued in a lackluster market. EU leaders vow to accelerate single market, in struggle to compete with US, China European Union leaders agreed on Thursday on a wide-ranging set of commitments to improve how the bloc's border-free internal market works so Europe's businesses can be competitive and survive aggressive economic rivalry from the US and China. Indonesia ready to bridge trade, investment in Islamic world Prabowo leans on businesses to create jobs President Prabowo Subianto held meetings with Indonesian business leaders at his private Hambalang estate, during which he stated his commitment to improving the ease of doing business. New deputy finance minister guns for 5.6% first-quarter GDP growth Just under a week since he was sworn in last Thursday, the ex-Bank Indonesia deputy governor is setting his sights accelerated state spending this quarter to reach up to 5.6 percent growth from an initial 5.5 percent target. Pertamina denies Russian crude imports as EU mulls sanctions The European Union has proposed unprecedented sanctions against Indonesia’s Karimun Port for handling Russian oil. Retail sales post strong annual gain as consumer confidence holds up The retail sales index dipped slightly in January when compared with the holiday month of December but is up a strong 7 percent year-on-year. Indonesia’s growth: Resilient but uneven Although formal job creation has improved, job quality, reflected in income stability, benefits and productivity, remains unequal. Fiscal discipline remains intact, govt insists, after Moody’s outlook cut State Secretary Prasetyo Hadi said on Monday that the government continued to adhere to fiscal rules and had not breached statutory deficit limits, stressing that budget management remained on a prudent footing. Bulog proposes Mecca warehouse to stock haj rice exports Bulog’s planned warehouse in the Haj Village will also be used to store other food commodities from Indonesia, such as meat and fish, to meet the consumption needs of the haj pilgrims. Poverty at record low as govt seeks to redefine threshold The poverty rate rests at a historic low of 8.25 percent of the total population, continuing its declining trend from September 2022. Thomas Djiwandono sworn in as BI deputy governor The former deputy finance minister, who also President Prabowo Subianto's nephew, replaced Juda Agung, who resigned as BI deputy governor on Jan. 13 and was inaugurated as deputy finance minister on Thursday. Japan's Takaichi may struggle to soothe voters and markets Japanese stocks soared to record highs Monday after Prime Minister Sanae Takaichi's election triumph, but experts warned that the country's first woman leader could struggle to keep both voters and markets happy. Unemployment figure subsides despite growing layoffs Data from the Manpower Ministry in January showed a 13 percent layoff increase in 2025 compared with the preceding year. Economic fundamentals solid, govt insists, after Moody’s lowered outlook Economists interpret the rating agency’s latest assessment as a serious corrective signal, noting that a downgrade in Indonesia’s credit rating could sharply raise borrowing costs and pile pressure on the rupiah. Ex-BI deputy replaces Tommy as deputy finance minister In what appears to be a coordinated role swap, the President has appointed a former BI deputy governor to fill the deputy finance minister post left vacant by his nephew Tommy Djiwandono, who is set to take up his new job as BI deputy governor. Govt waives airfare VAT for Idul Fitri The government has announced a temporary waiver on value-added tax (VAT) for airline tickets for the upcoming Idul Fitri holiday period, when travel demand spikes across the country. Indonesian markets face more pressure after Moody's cuts outlook Indonesian stocks and currency traded weaker in early trade on Friday after Moody's lowered the country's credit rating outlook, the latest jolt in a turbulent start to the year for Southeast Asia's largest economy. Economic growth improved slightly last year but failed to meet the government’s target set out in the state budget. Indonesian economic growth tops 5% on consumption boost The figures come days after the country's stock market suffered its worst crash in decades after index compiler MSCI threatened a downgrade over the transparency of the free-float stocks. Purbaya calls out Citi economist over deficit projection The finance minister stated that the 2025 deficit was deliberately pushed close to the 3 percent limit to ensure that the economic downturn did not spiral into a recession. Weather woes, demand strain may keep inflation above target Statistics Indonesia (BPS) reported that annual inflation reached 3.55 percent year-on-year (yoy) in January, citing a low base effect after the figure fell below its normal trend in January last year because of electricity tariff discounts. WTO must 'reform or die': talks facilitator Successfully reforming the WTO is a matter of life and death for the organization, warns the facilitator of talks on revamping the global trade body. Indonesia imports Russian oil in December and January, data shows The imports, tracked by Kpler and Vortexa, came as the prospect of declining demand from India, one of the main buyers of Russian crude, has depressed prices of the western-sanctioned oil, sales of which are vital in helping fund the war in Ukraine. Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Legacy, landscapes and lives: The tales of Nusantara Black and White of RI Fiesta of Democracy Silent, invisible danger on Cirebon coast Some 5.7 tonnes of shrimp contaminated with Cesium 137 disposed InterContinental Bali Resort introduces restorative Silent Retreat BPJS Kesehatan ends 2024 with prestigious international awards Love unveiled at Adriana Cocina & Bar: A new Mexican rooftop experience in Bali Get the latest news in your inbox",
    "category": "market",
    "author": "",
    "content": "Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Japanese Prime Minister Sanae Takaichi reacts as U.S. President Donald Trump speaks, aboard the aircraft carrier USS George Washington, during a visit to US Navy's Yokosuka base in Yokosuka, Japan, on Oct. 28, 2025. Trump says Japan to invest in energy, industrial projects in Ohio, Texas and Georgia United States President Donald Trump's administration on Tuesday announced three projects valued at US$36 billion to be financed by Japan, including an oil export facility in Texas, an industrial diamonds plant in Georgia and a natural gas power plant in Ohio. Get the latest news in your inbox Govt urged not to compromise too much for US trade deal The government has issued a loosely-worded statement days ahead of the expected signing of a tariff agreement with the United States, following a weekend meeting at President Prabowo Subianto’s Hambalang estate in Bogor, West Java. ... Unlocking regional potential to boost economic growth As an archipelagic country, Indonesia is endowed with diverse economic potential across regions, reflected in regional economic structures and export profiles. ... Japan's economy limps back to scant growth in Q4, raises test for Takaichi Japan's economy limped back to meager growth in the fourth quarter, significantly missing market expectations in a key test for Prime Minister Sanae Takaichi's government as cost-of-living pressures drag on confidence and domestic demand. Lunar New Year drives corporate decor boom, but retail demand falters Sellers of nian gao or kue keranjang in Glodok’s Chinatown area as well as parts of West and Central Java reporting softer sales compared to previous years. 'Be realistic' says Prabowo, while defending key programs President Prabowo Subianto has emphasized the need to be realistic in a speech on the Indonesian economy, where he promoted key initiatives of his administration to drive gross domestic product growth. Cumulative sales in high-rise condos stood at just 56 percent last year in a continuation of a decade-long downward trend, while new launches remained subdued in a lackluster market. EU leaders vow to accelerate single market, in struggle to compete with US, China European Union leaders agreed on Thursday on a wide-ranging set of commitments to improve how the bloc's border-free internal market works so Europe's businesses can be competitive and survive aggressive economic rivalry from the US and China. Indonesia ready to bridge trade, investment in Islamic world Prabowo leans on businesses to create jobs President Prabowo Subianto held meetings with Indonesian business leaders at his private Hambalang estate, during which he stated his commitment to improving the ease of doing business. New deputy finance minister guns for 5.6% first-quarter GDP growth Just under a week since he was sworn in last Thursday, the ex-Bank Indonesia deputy governor is setting his sights accelerated state spending this quarter to reach up to 5.6 percent growth from an initial 5.5 percent target. Pertamina denies Russian crude imports as EU mulls sanctions The European Union has proposed unprecedented sanctions against Indonesia’s Karimun Port for handling Russian oil. Retail sales post strong annual gain as consumer confidence holds up The retail sales index dipped slightly in January when compared with the holiday month of December but is up a strong 7 percent year-on-year. Indonesia’s growth: Resilient but uneven Although formal job creation has improved, job quality, reflected in income stability, benefits and productivity, remains unequal. Fiscal discipline remains intact, govt insists, after Moody’s outlook cut State Secretary Prasetyo Hadi said on Monday that the government continued to adhere to fiscal rules and had not breached statutory deficit limits, stressing that budget management remained on a prudent footing. Bulog proposes Mecca warehouse to stock haj rice exports Bulog’s planned warehouse in the Haj Village will also be used to store other food commodities from Indonesia, such as meat and fish, to meet the consumption needs of the haj pilgrims. Poverty at record low as govt seeks to redefine threshold The poverty rate rests at a historic low of 8.25 percent of the total population, continuing its declining trend from September 2022. Thomas Djiwandono sworn in as BI deputy governor The former deputy finance minister, who also President Prabowo Subianto's nephew, replaced Juda Agung, who resigned as BI deputy governor on Jan. 13 and was inaugurated as deputy finance minister on Thursday. Japan's Takaichi may struggle to soothe voters and markets Japanese stocks soared to record highs Monday after Prime Minister Sanae Takaichi's election triumph, but experts warned that the country's first woman leader could struggle to keep both voters and markets happy. Unemployment figure subsides despite growing layoffs Data from the Manpower Ministry in January showed a 13 percent layoff increase in 2025 compared with the preceding year. Economic fundamentals solid, govt insists, after Moody’s lowered outlook Economists interpret the rating agency’s latest assessment as a serious corrective signal, noting that a downgrade in Indonesia’s credit rating could sharply raise borrowing costs and pile pressure on the rupiah. Ex-BI deputy replaces Tommy as deputy finance minister In what appears to be a coordinated role swap, the President has appointed a former BI deputy governor to fill the deputy finance minister post left vacant by his nephew Tommy Djiwandono, who is set to take up his new job as BI deputy governor. Govt waives airfare VAT for Idul Fitri The government has announced a temporary waiver on value-added tax (VAT) for airline tickets for the upcoming Idul Fitri holiday period, when travel demand spikes across the country. Indonesian markets face more pressure after Moody's cuts outlook Indonesian stocks and currency traded weaker in early trade on Friday after Moody's lowered the country's credit rating outlook, the latest jolt in a turbulent start to the year for Southeast Asia's largest economy. Economic growth improved slightly last year but failed to meet the government’s target set out in the state budget. Indonesian economic growth tops 5% on consumption boost The figures come days after the country's stock market suffered its worst crash in decades after index compiler MSCI threatened a downgrade over the transparency of the free-float stocks. Purbaya calls out Citi economist over deficit projection The finance minister stated that the 2025 deficit was deliberately pushed close to the 3 percent limit to ensure that the economic downturn did not spiral into a recession. Weather woes, demand strain may keep inflation above target Statistics Indonesia (BPS) reported that annual inflation reached 3.55 percent year-on-year (yoy) in January, citing a low base effect after the figure fell below its normal trend in January last year because of electricity tariff discounts. WTO must 'reform or die': talks facilitator Successfully reforming the WTO is a matter of life and death for the organization, warns the facilitator of talks on revamping the global trade body. Indonesia imports Russian oil in December and January, data shows The imports, tracked by Kpler and Vortexa, came as the prospect of declining demand from India, one of the main buyers of Russian crude, has depressed prices of the western-sanctioned oil, sales of which are vital in helping fund the war in Ukraine. Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Legacy, landscapes and lives: The tales of Nusantara Black and White of RI Fiesta of Democracy Silent, invisible danger on Cirebon coast Some 5.7 tonnes of shrimp contaminated with Cesium 137 disposed InterContinental Bali Resort introduces restorative Silent Retreat BPJS Kesehatan ends 2024 with prestigious international awards Love unveiled at Adriana Cocina & Bar: A new Mexican rooftop experience in Bali Get the latest news in your inbox",
    "negative_score": 39,
    "sentiment_score": 0.9898,
    "is_negative": true,
    "source": "jakartapost_business",
    "processed_at": "2026-02-18T04:15:18.406699"
  },
  {
    "title": "",
    "url": "http://www.thejakartapost.com/business/tech",
    "published_date": "",
    "summary": "Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Police stand guard at the Bharat Mandapam on the eve of the 'India AI Impact Summit 2026' in New Delhi on Feb. 15, 2026. Job threats, rogue bots: five hot issues in AI As artificial intelligence evolves at a blistering pace, world leaders and thousands of other delegates will discuss how to handle the technology at the AI Impact Summit, which opens Monday in New Delhi. Get the latest news in your inbox Some technology firms deliberately avoid using personally identifiable information in their AI models to reduce compliance risks, despite the limitations this places on their ability to improve operational efficiency. ... China’s ByteDance releases Doubao 2.0 AI model for 'agent era' China's ByteDance has rolled out its Doubao 2.0 model, an upgrade of the country's most widely used artificial-intelligence app, the company said on Saturday. ... Jury told that Meta, Google 'engineered addiction' at landmark US trial Meta and Google-owned YouTube were accused Monday of pushing highly addictive apps on children as a landmark social media trial began in earnest in a California court. Crypto firm accidentally sends $40 billion in bitcoin to users According to local reports, Bithumb was meant to send about 2,000 won (US$1.37) to each customer as part of a promotion, but mistakenly transferred roughly 2,000 bitcoins per user. IT companies collaborate to support digital transformation in Indonesia The collaboration is expected to push digital innovation and ensure the safety, scalability and performance of organizations in Indonesia. Musk's Starlink updates privacy policy to allow consumer data to train AI Starlink collects vast amounts of user data, spanning location information, credit card information, contact information and user IP addresses. Indonesia logs $1b food delivery growth, region’s highest Up 18 percent in a year, Indonesia’s US$1 billion gross merchandise value (GMV) growth is the highest in the region. Visa-processing startup Spun bags $1.8m for regional expansion The company operates a platform that processes inbound and outbound visa applications using AI-enabled systems. India's central bank proposes linking BRICS' digital currencies, sources say India's central bank has proposed that BRICS countries link their official digital currencies to make cross-border trade and tourism payments easier, two sources said, which could reduce reliance on the US dollar as geopolitical tensions rise. Social media sites block 4.7 million underage accounts in Australia Initial figures showed platforms were taking meaningful action to remove underage users, Australia's eSafety Commissioner Julie Inman Grant said. Musk dealt blow over Grok deepfakes, but regulatory fight far from over The climb-down by Musk, who initially laughed off the trend, highlights the difficulty of policing AI tools that make it cheap and easy to create explicit content. It is the latest clash between Europe and Musk, following rows over election interference, content moderation and free speech. Indonesia tumbles in cybersecurity ranking Experts have called for a change in thinking among business leaders and regulators after Indonesia plummeted from position 48 to 84 in a global ranking of countries for cybersecurity. Elon Musk's Grok faces global scrutiny for sexualized AI deepfakes X says it takes action against illegal content on the platform, including child sexual abuse material, by removing it, permanently suspending accounts, and working with local governments and law enforcement as necessary. OJK threatens ‘corrective measures’ as P2P defaults rise The default rate of peer-to-peer lending in the fintech industry has worsened, with the ratio of 90 days past due (TWP90) loans to total loans standing at 4.33 percent in November, up from 2.52 percent in November 2024, according to Financial Authority Services (OJK) data. Musk's Grok under fire over sexualized images despite new limits Grok has faced global backlash after it emerged the feature allowed users to sexualize images of women and children using simple text prompts such as \"put her in a bikini\" or \"remove her clothes.\" Grok under fire after complaints it undressed minors in photos The \"Edit Image\" button feature first rolled out in late December on Grok allows users to modify any image on the platform, with some users deciding to partially or completely remove clothing from women or children in pictures, according to complaints. Start-up scandals in 2025 force investors to raise the bar, change playbooks From the unravelling of eFishery saga to corruption probes ensnaring venture capital executives tied to state-backed funding at TaniHub, the year stripped the gloss from Southeast Asia’s most coveted start-up market. TSMC says started mass production of 'most advanced' 2nm chips Taiwanese tech titan TSMC has started mass producing its cutting-edge 2-nanometer semiconductor chips, the company said in a statement seen by AFP on Wednesday. How China built its ‘Manhattan Project’ to rival the West in AI chips In a high-security Shenzhen laboratory, Chinese scientists have built what Washington has spent years trying to prevent: a prototype of a machine capable of producing the cutting-edge semiconductor chips that power artificial intelligence, smartphones and weapons central to Western military dominance. US threatens countermeasures on European service providers after EU fines President Donald Trump's administration warned on Tuesday the United States could impose fees or restrictions on European service providers in response to what it called “discriminatory” actions against US firms. China's smaller manufacturers look to catch the automation wave In a light-filled workshop in eastern China, a robotic arm moved a partially assembled autonomous vehicle as workers calibrated its cameras, typical of the incremental automation being adopted even across smaller factories in the world's manufacturing powerhouse. Google to build subsea cables in PNG under Australia defense treaty The $120-million effort will link northern and southern Papua New Guinea and the Bougainville autonomous region with high-capacity cables, Peter Tsiamalili, PNG's acting minister for information and communications technology, said on Friday. Aftech's Mandiri BFN Fest aims to boost trust in fintech The festival, which runs from Dec. 10 to 11 and is free to all visitors, aims to increase public trust in the fintech industry toward better, sustainable economic growth. Oil-rich UAE turns to AI to grease economy Deep in the Abu Dhabi desert, a vast AI campus a quarter the size of Paris is starting to emerge, the oil-rich UAE's boldest bet yet on technology it hopes will help transform its economy. Robinhood to enter RI with broker, crypto trader acquisitions Founded in California in 2013, Robinhood shot to fame during the social-media-fueled retail-trading frenzy of 2021 and gained broader market legitimacy this year after joining the United States benchmark S&P 500 index. X gets $140 million EU fine for breaching content rules but TikTok settles Elon Musk's social media company X was fined 120 million euros (US$140 million) by EU tech regulators on Friday for breaching online content rules, the first sanction under landmark legislation that once again drew criticism from the US government. Meta partners with news outlets to expand AI content The expansion aims to make its AI assistant \"more responsive, accurate, and balanced\" by incorporating diverse viewpoints, acknowledging that \"real-time events can be challenging for current AI systems to keep up with.\" EU hits Meta with antitrust probe over plans to block AI rivals from WhatsApp Indonesia racks up $2.6b in digital taxes since 2020 Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Legacy, landscapes and lives: The tales of Nusantara Black and White of RI Fiesta of Democracy Silent, invisible danger on Cirebon coast Some 5.7 tonnes of shrimp contaminated with Cesium 137 disposed InterContinental Bali Resort introduces restorative Silent Retreat BPJS Kesehatan ends 2024 with prestigious international awards Love unveiled at Adriana Cocina & Bar: A new Mexican rooftop experience in Bali Get the latest news in your inbox",
    "category": "company",
    "author": "",
    "content": "Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Police stand guard at the Bharat Mandapam on the eve of the 'India AI Impact Summit 2026' in New Delhi on Feb. 15, 2026. Job threats, rogue bots: five hot issues in AI As artificial intelligence evolves at a blistering pace, world leaders and thousands of other delegates will discuss how to handle the technology at the AI Impact Summit, which opens Monday in New Delhi. Get the latest news in your inbox Some technology firms deliberately avoid using personally identifiable information in their AI models to reduce compliance risks, despite the limitations this places on their ability to improve operational efficiency. ... China’s ByteDance releases Doubao 2.0 AI model for 'agent era' China's ByteDance has rolled out its Doubao 2.0 model, an upgrade of the country's most widely used artificial-intelligence app, the company said on Saturday. ... Jury told that Meta, Google 'engineered addiction' at landmark US trial Meta and Google-owned YouTube were accused Monday of pushing highly addictive apps on children as a landmark social media trial began in earnest in a California court. Crypto firm accidentally sends $40 billion in bitcoin to users According to local reports, Bithumb was meant to send about 2,000 won (US$1.37) to each customer as part of a promotion, but mistakenly transferred roughly 2,000 bitcoins per user. IT companies collaborate to support digital transformation in Indonesia The collaboration is expected to push digital innovation and ensure the safety, scalability and performance of organizations in Indonesia. Musk's Starlink updates privacy policy to allow consumer data to train AI Starlink collects vast amounts of user data, spanning location information, credit card information, contact information and user IP addresses. Indonesia logs $1b food delivery growth, region’s highest Up 18 percent in a year, Indonesia’s US$1 billion gross merchandise value (GMV) growth is the highest in the region. Visa-processing startup Spun bags $1.8m for regional expansion The company operates a platform that processes inbound and outbound visa applications using AI-enabled systems. India's central bank proposes linking BRICS' digital currencies, sources say India's central bank has proposed that BRICS countries link their official digital currencies to make cross-border trade and tourism payments easier, two sources said, which could reduce reliance on the US dollar as geopolitical tensions rise. Social media sites block 4.7 million underage accounts in Australia Initial figures showed platforms were taking meaningful action to remove underage users, Australia's eSafety Commissioner Julie Inman Grant said. Musk dealt blow over Grok deepfakes, but regulatory fight far from over The climb-down by Musk, who initially laughed off the trend, highlights the difficulty of policing AI tools that make it cheap and easy to create explicit content. It is the latest clash between Europe and Musk, following rows over election interference, content moderation and free speech. Indonesia tumbles in cybersecurity ranking Experts have called for a change in thinking among business leaders and regulators after Indonesia plummeted from position 48 to 84 in a global ranking of countries for cybersecurity. Elon Musk's Grok faces global scrutiny for sexualized AI deepfakes X says it takes action against illegal content on the platform, including child sexual abuse material, by removing it, permanently suspending accounts, and working with local governments and law enforcement as necessary. OJK threatens ‘corrective measures’ as P2P defaults rise The default rate of peer-to-peer lending in the fintech industry has worsened, with the ratio of 90 days past due (TWP90) loans to total loans standing at 4.33 percent in November, up from 2.52 percent in November 2024, according to Financial Authority Services (OJK) data. Musk's Grok under fire over sexualized images despite new limits Grok has faced global backlash after it emerged the feature allowed users to sexualize images of women and children using simple text prompts such as \"put her in a bikini\" or \"remove her clothes.\" Grok under fire after complaints it undressed minors in photos The \"Edit Image\" button feature first rolled out in late December on Grok allows users to modify any image on the platform, with some users deciding to partially or completely remove clothing from women or children in pictures, according to complaints. Start-up scandals in 2025 force investors to raise the bar, change playbooks From the unravelling of eFishery saga to corruption probes ensnaring venture capital executives tied to state-backed funding at TaniHub, the year stripped the gloss from Southeast Asia’s most coveted start-up market. TSMC says started mass production of 'most advanced' 2nm chips Taiwanese tech titan TSMC has started mass producing its cutting-edge 2-nanometer semiconductor chips, the company said in a statement seen by AFP on Wednesday. How China built its ‘Manhattan Project’ to rival the West in AI chips In a high-security Shenzhen laboratory, Chinese scientists have built what Washington has spent years trying to prevent: a prototype of a machine capable of producing the cutting-edge semiconductor chips that power artificial intelligence, smartphones and weapons central to Western military dominance. US threatens countermeasures on European service providers after EU fines President Donald Trump's administration warned on Tuesday the United States could impose fees or restrictions on European service providers in response to what it called “discriminatory” actions against US firms. China's smaller manufacturers look to catch the automation wave In a light-filled workshop in eastern China, a robotic arm moved a partially assembled autonomous vehicle as workers calibrated its cameras, typical of the incremental automation being adopted even across smaller factories in the world's manufacturing powerhouse. Google to build subsea cables in PNG under Australia defense treaty The $120-million effort will link northern and southern Papua New Guinea and the Bougainville autonomous region with high-capacity cables, Peter Tsiamalili, PNG's acting minister for information and communications technology, said on Friday. Aftech's Mandiri BFN Fest aims to boost trust in fintech The festival, which runs from Dec. 10 to 11 and is free to all visitors, aims to increase public trust in the fintech industry toward better, sustainable economic growth. Oil-rich UAE turns to AI to grease economy Deep in the Abu Dhabi desert, a vast AI campus a quarter the size of Paris is starting to emerge, the oil-rich UAE's boldest bet yet on technology it hopes will help transform its economy. Robinhood to enter RI with broker, crypto trader acquisitions Founded in California in 2013, Robinhood shot to fame during the social-media-fueled retail-trading frenzy of 2021 and gained broader market legitimacy this year after joining the United States benchmark S&P 500 index. X gets $140 million EU fine for breaching content rules but TikTok settles Elon Musk's social media company X was fined 120 million euros (US$140 million) by EU tech regulators on Friday for breaching online content rules, the first sanction under landmark legislation that once again drew criticism from the US government. Meta partners with news outlets to expand AI content The expansion aims to make its AI assistant \"more responsive, accurate, and balanced\" by incorporating diverse viewpoints, acknowledging that \"real-time events can be challenging for current AI systems to keep up with.\" EU hits Meta with antitrust probe over plans to block AI rivals from WhatsApp Indonesia racks up $2.6b in digital taxes since 2020 Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Legacy, landscapes and lives: The tales of Nusantara Black and White of RI Fiesta of Democracy Silent, invisible danger on Cirebon coast Some 5.7 tonnes of shrimp contaminated with Cesium 137 disposed InterContinental Bali Resort introduces restorative Silent Retreat BPJS Kesehatan ends 2024 with prestigious international awards Love unveiled at Adriana Cocina & Bar: A new Mexican rooftop experience in Bali Get the latest news in your inbox",
    "negative_score": 32,
    "sentiment_score": 0.9982,
    "is_negative": true,
    "source": "jakartapost_business",
    "processed_at": "2026-02-18T04:17:23.027911"
  },
  {
    "title": "",
    "url": "http://www.thejakartapost.com/business/companies",
    "published_date": "",
    "summary": "Vietnam licenses Musk's satellite internet firm Starlink Vietnam has granted a license to Elon Musk's Starlink to operate its satellite internet services in the communist country, a government agency said. A woman rides a bicycle in front of an electric bus on the street in Hanoi on Nov. 21, 2025. Tiffany & Co stores sealed over alleged illegal imports Danantara’s poultry push raises concerns over market distortion Pertamina to spin off airlines, hospitals, non-oil units this year The 2024 banking industry outlook There are two situations in 2024 that will affect the condition of national banking; first, the general election; second, indications of a weakening global economy. Tuksedo gives cars from the past a brand-new future A family-owned workshop in Bali recreates classic cars for discerning customers and is now looking to include EV options. Indonesia, ExxonMobil sign agreement on CCS, petrochemical projects The government, along with state-owned oil and gas corporation Pertamina, inked two agreements with United States oil and gas giant ExxonMobil pertaining to advancing the progress on carbon capture storage (CCS) projects and exploring a potential petrochemical complex in Indonesia. From Frenchie to fortune: Kurobokan spotlights Indonesia-designed toys With quirky collectibles, Kurobokan puts Indonesia on the map in the so-called kidult market, proving that toys are for everyone, no matter their age. Indosat Ooredoo Hutchison shows healthy fundamentals in 2025 with 12.2% net profit growth Indosat Ooredoo Hutchison (ISAT) demonstrated robust performance throughout 2025, recording revenue of Rp 56.5 trillion (US$3.37 billion) in addition to double-digit profit growth of 12.2 percent year-on-year (yoy) and 51 percent quarter-on-quarter (qoq) to Rp 5.5 trillion. PLN EPI breaks ground on Rp1 trillion gas pipeline PLN EPI breaks ground on Rp1 trillion gas pipeline PT PLN Energi Primer Indonesia has begun the construction of a Rp 1 trillion (US$59.57 million) gas pipeline linking the West Natuna Transportation System (WNTS) to Pemping Island, Batam. Finance Ministry’s SMI secures $9.3m grants to expand green finance PT SMI operates as a development finance institution providing corporate and public financing alongside project advisory and preparation services. Danantara breaks ground on $7b downstream industry projects The projects, launched simultaneously across 13 regions on Friday, are fully funded from Danantara’s internal resources and are expected to create about 6,000 direct jobs, the fund said in a statement. Cloud, AI services to boost Indonesia’s economy, Microsoft says Backed by a US$1.7 billion investment through 2028, Microsoft aims to build Indonesia’s digital economy by expanding cloud and AI infrastructure, strengthening the developer ecosystem and training 500,000 AI-ready talents by 2026. Bosch goes new ways with modular factory in West Java Indonesia ‘impatient’ in tech adoption, Infor says GE HealthCare eyes Indonesia as regional hub for medical device exports Bali’s Nuanu seeks investors that look beyond profit Executive Column: Being a small bank makes no sense, says KBank FLSmidth sees energy transition driving global minerals demand Bali Waste Cycle aims to scale up to make recycling profitable Born out of Bali’s growing trash problem, Bali Waste Cycle (BWC) seeks to expand its business, balancing profit, purpose and sustainability. Oaken Lab brings fresh scent to Indonesia’s perfume market Oaken Lab brings fresh scent to Indonesia’s perfume market Coffee chain Tuku seeks perfect blend for expansion Studio Ubud awakens Indonesian anime Teck Seng Ho: Understanding client needs crucial for sustaining Sun Life Indonesia Newly appointed Sun Life Indonesia president director Teck Seng Ho has expressed positivity about the company’s client-friendly work environment. Leading Indosat's growth to empower Indonesia, Vikram Sinha named 2023 CEO of the Year Indosat Ooredoo Hutchison (Indosat) continues to record splendid operational and financial performances following its recent merger. Embracing the spirit of Gotong Royong, Indosat has a greater goal of empowering Indonesia. Securing Indonesians’ future through innovation, teamwork PT Asuransi Allianz Life Indonesia has recently appointed Alexander Grenz as Country Manager and President Director of Allianz Life Indonesia. After obtaining a permit from the Financial Services Authority (OJK), he took the role on April 7, where he will be managing Allianz's operational activities Melissa Siska Juminto and the journey of growth and excellence In an age of instant gratification, trusting the process has become somewhat of a rare quality. This is not the case for Melissa Siska Juminto. Get the latest news in your inbox",
    "category": "company",
    "author": "",
    "content": "Vietnam licenses Musk's satellite internet firm Starlink Vietnam has granted a license to Elon Musk's Starlink to operate its satellite internet services in the communist country, a government agency said. A woman rides a bicycle in front of an electric bus on the street in Hanoi on Nov. 21, 2025. Tiffany & Co stores sealed over alleged illegal imports Danantara’s poultry push raises concerns over market distortion Pertamina to spin off airlines, hospitals, non-oil units this year The 2024 banking industry outlook There are two situations in 2024 that will affect the condition of national banking; first, the general election; second, indications of a weakening global economy. Tuksedo gives cars from the past a brand-new future A family-owned workshop in Bali recreates classic cars for discerning customers and is now looking to include EV options. Indonesia, ExxonMobil sign agreement on CCS, petrochemical projects The government, along with state-owned oil and gas corporation Pertamina, inked two agreements with United States oil and gas giant ExxonMobil pertaining to advancing the progress on carbon capture storage (CCS) projects and exploring a potential petrochemical complex in Indonesia. From Frenchie to fortune: Kurobokan spotlights Indonesia-designed toys With quirky collectibles, Kurobokan puts Indonesia on the map in the so-called kidult market, proving that toys are for everyone, no matter their age. Indosat Ooredoo Hutchison shows healthy fundamentals in 2025 with 12.2% net profit growth Indosat Ooredoo Hutchison (ISAT) demonstrated robust performance throughout 2025, recording revenue of Rp 56.5 trillion (US$3.37 billion) in addition to double-digit profit growth of 12.2 percent year-on-year (yoy) and 51 percent quarter-on-quarter (qoq) to Rp 5.5 trillion. PLN EPI breaks ground on Rp1 trillion gas pipeline PLN EPI breaks ground on Rp1 trillion gas pipeline PT PLN Energi Primer Indonesia has begun the construction of a Rp 1 trillion (US$59.57 million) gas pipeline linking the West Natuna Transportation System (WNTS) to Pemping Island, Batam. Finance Ministry’s SMI secures $9.3m grants to expand green finance PT SMI operates as a development finance institution providing corporate and public financing alongside project advisory and preparation services. Danantara breaks ground on $7b downstream industry projects The projects, launched simultaneously across 13 regions on Friday, are fully funded from Danantara’s internal resources and are expected to create about 6,000 direct jobs, the fund said in a statement. Cloud, AI services to boost Indonesia’s economy, Microsoft says Backed by a US$1.7 billion investment through 2028, Microsoft aims to build Indonesia’s digital economy by expanding cloud and AI infrastructure, strengthening the developer ecosystem and training 500,000 AI-ready talents by 2026. Bosch goes new ways with modular factory in West Java Indonesia ‘impatient’ in tech adoption, Infor says GE HealthCare eyes Indonesia as regional hub for medical device exports Bali’s Nuanu seeks investors that look beyond profit Executive Column: Being a small bank makes no sense, says KBank FLSmidth sees energy transition driving global minerals demand Bali Waste Cycle aims to scale up to make recycling profitable Born out of Bali’s growing trash problem, Bali Waste Cycle (BWC) seeks to expand its business, balancing profit, purpose and sustainability. Oaken Lab brings fresh scent to Indonesia’s perfume market Oaken Lab brings fresh scent to Indonesia’s perfume market Coffee chain Tuku seeks perfect blend for expansion Studio Ubud awakens Indonesian anime Teck Seng Ho: Understanding client needs crucial for sustaining Sun Life Indonesia Newly appointed Sun Life Indonesia president director Teck Seng Ho has expressed positivity about the company’s client-friendly work environment. Leading Indosat's growth to empower Indonesia, Vikram Sinha named 2023 CEO of the Year Indosat Ooredoo Hutchison (Indosat) continues to record splendid operational and financial performances following its recent merger. Embracing the spirit of Gotong Royong, Indosat has a greater goal of empowering Indonesia. Securing Indonesians’ future through innovation, teamwork PT Asuransi Allianz Life Indonesia has recently appointed Alexander Grenz as Country Manager and President Director of Allianz Life Indonesia. After obtaining a permit from the Financial Services Authority (OJK), he took the role on April 7, where he will be managing Allianz's operational activities Melissa Siska Juminto and the journey of growth and excellence In an age of instant gratification, trusting the process has become somewhat of a rare quality. This is not the case for Melissa Siska Juminto. Get the latest news in your inbox",
    "negative_score": 0,
    "sentiment_score": 0.9973,
    "is_negative": false,
    "source": "jakartapost_business",
    "processed_at": "2026-02-18T04:17:23.048788"
  },
  {
    "title": "",
    "url": "http://www.thejakartapost.com/business/regulations",
    "published_date": "",
    "summary": "Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers The sun sets beyond an oil and gas rig operated by Saka Energi Muriah Limited, a wholly owned subsidiary of state gas company PGN, in the Kepodang Field of the Muriah Block off Semarang, Central Java, in this undated handout photo. Idle oil and gas projects risk losing licenses, Bahlil warns The energy minister has taken an \"all stick, no carrot\" strategy to pressure firms into start pumping oil and gas from stalled projects, threatening hundreds of wells with the prospect of losing their permits. Get the latest news in your inbox Site selection for first nuclear plant expected by mid-2026, says renewables official According to the ministry's renewables director general, the Bangka Belitung Islands and West Kalimantan are two priority provinces under consideration as a potential site for developing Indonesia's first nuclear power plant toward a 2032 on-grid target. ... EU proposes extending Russian oil sanctions to maritime services It has been reported that Karimun, Riau Islands, has been part of a system of traders, shippers and transshipment points, including the floating hub along the Malacca and Singapore straits and Fujairah in the United Arab Emirates, that has helped keep Russian oil and products flowing, despite the sanctions. ... Prabowo ordered purge of IDX, OJK leadership, brother says Hashim Djojohadikusumo, who is the special envoy for climate change and the brother of President Prabowo Subianto, said the five IDX and OJK officials who resigned soon after last month’s market crash did so in direct response to the President’s order. EU proposes sanctions on Indonesian ports for handling Russian oil The proposal would bar EU companies and individuals from conducting transactions with Karimun Port in Indonesia and Kulevi Port in Georgia. Indonesia proposes 3 measures to meet MSCI's transparency demands As part of their eight-point plan, Indonesian authorities have come up with three proposed measures to meet MSCI's transparency demands and avoid potential downgrading to emerging market status. Crackdown on mining permits faces legal scrutiny A potential lawsuit over halted mining operations could expose the state to fiscal risks reaching tens of trillions of rupiah, extending far beyond legal fees to include lost revenue and compensation claims. Pushing rupiah to 15,000 per dollar ‘not that difficult’, says Purbaya Finance Minister Purbaya Yudhi Sadewa says pushing the rupiah exchange rate back up to 15,000 per United States dollar should not be that difficult as the currency is undervalued when taking into account Indonesia’s economic fundamentals. Weak commitment, policy uncertainty derail RI renewable targets The contribution of renewable energy to the national energy mix, which refer to total electricity production, rose by only 1.1 percentage points to 15.75 percent in 2025. OJK, IDX name new leaders before markets open again The Financial Services Authority (OJK) has announced replacements for four of its high-ranking officials who stepped down on Friday, while the Indonesia Stock Exchange (IDX) is also set to appoint a new interim director ahead of a meeting with global stock market index compiler Morgan Stanley Capital International (MSCI) scheduled for Monday. Heads roll at IDX, OJK, as govt vows to fix stock market It is not immediately clear whether the resignations of five high-ranking officials at the Indonesia Stock Exchange (IDX) and the Financial Services Authority (OJK) were voluntary or forced. Senior minister Airlangga Hartarto said President Prabowo Subianto is monitoring the stock exchange following the market meltdown. Post-flood regulatory crackdown signals 'creeping nationalization' The abrupt revocation of mining permits and the planned transfer of assets to state firms have raised concerns of \"nationalization\", undermining legal certainty and threatening to erode Indonesia’s appeal to foreign capital. What's behind Indonesia's worst stock crash in decades? IDX director steps down after stocks plunge amid MSCI warning Indonesia Stock Exchange (IDX) president director Iman Rachman has announced his resignation following Morgan Stanley Capital International’s (MSCI) transparency warning that triggered a massive sell-off in Indonesian stocks and temporary trading halts earlier this week. Govt vows swift changes to heed MSCI demands for RI stocks Both Indonesia Stock Exchange (IDX) and the Financial Services Authority (OJK) have promised to act fast and change stock market regulations pursuant to points made by Morgan Stanley Capital International (MSCI) that prompted a massive sell-off. State-owned Perminas to assume control of Martabe gold mine The Martabe gold mine in North Sumatra, operated by PT Agincourt Resources, will be transferred to state control under the newly formed National Mineral Company (Perminas), ending recent speculation about one of Indonesia's major gold assets. BYD, VinFast to start local EV production in March, govt says Failure to meet those commitments allows the government to draw down bank guarantees posted by the companies as penalties. Danantara to manage land seized from 28 firms linked to Sumatra floods PT North Sumatra Hydro Energy (NSHE), which runs the Batangtoru hydropower facility, is among the 28 firms whose permits were revoked after the floods. The company is controlled by China's state-run SDIC Power Holdings Co. Ltd. Shell, BP to receive fuel import quotas every six months this year As private fuel retailers began seeing their annual stocks run low last August, the government refused to issue additional quotas and instead urged them to buy imported base fuel from Pertamina. Plan to build subsidized apartments in Meikarta raises doubts The Public Housing and Settlements Ministry plans to transform parts of the long-stalled Meikarta project in Bekasi, West Java, into a subsidized apartment complex (Rusun) to provide affordable homes in urban areas for low-income earners. Indonesia cuts live cattle price cap after beef traders’ strike Beef prices in Indonesia usually climb ahead of Idul Fitri, which is expected to fall on March 21 this year, as seasonal demand rises during Ramadan and the festive period. E-commerce sellers wait for tighter rules on platform fees E-commerce sellers say restrictions on platform fees under a planned new regulation would help them manage pricing more efficiently. Indonesia seeks to boost rooftop solar quota by 400 MW If approved by state electricity monopoly PLN, the total quota for 2026 would rise to around 1,400 MW. Illegal tobacco excise plan casts haze over market fairness, policy certainty Finance Minister Purbaya Yudhi Sadewa estimated that formalizing illegal cigarette production could generate additional trillions of rupiah (more than US$59 million) for the state coffers. BI to remain ‘professional’ with strong governance, Perry vows Professionalism will continue in monetary policymaking, Bank Indonesia (BI) Governor Perry Warjiyo has promised, seeking to allay any concerns following Deputy Finance Minister Thomas “Tommy” Djiwandono’s nomination as a deputy BI governor. Indonesia aims for garlic self-sufficiency in 2029 Roughly 95 percent of the country’s consumption is currently met through imports. Prabowo’s $6 billion rescue plan leaves textile industry puzzled A state-owned textile enterprise is to tackle industrywide problems, including rehiring tens of thousands of workers laid off after the Sritex bankruptcy. Catch-up costs loom as Prabowo revives semiconductor dream Prabowo's nephew enters race for senior central bank post Deputy finance minister Thomas \"Tommy\" Djiwandono, who is also a nephew of President Prabowo Subianto, has been lined up to become a deputy governor of Bank Indonesia (BI), raising questions about the central bank’s independence. Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Legacy, landscapes and lives: The tales of Nusantara Black and White of RI Fiesta of Democracy Silent, invisible danger on Cirebon coast Some 5.7 tonnes of shrimp contaminated with Cesium 137 disposed InterContinental Bali Resort introduces restorative Silent Retreat BPJS Kesehatan ends 2024 with prestigious international awards Love unveiled at Adriana Cocina & Bar: A new Mexican rooftop experience in Bali Get the latest news in your inbox",
    "category": "company",
    "author": "",
    "content": "Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers The sun sets beyond an oil and gas rig operated by Saka Energi Muriah Limited, a wholly owned subsidiary of state gas company PGN, in the Kepodang Field of the Muriah Block off Semarang, Central Java, in this undated handout photo. Idle oil and gas projects risk losing licenses, Bahlil warns The energy minister has taken an \"all stick, no carrot\" strategy to pressure firms into start pumping oil and gas from stalled projects, threatening hundreds of wells with the prospect of losing their permits. Get the latest news in your inbox Site selection for first nuclear plant expected by mid-2026, says renewables official According to the ministry's renewables director general, the Bangka Belitung Islands and West Kalimantan are two priority provinces under consideration as a potential site for developing Indonesia's first nuclear power plant toward a 2032 on-grid target. ... EU proposes extending Russian oil sanctions to maritime services It has been reported that Karimun, Riau Islands, has been part of a system of traders, shippers and transshipment points, including the floating hub along the Malacca and Singapore straits and Fujairah in the United Arab Emirates, that has helped keep Russian oil and products flowing, despite the sanctions. ... Prabowo ordered purge of IDX, OJK leadership, brother says Hashim Djojohadikusumo, who is the special envoy for climate change and the brother of President Prabowo Subianto, said the five IDX and OJK officials who resigned soon after last month’s market crash did so in direct response to the President’s order. EU proposes sanctions on Indonesian ports for handling Russian oil The proposal would bar EU companies and individuals from conducting transactions with Karimun Port in Indonesia and Kulevi Port in Georgia. Indonesia proposes 3 measures to meet MSCI's transparency demands As part of their eight-point plan, Indonesian authorities have come up with three proposed measures to meet MSCI's transparency demands and avoid potential downgrading to emerging market status. Crackdown on mining permits faces legal scrutiny A potential lawsuit over halted mining operations could expose the state to fiscal risks reaching tens of trillions of rupiah, extending far beyond legal fees to include lost revenue and compensation claims. Pushing rupiah to 15,000 per dollar ‘not that difficult’, says Purbaya Finance Minister Purbaya Yudhi Sadewa says pushing the rupiah exchange rate back up to 15,000 per United States dollar should not be that difficult as the currency is undervalued when taking into account Indonesia’s economic fundamentals. Weak commitment, policy uncertainty derail RI renewable targets The contribution of renewable energy to the national energy mix, which refer to total electricity production, rose by only 1.1 percentage points to 15.75 percent in 2025. OJK, IDX name new leaders before markets open again The Financial Services Authority (OJK) has announced replacements for four of its high-ranking officials who stepped down on Friday, while the Indonesia Stock Exchange (IDX) is also set to appoint a new interim director ahead of a meeting with global stock market index compiler Morgan Stanley Capital International (MSCI) scheduled for Monday. Heads roll at IDX, OJK, as govt vows to fix stock market It is not immediately clear whether the resignations of five high-ranking officials at the Indonesia Stock Exchange (IDX) and the Financial Services Authority (OJK) were voluntary or forced. Senior minister Airlangga Hartarto said President Prabowo Subianto is monitoring the stock exchange following the market meltdown. Post-flood regulatory crackdown signals 'creeping nationalization' The abrupt revocation of mining permits and the planned transfer of assets to state firms have raised concerns of \"nationalization\", undermining legal certainty and threatening to erode Indonesia’s appeal to foreign capital. What's behind Indonesia's worst stock crash in decades? IDX director steps down after stocks plunge amid MSCI warning Indonesia Stock Exchange (IDX) president director Iman Rachman has announced his resignation following Morgan Stanley Capital International’s (MSCI) transparency warning that triggered a massive sell-off in Indonesian stocks and temporary trading halts earlier this week. Govt vows swift changes to heed MSCI demands for RI stocks Both Indonesia Stock Exchange (IDX) and the Financial Services Authority (OJK) have promised to act fast and change stock market regulations pursuant to points made by Morgan Stanley Capital International (MSCI) that prompted a massive sell-off. State-owned Perminas to assume control of Martabe gold mine The Martabe gold mine in North Sumatra, operated by PT Agincourt Resources, will be transferred to state control under the newly formed National Mineral Company (Perminas), ending recent speculation about one of Indonesia's major gold assets. BYD, VinFast to start local EV production in March, govt says Failure to meet those commitments allows the government to draw down bank guarantees posted by the companies as penalties. Danantara to manage land seized from 28 firms linked to Sumatra floods PT North Sumatra Hydro Energy (NSHE), which runs the Batangtoru hydropower facility, is among the 28 firms whose permits were revoked after the floods. The company is controlled by China's state-run SDIC Power Holdings Co. Ltd. Shell, BP to receive fuel import quotas every six months this year As private fuel retailers began seeing their annual stocks run low last August, the government refused to issue additional quotas and instead urged them to buy imported base fuel from Pertamina. Plan to build subsidized apartments in Meikarta raises doubts The Public Housing and Settlements Ministry plans to transform parts of the long-stalled Meikarta project in Bekasi, West Java, into a subsidized apartment complex (Rusun) to provide affordable homes in urban areas for low-income earners. Indonesia cuts live cattle price cap after beef traders’ strike Beef prices in Indonesia usually climb ahead of Idul Fitri, which is expected to fall on March 21 this year, as seasonal demand rises during Ramadan and the festive period. E-commerce sellers wait for tighter rules on platform fees E-commerce sellers say restrictions on platform fees under a planned new regulation would help them manage pricing more efficiently. Indonesia seeks to boost rooftop solar quota by 400 MW If approved by state electricity monopoly PLN, the total quota for 2026 would rise to around 1,400 MW. Illegal tobacco excise plan casts haze over market fairness, policy certainty Finance Minister Purbaya Yudhi Sadewa estimated that formalizing illegal cigarette production could generate additional trillions of rupiah (more than US$59 million) for the state coffers. BI to remain ‘professional’ with strong governance, Perry vows Professionalism will continue in monetary policymaking, Bank Indonesia (BI) Governor Perry Warjiyo has promised, seeking to allay any concerns following Deputy Finance Minister Thomas “Tommy” Djiwandono’s nomination as a deputy BI governor. Indonesia aims for garlic self-sufficiency in 2029 Roughly 95 percent of the country’s consumption is currently met through imports. Prabowo’s $6 billion rescue plan leaves textile industry puzzled A state-owned textile enterprise is to tackle industrywide problems, including rehiring tens of thousands of workers laid off after the Sritex bankruptcy. Catch-up costs loom as Prabowo revives semiconductor dream Prabowo's nephew enters race for senior central bank post Deputy finance minister Thomas \"Tommy\" Djiwandono, who is also a nephew of President Prabowo Subianto, has been lined up to become a deputy governor of Bank Indonesia (BI), raising questions about the central bank’s independence. Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Legacy, landscapes and lives: The tales of Nusantara Black and White of RI Fiesta of Democracy Silent, invisible danger on Cirebon coast Some 5.7 tonnes of shrimp contaminated with Cesium 137 disposed InterContinental Bali Resort introduces restorative Silent Retreat BPJS Kesehatan ends 2024 with prestigious international awards Love unveiled at Adriana Cocina & Bar: A new Mexican rooftop experience in Bali Get the latest news in your inbox",
    "negative_score": 46,
    "sentiment_score": 0.9337,
    "is_negative": true,
    "source": "jakartapost_business",
    "processed_at": "2026-02-18T04:17:23.103169"
  },
  {
    "title": "",
    "url": "http://www.thejakartapost.com/business/markets",
    "published_date": "",
    "summary": "Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers An employee displays US dollar banknotes at Bank Syariah Indonesia in South Tangerang, Banten, on Jan. 21, 2026. Dollar holds gains in thin trading as markets await Fed minutes, US GDP The dollar held gains on Tuesday as markets awaited signals, expected later this week, about the potential timing of rate cuts by the Federal Reserve. Get the latest news in your inbox Asian markets sluggish as Lunar New Year holiday looms Asian markets were subdued on Monday, as the extended Lunar New Year holiday approached and Japan reported lackluster economic growth. ... Asian shares step back from record as tech jitters return, bonds rally Asian shares retreated from record highs on Friday as worries about shrinking margins in the tech sector hit the likes of Apple, driving investors into safe-haven bonds ahead of key US inflation data. ... Gold edges lower on firmer dollar after strong US jobs data Gold prices dipped on Thursday, as the U.S. dollar firmed after stronger-than-expected January jobs data dented expectation for near-term interest rate cuts, while investors awaited inflation data due on Friday for more monetary policy cues. Danantara’s IDX ownership plan gets guarded welcome Danantara CEO Rosan Roeslani pointed out that it is common practice for sovereign wealth funds (SWFs) to hold stakes in bourses, typically ranging from 15 percent to 30 percent. Buoyant stocks pause for breath on signs of softening US consumption Bonds jumped and a rebound in stock markets slowed down on Wednesday after softer-than-expected US retail sales figures, while a rally in the yen has extended and might be beginning to signal a shift in investor thinking since Japan's election. FTSE Russell postpones Indonesia index review Asian markets rally as Japan shares surge to record peak Nikkei jumped 4.2 percent to all-time highs as the government's decisive majority after the election clears the way for more spending and tax cuts. Indonesian markets slide again after Moody's cuts outlook Stocks dive, silver and cryptos look for cover after rout Global stocks extended losses into a third day on Friday as a selloff on Wall Street intensified, leaving investors dazed as wrenching volatility gripped precious metals and cryptocurrencies. Stocks in retreat as traders reconsider tech investment Asian stocks fell Thursday to track more losses on Wall Street, where tech firms were again under pressure as fears over vast AI investments and extended valuations gained momentum. India's January palm oil imports hit four-month high as buyers cut soy oil purchases Higher palm oil imports by India, the world's largest buyer of vegetable oils, could help reduce inventories in top producers Indonesia and Malaysia, supporting benchmark Malaysian palm oil futures, while pressuring US soy oil futures. Equities, metals, oil rebound after Asia-wide rout Stocks rallied while precious metals and crude rebounded as some stability returned Tuesday following a rout fueled by a perfect storm that sent shivers through across Asian trading floors. Stocks plunge again as doubts persist over reform plan Indonesian shares plunged again on Monday, showing that a leadership shakeup at stock market institutions and government assurances about planned reforms have not allayed investor concerns. Oil tumbles on Iran hopes, precious metals hit by stronger dollar Oil prices tanked Monday on easing US-Iran tensions while precious metals swung wildly following last week's dollar-fueled collapse sparked by Donald Trump's hawkish pick to lead the Federal Reserve. Asian stocks hit by fresh tech fears as gold retreats from peak What is MSCI and what has it done to Indonesia's stock market? Goldman Sachs estimates that foreign investor outflow could reach $7.8 billion if Indonesia is downgraded to frontier market, a scenario the investment bank and some investors deem unlikely. Indonesia stocks tank as downgrade risk triggers capital flight MSCI's warning is the latest setback for Southeast Asia's largest economy as foreign capital flows out due to concerns about how President Prabowo Subianto is widening the fiscal deficit and ramping up the state's involvement in financial markets. IDX halts trading again as stocks plunge further The Indonesia Stock Exchange (IDX) Composite index has nosedived for a second day in a row due to investability flags from Morgan Stanley Capital International (MSCI), prompting another trading halt. IDX plunges after MSCI warning about RI stocks The Indonesia Stock Exchange (IDX) temporarily halted trading on Wednesday after shares plunged on a warning from global index provider MSCI that it could downgrade Indonesian stocks to frontier-market status. Dollar reels near four-year low after blow from Trump comments As investors have grown increasingly nervous about their exposure to US assets, other currencies and gold have shot up in the past couple of weeks. IDX Composite index nosedives at open The Indonesia Stock Exchange (IDX) Composite index nosedived as trading opened on Wednesday following an evaluation by Morgan Stanley Capital International (MSCI) that flags Indonesian stocks. How coal production cuts affect Indonesia’s economy The coal sector to come under further pressure this year, as the correction in coal prices is likely to continue in line with a deeper decline in Indonesia’s coal production. Stocks up as earnings hopes offset Trump's Korea tariff move, dollar wobbles Asian shares advanced on Tuesday as investors hoped for the best from a barrage of US mega-cap earnings, though uncertainty caused by President Donald Trump’s latest tariff moves on South Korea limited broader gains while boosting gold and silver. Yen surges as intervention risks lurk, gold surpasses $5,000 Gold surged past US$5,000 per ounce early on Monday following a turbulent week where tensions over Greenland and Iran rattled sentiment, while markets remained on tenterhooks after a rout in bonds and violent spikes in the yen. Gold nears $5,000, stocks muted after turbulent week Stocks were subdued and precious metals hit fresh highs Friday after a turbulent week that saw US President Donald Trump back down from threats to seize Greenland and to issue tariffs against European allies. Industry urges palm oil output boost amid biodiesel uncertainty Implementing B50 amid stagnant production could trigger a sharp rise in CPO prices and derivative products such as cooking oil, as well as reduce export volumes. RI bond yield spikes on BI independence worries, uncertainty The yield on Indonesian government bonds has climbed to its highest level in more than three months on the back of general uncertainty, fiscal worries and concerns about the independence of Bank Indonesia (BI) following the nomination of Thomas “Tommy” Djiwandono as deputy governor. Japan should respond 'decisively' to bond sell-off, opposition head says Japan should act decisively against excessive market moves, Yuichiro Tamaki, head of an influential opposition party, told Reuters on Wednesday, after a brutal sell-off of Japanese government bonds sent a chill through global financial markets. Stocks stable after tariff-fueled selloff but uncertainty boosts gold Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Legacy, landscapes and lives: The tales of Nusantara Black and White of RI Fiesta of Democracy Silent, invisible danger on Cirebon coast Some 5.7 tonnes of shrimp contaminated with Cesium 137 disposed InterContinental Bali Resort introduces restorative Silent Retreat BPJS Kesehatan ends 2024 with prestigious international awards Love unveiled at Adriana Cocina & Bar: A new Mexican rooftop experience in Bali Get the latest news in your inbox",
    "category": "company",
    "author": "",
    "content": "Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers An employee displays US dollar banknotes at Bank Syariah Indonesia in South Tangerang, Banten, on Jan. 21, 2026. Dollar holds gains in thin trading as markets await Fed minutes, US GDP The dollar held gains on Tuesday as markets awaited signals, expected later this week, about the potential timing of rate cuts by the Federal Reserve. Get the latest news in your inbox Asian markets sluggish as Lunar New Year holiday looms Asian markets were subdued on Monday, as the extended Lunar New Year holiday approached and Japan reported lackluster economic growth. ... Asian shares step back from record as tech jitters return, bonds rally Asian shares retreated from record highs on Friday as worries about shrinking margins in the tech sector hit the likes of Apple, driving investors into safe-haven bonds ahead of key US inflation data. ... Gold edges lower on firmer dollar after strong US jobs data Gold prices dipped on Thursday, as the U.S. dollar firmed after stronger-than-expected January jobs data dented expectation for near-term interest rate cuts, while investors awaited inflation data due on Friday for more monetary policy cues. Danantara’s IDX ownership plan gets guarded welcome Danantara CEO Rosan Roeslani pointed out that it is common practice for sovereign wealth funds (SWFs) to hold stakes in bourses, typically ranging from 15 percent to 30 percent. Buoyant stocks pause for breath on signs of softening US consumption Bonds jumped and a rebound in stock markets slowed down on Wednesday after softer-than-expected US retail sales figures, while a rally in the yen has extended and might be beginning to signal a shift in investor thinking since Japan's election. FTSE Russell postpones Indonesia index review Asian markets rally as Japan shares surge to record peak Nikkei jumped 4.2 percent to all-time highs as the government's decisive majority after the election clears the way for more spending and tax cuts. Indonesian markets slide again after Moody's cuts outlook Stocks dive, silver and cryptos look for cover after rout Global stocks extended losses into a third day on Friday as a selloff on Wall Street intensified, leaving investors dazed as wrenching volatility gripped precious metals and cryptocurrencies. Stocks in retreat as traders reconsider tech investment Asian stocks fell Thursday to track more losses on Wall Street, where tech firms were again under pressure as fears over vast AI investments and extended valuations gained momentum. India's January palm oil imports hit four-month high as buyers cut soy oil purchases Higher palm oil imports by India, the world's largest buyer of vegetable oils, could help reduce inventories in top producers Indonesia and Malaysia, supporting benchmark Malaysian palm oil futures, while pressuring US soy oil futures. Equities, metals, oil rebound after Asia-wide rout Stocks rallied while precious metals and crude rebounded as some stability returned Tuesday following a rout fueled by a perfect storm that sent shivers through across Asian trading floors. Stocks plunge again as doubts persist over reform plan Indonesian shares plunged again on Monday, showing that a leadership shakeup at stock market institutions and government assurances about planned reforms have not allayed investor concerns. Oil tumbles on Iran hopes, precious metals hit by stronger dollar Oil prices tanked Monday on easing US-Iran tensions while precious metals swung wildly following last week's dollar-fueled collapse sparked by Donald Trump's hawkish pick to lead the Federal Reserve. Asian stocks hit by fresh tech fears as gold retreats from peak What is MSCI and what has it done to Indonesia's stock market? Goldman Sachs estimates that foreign investor outflow could reach $7.8 billion if Indonesia is downgraded to frontier market, a scenario the investment bank and some investors deem unlikely. Indonesia stocks tank as downgrade risk triggers capital flight MSCI's warning is the latest setback for Southeast Asia's largest economy as foreign capital flows out due to concerns about how President Prabowo Subianto is widening the fiscal deficit and ramping up the state's involvement in financial markets. IDX halts trading again as stocks plunge further The Indonesia Stock Exchange (IDX) Composite index has nosedived for a second day in a row due to investability flags from Morgan Stanley Capital International (MSCI), prompting another trading halt. IDX plunges after MSCI warning about RI stocks The Indonesia Stock Exchange (IDX) temporarily halted trading on Wednesday after shares plunged on a warning from global index provider MSCI that it could downgrade Indonesian stocks to frontier-market status. Dollar reels near four-year low after blow from Trump comments As investors have grown increasingly nervous about their exposure to US assets, other currencies and gold have shot up in the past couple of weeks. IDX Composite index nosedives at open The Indonesia Stock Exchange (IDX) Composite index nosedived as trading opened on Wednesday following an evaluation by Morgan Stanley Capital International (MSCI) that flags Indonesian stocks. How coal production cuts affect Indonesia’s economy The coal sector to come under further pressure this year, as the correction in coal prices is likely to continue in line with a deeper decline in Indonesia’s coal production. Stocks up as earnings hopes offset Trump's Korea tariff move, dollar wobbles Asian shares advanced on Tuesday as investors hoped for the best from a barrage of US mega-cap earnings, though uncertainty caused by President Donald Trump’s latest tariff moves on South Korea limited broader gains while boosting gold and silver. Yen surges as intervention risks lurk, gold surpasses $5,000 Gold surged past US$5,000 per ounce early on Monday following a turbulent week where tensions over Greenland and Iran rattled sentiment, while markets remained on tenterhooks after a rout in bonds and violent spikes in the yen. Gold nears $5,000, stocks muted after turbulent week Stocks were subdued and precious metals hit fresh highs Friday after a turbulent week that saw US President Donald Trump back down from threats to seize Greenland and to issue tariffs against European allies. Industry urges palm oil output boost amid biodiesel uncertainty Implementing B50 amid stagnant production could trigger a sharp rise in CPO prices and derivative products such as cooking oil, as well as reduce export volumes. RI bond yield spikes on BI independence worries, uncertainty The yield on Indonesian government bonds has climbed to its highest level in more than three months on the back of general uncertainty, fiscal worries and concerns about the independence of Bank Indonesia (BI) following the nomination of Thomas “Tommy” Djiwandono as deputy governor. Japan should respond 'decisively' to bond sell-off, opposition head says Japan should act decisively against excessive market moves, Yuichiro Tamaki, head of an influential opposition party, told Reuters on Wednesday, after a brutal sell-off of Japanese government bonds sent a chill through global financial markets. Stocks stable after tariff-fueled selloff but uncertainty boosts gold Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Legacy, landscapes and lives: The tales of Nusantara Black and White of RI Fiesta of Democracy Silent, invisible danger on Cirebon coast Some 5.7 tonnes of shrimp contaminated with Cesium 137 disposed InterContinental Bali Resort introduces restorative Silent Retreat BPJS Kesehatan ends 2024 with prestigious international awards Love unveiled at Adriana Cocina & Bar: A new Mexican rooftop experience in Bali Get the latest news in your inbox",
    "negative_score": 36,
    "sentiment_score": 0.9893,
    "is_negative": true,
    "source": "jakartapost_business",
    "processed_at": "2026-02-18T04:17:23.159610"
  },
  {
    "title": "",
    "url": "https://www.thejakartapost.com/business/2026/02/15/vietnam-licenses-musks-satellite-internet-firm-starlink.html",
    "published_date": "",
    "summary": "Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Vietnam licenses Musk's satellite internet firm Starlink Published on 2026-02-15T13:54:12+07:00 http://www.thejakartapost.com/business/2026/02/15/vietnam-licenses-musks-satellite-internet-firm-starlink.html A woman rides a bicycle in front of an electric bus on the street in Hanoi on Nov. 21, 2025. (AFP/Nhac Nguyen) ietnam has granted a license to Elon Musk's Starlink to operate its satellite internet services in the communist country, a government agency said. The radio frequency regulator said local unit Starlink Services Vietnam Co. can initially deploy four gateway stations and a maximum of 600,000 terminal devices in Vietnam. The licensing requires Starlink to ensure \"no interference with existing radio communication networks\", the Radio Frequency Management authority announced on Saturday. The Starlink system would contribute to \"expanding satellite internet connectivity\" in the country, it added. Starlink provides high-speed internet access to remote locations around the world via thousands of low Earth orbit satellites. Nearly 80 percent of Vietnam's around 100 million people are internet users, according to the Vietnam Internet Network Information Center. With exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape. By registering, you agree with for signing up our newsletter! Please check your email for your newsletter subscription. But gaps in access to internet service remain in rural and mountainous areas. Parent company SpaceX, founded by the world's wealthiest person, Elon Musk, did not immediately reply to a request for comment from AFP on Sunday. US-based Starlink says its services in Vietnam are \"coming soon\", according to an availability map on its website. Vietnam and the United States are in the process of negotiating a trade deal after Washington imposed 20 percent tariffs on Vietnamese goods last year. The two countries held a sixth round of talks this month, but have not reached a final agreement. Vietnam's top leader To Lam will travel to the United States this week for a meeting of President Donald Trump's \"Board of Peace\", two sources briefed on the visit told AFP last week. The board, of which Trump is the chairman, was originally intended to oversee the rebuilding of the Gaza Strip after two years of war, but its charter appears to extend beyond the Palestinian territory. The first meeting is scheduled to take place on Feb. 19 in Washington. It was not clear if Communist Party General Secretary Lam would also hold trade talks with Trump. Vietnam's government has not confirmed or publicly announced the trip. The Southeast Asian manufacturing hub recorded 8.0 percent growth last year despite the US levies many feared would crush its export-oriented growth model. Hanoi is targeting double-digit growth this year. Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund Musk's Starlink updates privacy policy to allow consumer data to train AI The House must act on the Indonesia–Vietnam EEZ deal Musk's Starlink updates privacy policy to allow consumer data to train AI The House must act on the Indonesia–Vietnam EEZ deal A generation under surveillance is rising up Teachers and the shifting realities of classrooms Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund Trump says Japan to invest in energy, industrial projects in Ohio, Texas and Georgia Govt urged not to compromise too much for US trade deal Unlocking regional potential to boost economic growth Indonesia ramps up UN talks ahead of Board of Peace meeting Govt urged not to compromise too much for US trade deal Indonesia, BRICS and the rise of the Global South Indonesia, BRICS and the rise of the Global South Indonesia, BRICS and the rise of the Global South Trump says Japan to invest in energy, industrial projects in Ohio, Texas and Georgia From the US-led rules-based order to multipolar international law Balancing the blaze at home: Blue in the year of fire horse Bima police chief, subordinates arrested for drug trafficking Those who most need to understand AI don't get it Get the latest news in your inbox",
    "category": "company",
    "author": "",
    "content": "Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Vietnam licenses Musk's satellite internet firm Starlink Published on 2026-02-15T13:54:12+07:00 http://www.thejakartapost.com/business/2026/02/15/vietnam-licenses-musks-satellite-internet-firm-starlink.html A woman rides a bicycle in front of an electric bus on the street in Hanoi on Nov. 21, 2025. (AFP/Nhac Nguyen) ietnam has granted a license to Elon Musk's Starlink to operate its satellite internet services in the communist country, a government agency said. The radio frequency regulator said local unit Starlink Services Vietnam Co. can initially deploy four gateway stations and a maximum of 600,000 terminal devices in Vietnam. The licensing requires Starlink to ensure \"no interference with existing radio communication networks\", the Radio Frequency Management authority announced on Saturday. The Starlink system would contribute to \"expanding satellite internet connectivity\" in the country, it added. Starlink provides high-speed internet access to remote locations around the world via thousands of low Earth orbit satellites. Nearly 80 percent of Vietnam's around 100 million people are internet users, according to the Vietnam Internet Network Information Center. With exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape. By registering, you agree with for signing up our newsletter! Please check your email for your newsletter subscription. But gaps in access to internet service remain in rural and mountainous areas. Parent company SpaceX, founded by the world's wealthiest person, Elon Musk, did not immediately reply to a request for comment from AFP on Sunday. US-based Starlink says its services in Vietnam are \"coming soon\", according to an availability map on its website. Vietnam and the United States are in the process of negotiating a trade deal after Washington imposed 20 percent tariffs on Vietnamese goods last year. The two countries held a sixth round of talks this month, but have not reached a final agreement. Vietnam's top leader To Lam will travel to the United States this week for a meeting of President Donald Trump's \"Board of Peace\", two sources briefed on the visit told AFP last week. The board, of which Trump is the chairman, was originally intended to oversee the rebuilding of the Gaza Strip after two years of war, but its charter appears to extend beyond the Palestinian territory. The first meeting is scheduled to take place on Feb. 19 in Washington. It was not clear if Communist Party General Secretary Lam would also hold trade talks with Trump. Vietnam's government has not confirmed or publicly announced the trip. The Southeast Asian manufacturing hub recorded 8.0 percent growth last year despite the US levies many feared would crush its export-oriented growth model. Hanoi is targeting double-digit growth this year. Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund Musk's Starlink updates privacy policy to allow consumer data to train AI The House must act on the Indonesia–Vietnam EEZ deal Musk's Starlink updates privacy policy to allow consumer data to train AI The House must act on the Indonesia–Vietnam EEZ deal A generation under surveillance is rising up Teachers and the shifting realities of classrooms Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund Trump says Japan to invest in energy, industrial projects in Ohio, Texas and Georgia Govt urged not to compromise too much for US trade deal Unlocking regional potential to boost economic growth Indonesia ramps up UN talks ahead of Board of Peace meeting Govt urged not to compromise too much for US trade deal Indonesia, BRICS and the rise of the Global South Indonesia, BRICS and the rise of the Global South Indonesia, BRICS and the rise of the Global South Trump says Japan to invest in energy, industrial projects in Ohio, Texas and Georgia From the US-led rules-based order to multipolar international law Balancing the blaze at home: Blue in the year of fire horse Bima police chief, subordinates arrested for drug trafficking Those who most need to understand AI don't get it Get the latest news in your inbox",
    "negative_score": 12,
    "sentiment_score": 0.9865,
    "is_negative": true,
    "source": "jakartapost_business",
    "processed_at": "2026-02-18T04:17:23.177032"
  },
  {
    "title": "",
    "url": "https://www.thejakartapost.com/business/companies",
    "published_date": "",
    "summary": "Vietnam licenses Musk's satellite internet firm Starlink Vietnam has granted a license to Elon Musk's Starlink to operate its satellite internet services in the communist country, a government agency said. A woman rides a bicycle in front of an electric bus on the street in Hanoi on Nov. 21, 2025. Tiffany & Co stores sealed over alleged illegal imports Danantara’s poultry push raises concerns over market distortion Pertamina to spin off airlines, hospitals, non-oil units this year The 2024 banking industry outlook There are two situations in 2024 that will affect the condition of national banking; first, the general election; second, indications of a weakening global economy. Tuksedo gives cars from the past a brand-new future A family-owned workshop in Bali recreates classic cars for discerning customers and is now looking to include EV options. Indonesia, ExxonMobil sign agreement on CCS, petrochemical projects The government, along with state-owned oil and gas corporation Pertamina, inked two agreements with United States oil and gas giant ExxonMobil pertaining to advancing the progress on carbon capture storage (CCS) projects and exploring a potential petrochemical complex in Indonesia. From Frenchie to fortune: Kurobokan spotlights Indonesia-designed toys With quirky collectibles, Kurobokan puts Indonesia on the map in the so-called kidult market, proving that toys are for everyone, no matter their age. Indosat Ooredoo Hutchison shows healthy fundamentals in 2025 with 12.2% net profit growth Indosat Ooredoo Hutchison (ISAT) demonstrated robust performance throughout 2025, recording revenue of Rp 56.5 trillion (US$3.37 billion) in addition to double-digit profit growth of 12.2 percent year-on-year (yoy) and 51 percent quarter-on-quarter (qoq) to Rp 5.5 trillion. PLN EPI breaks ground on Rp1 trillion gas pipeline PLN EPI breaks ground on Rp1 trillion gas pipeline PT PLN Energi Primer Indonesia has begun the construction of a Rp 1 trillion (US$59.57 million) gas pipeline linking the West Natuna Transportation System (WNTS) to Pemping Island, Batam. Finance Ministry’s SMI secures $9.3m grants to expand green finance PT SMI operates as a development finance institution providing corporate and public financing alongside project advisory and preparation services. Danantara breaks ground on $7b downstream industry projects The projects, launched simultaneously across 13 regions on Friday, are fully funded from Danantara’s internal resources and are expected to create about 6,000 direct jobs, the fund said in a statement. Cloud, AI services to boost Indonesia’s economy, Microsoft says Backed by a US$1.7 billion investment through 2028, Microsoft aims to build Indonesia’s digital economy by expanding cloud and AI infrastructure, strengthening the developer ecosystem and training 500,000 AI-ready talents by 2026. Bosch goes new ways with modular factory in West Java Indonesia ‘impatient’ in tech adoption, Infor says GE HealthCare eyes Indonesia as regional hub for medical device exports Bali’s Nuanu seeks investors that look beyond profit Executive Column: Being a small bank makes no sense, says KBank FLSmidth sees energy transition driving global minerals demand Bali Waste Cycle aims to scale up to make recycling profitable Born out of Bali’s growing trash problem, Bali Waste Cycle (BWC) seeks to expand its business, balancing profit, purpose and sustainability. Oaken Lab brings fresh scent to Indonesia’s perfume market Oaken Lab brings fresh scent to Indonesia’s perfume market Coffee chain Tuku seeks perfect blend for expansion Studio Ubud awakens Indonesian anime Teck Seng Ho: Understanding client needs crucial for sustaining Sun Life Indonesia Newly appointed Sun Life Indonesia president director Teck Seng Ho has expressed positivity about the company’s client-friendly work environment. Leading Indosat's growth to empower Indonesia, Vikram Sinha named 2023 CEO of the Year Indosat Ooredoo Hutchison (Indosat) continues to record splendid operational and financial performances following its recent merger. Embracing the spirit of Gotong Royong, Indosat has a greater goal of empowering Indonesia. Securing Indonesians’ future through innovation, teamwork PT Asuransi Allianz Life Indonesia has recently appointed Alexander Grenz as Country Manager and President Director of Allianz Life Indonesia. After obtaining a permit from the Financial Services Authority (OJK), he took the role on April 7, where he will be managing Allianz's operational activities Melissa Siska Juminto and the journey of growth and excellence In an age of instant gratification, trusting the process has become somewhat of a rare quality. This is not the case for Melissa Siska Juminto. Get the latest news in your inbox",
    "category": "company",
    "author": "",
    "content": "Vietnam licenses Musk's satellite internet firm Starlink Vietnam has granted a license to Elon Musk's Starlink to operate its satellite internet services in the communist country, a government agency said. A woman rides a bicycle in front of an electric bus on the street in Hanoi on Nov. 21, 2025. Tiffany & Co stores sealed over alleged illegal imports Danantara’s poultry push raises concerns over market distortion Pertamina to spin off airlines, hospitals, non-oil units this year The 2024 banking industry outlook There are two situations in 2024 that will affect the condition of national banking; first, the general election; second, indications of a weakening global economy. Tuksedo gives cars from the past a brand-new future A family-owned workshop in Bali recreates classic cars for discerning customers and is now looking to include EV options. Indonesia, ExxonMobil sign agreement on CCS, petrochemical projects The government, along with state-owned oil and gas corporation Pertamina, inked two agreements with United States oil and gas giant ExxonMobil pertaining to advancing the progress on carbon capture storage (CCS) projects and exploring a potential petrochemical complex in Indonesia. From Frenchie to fortune: Kurobokan spotlights Indonesia-designed toys With quirky collectibles, Kurobokan puts Indonesia on the map in the so-called kidult market, proving that toys are for everyone, no matter their age. Indosat Ooredoo Hutchison shows healthy fundamentals in 2025 with 12.2% net profit growth Indosat Ooredoo Hutchison (ISAT) demonstrated robust performance throughout 2025, recording revenue of Rp 56.5 trillion (US$3.37 billion) in addition to double-digit profit growth of 12.2 percent year-on-year (yoy) and 51 percent quarter-on-quarter (qoq) to Rp 5.5 trillion. PLN EPI breaks ground on Rp1 trillion gas pipeline PLN EPI breaks ground on Rp1 trillion gas pipeline PT PLN Energi Primer Indonesia has begun the construction of a Rp 1 trillion (US$59.57 million) gas pipeline linking the West Natuna Transportation System (WNTS) to Pemping Island, Batam. Finance Ministry’s SMI secures $9.3m grants to expand green finance PT SMI operates as a development finance institution providing corporate and public financing alongside project advisory and preparation services. Danantara breaks ground on $7b downstream industry projects The projects, launched simultaneously across 13 regions on Friday, are fully funded from Danantara’s internal resources and are expected to create about 6,000 direct jobs, the fund said in a statement. Cloud, AI services to boost Indonesia’s economy, Microsoft says Backed by a US$1.7 billion investment through 2028, Microsoft aims to build Indonesia’s digital economy by expanding cloud and AI infrastructure, strengthening the developer ecosystem and training 500,000 AI-ready talents by 2026. Bosch goes new ways with modular factory in West Java Indonesia ‘impatient’ in tech adoption, Infor says GE HealthCare eyes Indonesia as regional hub for medical device exports Bali’s Nuanu seeks investors that look beyond profit Executive Column: Being a small bank makes no sense, says KBank FLSmidth sees energy transition driving global minerals demand Bali Waste Cycle aims to scale up to make recycling profitable Born out of Bali’s growing trash problem, Bali Waste Cycle (BWC) seeks to expand its business, balancing profit, purpose and sustainability. Oaken Lab brings fresh scent to Indonesia’s perfume market Oaken Lab brings fresh scent to Indonesia’s perfume market Coffee chain Tuku seeks perfect blend for expansion Studio Ubud awakens Indonesian anime Teck Seng Ho: Understanding client needs crucial for sustaining Sun Life Indonesia Newly appointed Sun Life Indonesia president director Teck Seng Ho has expressed positivity about the company’s client-friendly work environment. Leading Indosat's growth to empower Indonesia, Vikram Sinha named 2023 CEO of the Year Indosat Ooredoo Hutchison (Indosat) continues to record splendid operational and financial performances following its recent merger. Embracing the spirit of Gotong Royong, Indosat has a greater goal of empowering Indonesia. Securing Indonesians’ future through innovation, teamwork PT Asuransi Allianz Life Indonesia has recently appointed Alexander Grenz as Country Manager and President Director of Allianz Life Indonesia. After obtaining a permit from the Financial Services Authority (OJK), he took the role on April 7, where he will be managing Allianz's operational activities Melissa Siska Juminto and the journey of growth and excellence In an age of instant gratification, trusting the process has become somewhat of a rare quality. This is not the case for Melissa Siska Juminto. Get the latest news in your inbox",
    "negative_score": 0,
    "sentiment_score": 0.9973,
    "is_negative": false,
    "source": "jakartapost_business",
    "processed_at": "2026-02-18T04:17:23.193059"
  },
  {
    "title": "",
    "url": "http://www.thejakartapost.com/index.php/business/tech",
    "published_date": "",
    "summary": "Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Police stand guard at the Bharat Mandapam on the eve of the 'India AI Impact Summit 2026' in New Delhi on Feb. 15, 2026. Job threats, rogue bots: five hot issues in AI As artificial intelligence evolves at a blistering pace, world leaders and thousands of other delegates will discuss how to handle the technology at the AI Impact Summit, which opens Monday in New Delhi. Get the latest news in your inbox Some technology firms deliberately avoid using personally identifiable information in their AI models to reduce compliance risks, despite the limitations this places on their ability to improve operational efficiency. ... China’s ByteDance releases Doubao 2.0 AI model for 'agent era' China's ByteDance has rolled out its Doubao 2.0 model, an upgrade of the country's most widely used artificial-intelligence app, the company said on Saturday. ... Jury told that Meta, Google 'engineered addiction' at landmark US trial Meta and Google-owned YouTube were accused Monday of pushing highly addictive apps on children as a landmark social media trial began in earnest in a California court. Crypto firm accidentally sends $40 billion in bitcoin to users According to local reports, Bithumb was meant to send about 2,000 won (US$1.37) to each customer as part of a promotion, but mistakenly transferred roughly 2,000 bitcoins per user. IT companies collaborate to support digital transformation in Indonesia The collaboration is expected to push digital innovation and ensure the safety, scalability and performance of organizations in Indonesia. Musk's Starlink updates privacy policy to allow consumer data to train AI Starlink collects vast amounts of user data, spanning location information, credit card information, contact information and user IP addresses. Indonesia logs $1b food delivery growth, region’s highest Up 18 percent in a year, Indonesia’s US$1 billion gross merchandise value (GMV) growth is the highest in the region. Visa-processing startup Spun bags $1.8m for regional expansion The company operates a platform that processes inbound and outbound visa applications using AI-enabled systems. India's central bank proposes linking BRICS' digital currencies, sources say India's central bank has proposed that BRICS countries link their official digital currencies to make cross-border trade and tourism payments easier, two sources said, which could reduce reliance on the US dollar as geopolitical tensions rise. Social media sites block 4.7 million underage accounts in Australia Initial figures showed platforms were taking meaningful action to remove underage users, Australia's eSafety Commissioner Julie Inman Grant said. Musk dealt blow over Grok deepfakes, but regulatory fight far from over The climb-down by Musk, who initially laughed off the trend, highlights the difficulty of policing AI tools that make it cheap and easy to create explicit content. It is the latest clash between Europe and Musk, following rows over election interference, content moderation and free speech. Indonesia tumbles in cybersecurity ranking Experts have called for a change in thinking among business leaders and regulators after Indonesia plummeted from position 48 to 84 in a global ranking of countries for cybersecurity. Elon Musk's Grok faces global scrutiny for sexualized AI deepfakes X says it takes action against illegal content on the platform, including child sexual abuse material, by removing it, permanently suspending accounts, and working with local governments and law enforcement as necessary. OJK threatens ‘corrective measures’ as P2P defaults rise The default rate of peer-to-peer lending in the fintech industry has worsened, with the ratio of 90 days past due (TWP90) loans to total loans standing at 4.33 percent in November, up from 2.52 percent in November 2024, according to Financial Authority Services (OJK) data. Musk's Grok under fire over sexualized images despite new limits Grok has faced global backlash after it emerged the feature allowed users to sexualize images of women and children using simple text prompts such as \"put her in a bikini\" or \"remove her clothes.\" Grok under fire after complaints it undressed minors in photos The \"Edit Image\" button feature first rolled out in late December on Grok allows users to modify any image on the platform, with some users deciding to partially or completely remove clothing from women or children in pictures, according to complaints. Start-up scandals in 2025 force investors to raise the bar, change playbooks From the unravelling of eFishery saga to corruption probes ensnaring venture capital executives tied to state-backed funding at TaniHub, the year stripped the gloss from Southeast Asia’s most coveted start-up market. TSMC says started mass production of 'most advanced' 2nm chips Taiwanese tech titan TSMC has started mass producing its cutting-edge 2-nanometer semiconductor chips, the company said in a statement seen by AFP on Wednesday. How China built its ‘Manhattan Project’ to rival the West in AI chips In a high-security Shenzhen laboratory, Chinese scientists have built what Washington has spent years trying to prevent: a prototype of a machine capable of producing the cutting-edge semiconductor chips that power artificial intelligence, smartphones and weapons central to Western military dominance. US threatens countermeasures on European service providers after EU fines President Donald Trump's administration warned on Tuesday the United States could impose fees or restrictions on European service providers in response to what it called “discriminatory” actions against US firms. China's smaller manufacturers look to catch the automation wave In a light-filled workshop in eastern China, a robotic arm moved a partially assembled autonomous vehicle as workers calibrated its cameras, typical of the incremental automation being adopted even across smaller factories in the world's manufacturing powerhouse. Google to build subsea cables in PNG under Australia defense treaty The $120-million effort will link northern and southern Papua New Guinea and the Bougainville autonomous region with high-capacity cables, Peter Tsiamalili, PNG's acting minister for information and communications technology, said on Friday. Aftech's Mandiri BFN Fest aims to boost trust in fintech The festival, which runs from Dec. 10 to 11 and is free to all visitors, aims to increase public trust in the fintech industry toward better, sustainable economic growth. Oil-rich UAE turns to AI to grease economy Deep in the Abu Dhabi desert, a vast AI campus a quarter the size of Paris is starting to emerge, the oil-rich UAE's boldest bet yet on technology it hopes will help transform its economy. Robinhood to enter RI with broker, crypto trader acquisitions Founded in California in 2013, Robinhood shot to fame during the social-media-fueled retail-trading frenzy of 2021 and gained broader market legitimacy this year after joining the United States benchmark S&P 500 index. X gets $140 million EU fine for breaching content rules but TikTok settles Elon Musk's social media company X was fined 120 million euros (US$140 million) by EU tech regulators on Friday for breaching online content rules, the first sanction under landmark legislation that once again drew criticism from the US government. Meta partners with news outlets to expand AI content The expansion aims to make its AI assistant \"more responsive, accurate, and balanced\" by incorporating diverse viewpoints, acknowledging that \"real-time events can be challenging for current AI systems to keep up with.\" EU hits Meta with antitrust probe over plans to block AI rivals from WhatsApp Indonesia racks up $2.6b in digital taxes since 2020 Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Legacy, landscapes and lives: The tales of Nusantara Black and White of RI Fiesta of Democracy Silent, invisible danger on Cirebon coast Some 5.7 tonnes of shrimp contaminated with Cesium 137 disposed InterContinental Bali Resort introduces restorative Silent Retreat BPJS Kesehatan ends 2024 with prestigious international awards Love unveiled at Adriana Cocina & Bar: A new Mexican rooftop experience in Bali Get the latest news in your inbox",
    "category": "market",
    "author": "",
    "content": "Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Police stand guard at the Bharat Mandapam on the eve of the 'India AI Impact Summit 2026' in New Delhi on Feb. 15, 2026. Job threats, rogue bots: five hot issues in AI As artificial intelligence evolves at a blistering pace, world leaders and thousands of other delegates will discuss how to handle the technology at the AI Impact Summit, which opens Monday in New Delhi. Get the latest news in your inbox Some technology firms deliberately avoid using personally identifiable information in their AI models to reduce compliance risks, despite the limitations this places on their ability to improve operational efficiency. ... China’s ByteDance releases Doubao 2.0 AI model for 'agent era' China's ByteDance has rolled out its Doubao 2.0 model, an upgrade of the country's most widely used artificial-intelligence app, the company said on Saturday. ... Jury told that Meta, Google 'engineered addiction' at landmark US trial Meta and Google-owned YouTube were accused Monday of pushing highly addictive apps on children as a landmark social media trial began in earnest in a California court. Crypto firm accidentally sends $40 billion in bitcoin to users According to local reports, Bithumb was meant to send about 2,000 won (US$1.37) to each customer as part of a promotion, but mistakenly transferred roughly 2,000 bitcoins per user. IT companies collaborate to support digital transformation in Indonesia The collaboration is expected to push digital innovation and ensure the safety, scalability and performance of organizations in Indonesia. Musk's Starlink updates privacy policy to allow consumer data to train AI Starlink collects vast amounts of user data, spanning location information, credit card information, contact information and user IP addresses. Indonesia logs $1b food delivery growth, region’s highest Up 18 percent in a year, Indonesia’s US$1 billion gross merchandise value (GMV) growth is the highest in the region. Visa-processing startup Spun bags $1.8m for regional expansion The company operates a platform that processes inbound and outbound visa applications using AI-enabled systems. India's central bank proposes linking BRICS' digital currencies, sources say India's central bank has proposed that BRICS countries link their official digital currencies to make cross-border trade and tourism payments easier, two sources said, which could reduce reliance on the US dollar as geopolitical tensions rise. Social media sites block 4.7 million underage accounts in Australia Initial figures showed platforms were taking meaningful action to remove underage users, Australia's eSafety Commissioner Julie Inman Grant said. Musk dealt blow over Grok deepfakes, but regulatory fight far from over The climb-down by Musk, who initially laughed off the trend, highlights the difficulty of policing AI tools that make it cheap and easy to create explicit content. It is the latest clash between Europe and Musk, following rows over election interference, content moderation and free speech. Indonesia tumbles in cybersecurity ranking Experts have called for a change in thinking among business leaders and regulators after Indonesia plummeted from position 48 to 84 in a global ranking of countries for cybersecurity. Elon Musk's Grok faces global scrutiny for sexualized AI deepfakes X says it takes action against illegal content on the platform, including child sexual abuse material, by removing it, permanently suspending accounts, and working with local governments and law enforcement as necessary. OJK threatens ‘corrective measures’ as P2P defaults rise The default rate of peer-to-peer lending in the fintech industry has worsened, with the ratio of 90 days past due (TWP90) loans to total loans standing at 4.33 percent in November, up from 2.52 percent in November 2024, according to Financial Authority Services (OJK) data. Musk's Grok under fire over sexualized images despite new limits Grok has faced global backlash after it emerged the feature allowed users to sexualize images of women and children using simple text prompts such as \"put her in a bikini\" or \"remove her clothes.\" Grok under fire after complaints it undressed minors in photos The \"Edit Image\" button feature first rolled out in late December on Grok allows users to modify any image on the platform, with some users deciding to partially or completely remove clothing from women or children in pictures, according to complaints. Start-up scandals in 2025 force investors to raise the bar, change playbooks From the unravelling of eFishery saga to corruption probes ensnaring venture capital executives tied to state-backed funding at TaniHub, the year stripped the gloss from Southeast Asia’s most coveted start-up market. TSMC says started mass production of 'most advanced' 2nm chips Taiwanese tech titan TSMC has started mass producing its cutting-edge 2-nanometer semiconductor chips, the company said in a statement seen by AFP on Wednesday. How China built its ‘Manhattan Project’ to rival the West in AI chips In a high-security Shenzhen laboratory, Chinese scientists have built what Washington has spent years trying to prevent: a prototype of a machine capable of producing the cutting-edge semiconductor chips that power artificial intelligence, smartphones and weapons central to Western military dominance. US threatens countermeasures on European service providers after EU fines President Donald Trump's administration warned on Tuesday the United States could impose fees or restrictions on European service providers in response to what it called “discriminatory” actions against US firms. China's smaller manufacturers look to catch the automation wave In a light-filled workshop in eastern China, a robotic arm moved a partially assembled autonomous vehicle as workers calibrated its cameras, typical of the incremental automation being adopted even across smaller factories in the world's manufacturing powerhouse. Google to build subsea cables in PNG under Australia defense treaty The $120-million effort will link northern and southern Papua New Guinea and the Bougainville autonomous region with high-capacity cables, Peter Tsiamalili, PNG's acting minister for information and communications technology, said on Friday. Aftech's Mandiri BFN Fest aims to boost trust in fintech The festival, which runs from Dec. 10 to 11 and is free to all visitors, aims to increase public trust in the fintech industry toward better, sustainable economic growth. Oil-rich UAE turns to AI to grease economy Deep in the Abu Dhabi desert, a vast AI campus a quarter the size of Paris is starting to emerge, the oil-rich UAE's boldest bet yet on technology it hopes will help transform its economy. Robinhood to enter RI with broker, crypto trader acquisitions Founded in California in 2013, Robinhood shot to fame during the social-media-fueled retail-trading frenzy of 2021 and gained broader market legitimacy this year after joining the United States benchmark S&P 500 index. X gets $140 million EU fine for breaching content rules but TikTok settles Elon Musk's social media company X was fined 120 million euros (US$140 million) by EU tech regulators on Friday for breaching online content rules, the first sanction under landmark legislation that once again drew criticism from the US government. Meta partners with news outlets to expand AI content The expansion aims to make its AI assistant \"more responsive, accurate, and balanced\" by incorporating diverse viewpoints, acknowledging that \"real-time events can be challenging for current AI systems to keep up with.\" EU hits Meta with antitrust probe over plans to block AI rivals from WhatsApp Indonesia racks up $2.6b in digital taxes since 2020 Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Legacy, landscapes and lives: The tales of Nusantara Black and White of RI Fiesta of Democracy Silent, invisible danger on Cirebon coast Some 5.7 tonnes of shrimp contaminated with Cesium 137 disposed InterContinental Bali Resort introduces restorative Silent Retreat BPJS Kesehatan ends 2024 with prestigious international awards Love unveiled at Adriana Cocina & Bar: A new Mexican rooftop experience in Bali Get the latest news in your inbox",
    "negative_score": 32,
    "sentiment_score": 0.9982,
    "is_negative": true,
    "source": "jakartapost_business",
    "processed_at": "2026-02-18T04:17:23.314930"
  },
  {
    "title": "",
    "url": "http://www.thejakartapost.com/index.php/business/companies",
    "published_date": "",
    "summary": "Vietnam licenses Musk's satellite internet firm Starlink Vietnam has granted a license to Elon Musk's Starlink to operate its satellite internet services in the communist country, a government agency said. A woman rides a bicycle in front of an electric bus on the street in Hanoi on Nov. 21, 2025. Tiffany & Co stores sealed over alleged illegal imports Danantara’s poultry push raises concerns over market distortion Pertamina to spin off airlines, hospitals, non-oil units this year The 2024 banking industry outlook There are two situations in 2024 that will affect the condition of national banking; first, the general election; second, indications of a weakening global economy. Tuksedo gives cars from the past a brand-new future A family-owned workshop in Bali recreates classic cars for discerning customers and is now looking to include EV options. Indonesia, ExxonMobil sign agreement on CCS, petrochemical projects The government, along with state-owned oil and gas corporation Pertamina, inked two agreements with United States oil and gas giant ExxonMobil pertaining to advancing the progress on carbon capture storage (CCS) projects and exploring a potential petrochemical complex in Indonesia. From Frenchie to fortune: Kurobokan spotlights Indonesia-designed toys With quirky collectibles, Kurobokan puts Indonesia on the map in the so-called kidult market, proving that toys are for everyone, no matter their age. Indosat Ooredoo Hutchison shows healthy fundamentals in 2025 with 12.2% net profit growth Indosat Ooredoo Hutchison (ISAT) demonstrated robust performance throughout 2025, recording revenue of Rp 56.5 trillion (US$3.37 billion) in addition to double-digit profit growth of 12.2 percent year-on-year (yoy) and 51 percent quarter-on-quarter (qoq) to Rp 5.5 trillion. PLN EPI breaks ground on Rp1 trillion gas pipeline PLN EPI breaks ground on Rp1 trillion gas pipeline PT PLN Energi Primer Indonesia has begun the construction of a Rp 1 trillion (US$59.57 million) gas pipeline linking the West Natuna Transportation System (WNTS) to Pemping Island, Batam. Finance Ministry’s SMI secures $9.3m grants to expand green finance PT SMI operates as a development finance institution providing corporate and public financing alongside project advisory and preparation services. Danantara breaks ground on $7b downstream industry projects The projects, launched simultaneously across 13 regions on Friday, are fully funded from Danantara’s internal resources and are expected to create about 6,000 direct jobs, the fund said in a statement. Cloud, AI services to boost Indonesia’s economy, Microsoft says Backed by a US$1.7 billion investment through 2028, Microsoft aims to build Indonesia’s digital economy by expanding cloud and AI infrastructure, strengthening the developer ecosystem and training 500,000 AI-ready talents by 2026. Bosch goes new ways with modular factory in West Java Indonesia ‘impatient’ in tech adoption, Infor says GE HealthCare eyes Indonesia as regional hub for medical device exports Bali’s Nuanu seeks investors that look beyond profit Executive Column: Being a small bank makes no sense, says KBank FLSmidth sees energy transition driving global minerals demand Bali Waste Cycle aims to scale up to make recycling profitable Born out of Bali’s growing trash problem, Bali Waste Cycle (BWC) seeks to expand its business, balancing profit, purpose and sustainability. Oaken Lab brings fresh scent to Indonesia’s perfume market Oaken Lab brings fresh scent to Indonesia’s perfume market Coffee chain Tuku seeks perfect blend for expansion Studio Ubud awakens Indonesian anime Teck Seng Ho: Understanding client needs crucial for sustaining Sun Life Indonesia Newly appointed Sun Life Indonesia president director Teck Seng Ho has expressed positivity about the company’s client-friendly work environment. Leading Indosat's growth to empower Indonesia, Vikram Sinha named 2023 CEO of the Year Indosat Ooredoo Hutchison (Indosat) continues to record splendid operational and financial performances following its recent merger. Embracing the spirit of Gotong Royong, Indosat has a greater goal of empowering Indonesia. Securing Indonesians’ future through innovation, teamwork PT Asuransi Allianz Life Indonesia has recently appointed Alexander Grenz as Country Manager and President Director of Allianz Life Indonesia. After obtaining a permit from the Financial Services Authority (OJK), he took the role on April 7, where he will be managing Allianz's operational activities Melissa Siska Juminto and the journey of growth and excellence In an age of instant gratification, trusting the process has become somewhat of a rare quality. This is not the case for Melissa Siska Juminto. Get the latest news in your inbox",
    "category": "market",
    "author": "",
    "content": "Vietnam licenses Musk's satellite internet firm Starlink Vietnam has granted a license to Elon Musk's Starlink to operate its satellite internet services in the communist country, a government agency said. A woman rides a bicycle in front of an electric bus on the street in Hanoi on Nov. 21, 2025. Tiffany & Co stores sealed over alleged illegal imports Danantara’s poultry push raises concerns over market distortion Pertamina to spin off airlines, hospitals, non-oil units this year The 2024 banking industry outlook There are two situations in 2024 that will affect the condition of national banking; first, the general election; second, indications of a weakening global economy. Tuksedo gives cars from the past a brand-new future A family-owned workshop in Bali recreates classic cars for discerning customers and is now looking to include EV options. Indonesia, ExxonMobil sign agreement on CCS, petrochemical projects The government, along with state-owned oil and gas corporation Pertamina, inked two agreements with United States oil and gas giant ExxonMobil pertaining to advancing the progress on carbon capture storage (CCS) projects and exploring a potential petrochemical complex in Indonesia. From Frenchie to fortune: Kurobokan spotlights Indonesia-designed toys With quirky collectibles, Kurobokan puts Indonesia on the map in the so-called kidult market, proving that toys are for everyone, no matter their age. Indosat Ooredoo Hutchison shows healthy fundamentals in 2025 with 12.2% net profit growth Indosat Ooredoo Hutchison (ISAT) demonstrated robust performance throughout 2025, recording revenue of Rp 56.5 trillion (US$3.37 billion) in addition to double-digit profit growth of 12.2 percent year-on-year (yoy) and 51 percent quarter-on-quarter (qoq) to Rp 5.5 trillion. PLN EPI breaks ground on Rp1 trillion gas pipeline PLN EPI breaks ground on Rp1 trillion gas pipeline PT PLN Energi Primer Indonesia has begun the construction of a Rp 1 trillion (US$59.57 million) gas pipeline linking the West Natuna Transportation System (WNTS) to Pemping Island, Batam. Finance Ministry’s SMI secures $9.3m grants to expand green finance PT SMI operates as a development finance institution providing corporate and public financing alongside project advisory and preparation services. Danantara breaks ground on $7b downstream industry projects The projects, launched simultaneously across 13 regions on Friday, are fully funded from Danantara’s internal resources and are expected to create about 6,000 direct jobs, the fund said in a statement. Cloud, AI services to boost Indonesia’s economy, Microsoft says Backed by a US$1.7 billion investment through 2028, Microsoft aims to build Indonesia’s digital economy by expanding cloud and AI infrastructure, strengthening the developer ecosystem and training 500,000 AI-ready talents by 2026. Bosch goes new ways with modular factory in West Java Indonesia ‘impatient’ in tech adoption, Infor says GE HealthCare eyes Indonesia as regional hub for medical device exports Bali’s Nuanu seeks investors that look beyond profit Executive Column: Being a small bank makes no sense, says KBank FLSmidth sees energy transition driving global minerals demand Bali Waste Cycle aims to scale up to make recycling profitable Born out of Bali’s growing trash problem, Bali Waste Cycle (BWC) seeks to expand its business, balancing profit, purpose and sustainability. Oaken Lab brings fresh scent to Indonesia’s perfume market Oaken Lab brings fresh scent to Indonesia’s perfume market Coffee chain Tuku seeks perfect blend for expansion Studio Ubud awakens Indonesian anime Teck Seng Ho: Understanding client needs crucial for sustaining Sun Life Indonesia Newly appointed Sun Life Indonesia president director Teck Seng Ho has expressed positivity about the company’s client-friendly work environment. Leading Indosat's growth to empower Indonesia, Vikram Sinha named 2023 CEO of the Year Indosat Ooredoo Hutchison (Indosat) continues to record splendid operational and financial performances following its recent merger. Embracing the spirit of Gotong Royong, Indosat has a greater goal of empowering Indonesia. Securing Indonesians’ future through innovation, teamwork PT Asuransi Allianz Life Indonesia has recently appointed Alexander Grenz as Country Manager and President Director of Allianz Life Indonesia. After obtaining a permit from the Financial Services Authority (OJK), he took the role on April 7, where he will be managing Allianz's operational activities Melissa Siska Juminto and the journey of growth and excellence In an age of instant gratification, trusting the process has become somewhat of a rare quality. This is not the case for Melissa Siska Juminto. Get the latest news in your inbox",
    "negative_score": 0,
    "sentiment_score": 0.9973,
    "is_negative": false,
    "source": "jakartapost_business",
    "processed_at": "2026-02-18T04:17:23.331421"
  },
  {
    "title": "",
    "url": "http://www.thejakartapost.com/index.php/business/regulations",
    "published_date": "",
    "summary": "Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers The sun sets beyond an oil and gas rig operated by Saka Energi Muriah Limited, a wholly owned subsidiary of state gas company PGN, in the Kepodang Field of the Muriah Block off Semarang, Central Java, in this undated handout photo. Idle oil and gas projects risk losing licenses, Bahlil warns The energy minister has taken an \"all stick, no carrot\" strategy to pressure firms into start pumping oil and gas from stalled projects, threatening hundreds of wells with the prospect of losing their permits. Get the latest news in your inbox Site selection for first nuclear plant expected by mid-2026, says renewables official According to the ministry's renewables director general, the Bangka Belitung Islands and West Kalimantan are two priority provinces under consideration as a potential site for developing Indonesia's first nuclear power plant toward a 2032 on-grid target. ... EU proposes extending Russian oil sanctions to maritime services It has been reported that Karimun, Riau Islands, has been part of a system of traders, shippers and transshipment points, including the floating hub along the Malacca and Singapore straits and Fujairah in the United Arab Emirates, that has helped keep Russian oil and products flowing, despite the sanctions. ... Prabowo ordered purge of IDX, OJK leadership, brother says Hashim Djojohadikusumo, who is the special envoy for climate change and the brother of President Prabowo Subianto, said the five IDX and OJK officials who resigned soon after last month’s market crash did so in direct response to the President’s order. EU proposes sanctions on Indonesian ports for handling Russian oil The proposal would bar EU companies and individuals from conducting transactions with Karimun Port in Indonesia and Kulevi Port in Georgia. Indonesia proposes 3 measures to meet MSCI's transparency demands As part of their eight-point plan, Indonesian authorities have come up with three proposed measures to meet MSCI's transparency demands and avoid potential downgrading to emerging market status. Crackdown on mining permits faces legal scrutiny A potential lawsuit over halted mining operations could expose the state to fiscal risks reaching tens of trillions of rupiah, extending far beyond legal fees to include lost revenue and compensation claims. Pushing rupiah to 15,000 per dollar ‘not that difficult’, says Purbaya Finance Minister Purbaya Yudhi Sadewa says pushing the rupiah exchange rate back up to 15,000 per United States dollar should not be that difficult as the currency is undervalued when taking into account Indonesia’s economic fundamentals. Weak commitment, policy uncertainty derail RI renewable targets The contribution of renewable energy to the national energy mix, which refer to total electricity production, rose by only 1.1 percentage points to 15.75 percent in 2025. OJK, IDX name new leaders before markets open again The Financial Services Authority (OJK) has announced replacements for four of its high-ranking officials who stepped down on Friday, while the Indonesia Stock Exchange (IDX) is also set to appoint a new interim director ahead of a meeting with global stock market index compiler Morgan Stanley Capital International (MSCI) scheduled for Monday. Heads roll at IDX, OJK, as govt vows to fix stock market It is not immediately clear whether the resignations of five high-ranking officials at the Indonesia Stock Exchange (IDX) and the Financial Services Authority (OJK) were voluntary or forced. Senior minister Airlangga Hartarto said President Prabowo Subianto is monitoring the stock exchange following the market meltdown. Post-flood regulatory crackdown signals 'creeping nationalization' The abrupt revocation of mining permits and the planned transfer of assets to state firms have raised concerns of \"nationalization\", undermining legal certainty and threatening to erode Indonesia’s appeal to foreign capital. What's behind Indonesia's worst stock crash in decades? IDX director steps down after stocks plunge amid MSCI warning Indonesia Stock Exchange (IDX) president director Iman Rachman has announced his resignation following Morgan Stanley Capital International’s (MSCI) transparency warning that triggered a massive sell-off in Indonesian stocks and temporary trading halts earlier this week. Govt vows swift changes to heed MSCI demands for RI stocks Both Indonesia Stock Exchange (IDX) and the Financial Services Authority (OJK) have promised to act fast and change stock market regulations pursuant to points made by Morgan Stanley Capital International (MSCI) that prompted a massive sell-off. State-owned Perminas to assume control of Martabe gold mine The Martabe gold mine in North Sumatra, operated by PT Agincourt Resources, will be transferred to state control under the newly formed National Mineral Company (Perminas), ending recent speculation about one of Indonesia's major gold assets. BYD, VinFast to start local EV production in March, govt says Failure to meet those commitments allows the government to draw down bank guarantees posted by the companies as penalties. Danantara to manage land seized from 28 firms linked to Sumatra floods PT North Sumatra Hydro Energy (NSHE), which runs the Batangtoru hydropower facility, is among the 28 firms whose permits were revoked after the floods. The company is controlled by China's state-run SDIC Power Holdings Co. Ltd. Shell, BP to receive fuel import quotas every six months this year As private fuel retailers began seeing their annual stocks run low last August, the government refused to issue additional quotas and instead urged them to buy imported base fuel from Pertamina. Plan to build subsidized apartments in Meikarta raises doubts The Public Housing and Settlements Ministry plans to transform parts of the long-stalled Meikarta project in Bekasi, West Java, into a subsidized apartment complex (Rusun) to provide affordable homes in urban areas for low-income earners. Indonesia cuts live cattle price cap after beef traders’ strike Beef prices in Indonesia usually climb ahead of Idul Fitri, which is expected to fall on March 21 this year, as seasonal demand rises during Ramadan and the festive period. E-commerce sellers wait for tighter rules on platform fees E-commerce sellers say restrictions on platform fees under a planned new regulation would help them manage pricing more efficiently. Indonesia seeks to boost rooftop solar quota by 400 MW If approved by state electricity monopoly PLN, the total quota for 2026 would rise to around 1,400 MW. Illegal tobacco excise plan casts haze over market fairness, policy certainty Finance Minister Purbaya Yudhi Sadewa estimated that formalizing illegal cigarette production could generate additional trillions of rupiah (more than US$59 million) for the state coffers. BI to remain ‘professional’ with strong governance, Perry vows Professionalism will continue in monetary policymaking, Bank Indonesia (BI) Governor Perry Warjiyo has promised, seeking to allay any concerns following Deputy Finance Minister Thomas “Tommy” Djiwandono’s nomination as a deputy BI governor. Indonesia aims for garlic self-sufficiency in 2029 Roughly 95 percent of the country’s consumption is currently met through imports. Prabowo’s $6 billion rescue plan leaves textile industry puzzled A state-owned textile enterprise is to tackle industrywide problems, including rehiring tens of thousands of workers laid off after the Sritex bankruptcy. Catch-up costs loom as Prabowo revives semiconductor dream Prabowo's nephew enters race for senior central bank post Deputy finance minister Thomas \"Tommy\" Djiwandono, who is also a nephew of President Prabowo Subianto, has been lined up to become a deputy governor of Bank Indonesia (BI), raising questions about the central bank’s independence. Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Legacy, landscapes and lives: The tales of Nusantara Black and White of RI Fiesta of Democracy Silent, invisible danger on Cirebon coast Some 5.7 tonnes of shrimp contaminated with Cesium 137 disposed InterContinental Bali Resort introduces restorative Silent Retreat BPJS Kesehatan ends 2024 with prestigious international awards Love unveiled at Adriana Cocina & Bar: A new Mexican rooftop experience in Bali Get the latest news in your inbox",
    "category": "market",
    "author": "",
    "content": "Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers The sun sets beyond an oil and gas rig operated by Saka Energi Muriah Limited, a wholly owned subsidiary of state gas company PGN, in the Kepodang Field of the Muriah Block off Semarang, Central Java, in this undated handout photo. Idle oil and gas projects risk losing licenses, Bahlil warns The energy minister has taken an \"all stick, no carrot\" strategy to pressure firms into start pumping oil and gas from stalled projects, threatening hundreds of wells with the prospect of losing their permits. Get the latest news in your inbox Site selection for first nuclear plant expected by mid-2026, says renewables official According to the ministry's renewables director general, the Bangka Belitung Islands and West Kalimantan are two priority provinces under consideration as a potential site for developing Indonesia's first nuclear power plant toward a 2032 on-grid target. ... EU proposes extending Russian oil sanctions to maritime services It has been reported that Karimun, Riau Islands, has been part of a system of traders, shippers and transshipment points, including the floating hub along the Malacca and Singapore straits and Fujairah in the United Arab Emirates, that has helped keep Russian oil and products flowing, despite the sanctions. ... Prabowo ordered purge of IDX, OJK leadership, brother says Hashim Djojohadikusumo, who is the special envoy for climate change and the brother of President Prabowo Subianto, said the five IDX and OJK officials who resigned soon after last month’s market crash did so in direct response to the President’s order. EU proposes sanctions on Indonesian ports for handling Russian oil The proposal would bar EU companies and individuals from conducting transactions with Karimun Port in Indonesia and Kulevi Port in Georgia. Indonesia proposes 3 measures to meet MSCI's transparency demands As part of their eight-point plan, Indonesian authorities have come up with three proposed measures to meet MSCI's transparency demands and avoid potential downgrading to emerging market status. Crackdown on mining permits faces legal scrutiny A potential lawsuit over halted mining operations could expose the state to fiscal risks reaching tens of trillions of rupiah, extending far beyond legal fees to include lost revenue and compensation claims. Pushing rupiah to 15,000 per dollar ‘not that difficult’, says Purbaya Finance Minister Purbaya Yudhi Sadewa says pushing the rupiah exchange rate back up to 15,000 per United States dollar should not be that difficult as the currency is undervalued when taking into account Indonesia’s economic fundamentals. Weak commitment, policy uncertainty derail RI renewable targets The contribution of renewable energy to the national energy mix, which refer to total electricity production, rose by only 1.1 percentage points to 15.75 percent in 2025. OJK, IDX name new leaders before markets open again The Financial Services Authority (OJK) has announced replacements for four of its high-ranking officials who stepped down on Friday, while the Indonesia Stock Exchange (IDX) is also set to appoint a new interim director ahead of a meeting with global stock market index compiler Morgan Stanley Capital International (MSCI) scheduled for Monday. Heads roll at IDX, OJK, as govt vows to fix stock market It is not immediately clear whether the resignations of five high-ranking officials at the Indonesia Stock Exchange (IDX) and the Financial Services Authority (OJK) were voluntary or forced. Senior minister Airlangga Hartarto said President Prabowo Subianto is monitoring the stock exchange following the market meltdown. Post-flood regulatory crackdown signals 'creeping nationalization' The abrupt revocation of mining permits and the planned transfer of assets to state firms have raised concerns of \"nationalization\", undermining legal certainty and threatening to erode Indonesia’s appeal to foreign capital. What's behind Indonesia's worst stock crash in decades? IDX director steps down after stocks plunge amid MSCI warning Indonesia Stock Exchange (IDX) president director Iman Rachman has announced his resignation following Morgan Stanley Capital International’s (MSCI) transparency warning that triggered a massive sell-off in Indonesian stocks and temporary trading halts earlier this week. Govt vows swift changes to heed MSCI demands for RI stocks Both Indonesia Stock Exchange (IDX) and the Financial Services Authority (OJK) have promised to act fast and change stock market regulations pursuant to points made by Morgan Stanley Capital International (MSCI) that prompted a massive sell-off. State-owned Perminas to assume control of Martabe gold mine The Martabe gold mine in North Sumatra, operated by PT Agincourt Resources, will be transferred to state control under the newly formed National Mineral Company (Perminas), ending recent speculation about one of Indonesia's major gold assets. BYD, VinFast to start local EV production in March, govt says Failure to meet those commitments allows the government to draw down bank guarantees posted by the companies as penalties. Danantara to manage land seized from 28 firms linked to Sumatra floods PT North Sumatra Hydro Energy (NSHE), which runs the Batangtoru hydropower facility, is among the 28 firms whose permits were revoked after the floods. The company is controlled by China's state-run SDIC Power Holdings Co. Ltd. Shell, BP to receive fuel import quotas every six months this year As private fuel retailers began seeing their annual stocks run low last August, the government refused to issue additional quotas and instead urged them to buy imported base fuel from Pertamina. Plan to build subsidized apartments in Meikarta raises doubts The Public Housing and Settlements Ministry plans to transform parts of the long-stalled Meikarta project in Bekasi, West Java, into a subsidized apartment complex (Rusun) to provide affordable homes in urban areas for low-income earners. Indonesia cuts live cattle price cap after beef traders’ strike Beef prices in Indonesia usually climb ahead of Idul Fitri, which is expected to fall on March 21 this year, as seasonal demand rises during Ramadan and the festive period. E-commerce sellers wait for tighter rules on platform fees E-commerce sellers say restrictions on platform fees under a planned new regulation would help them manage pricing more efficiently. Indonesia seeks to boost rooftop solar quota by 400 MW If approved by state electricity monopoly PLN, the total quota for 2026 would rise to around 1,400 MW. Illegal tobacco excise plan casts haze over market fairness, policy certainty Finance Minister Purbaya Yudhi Sadewa estimated that formalizing illegal cigarette production could generate additional trillions of rupiah (more than US$59 million) for the state coffers. BI to remain ‘professional’ with strong governance, Perry vows Professionalism will continue in monetary policymaking, Bank Indonesia (BI) Governor Perry Warjiyo has promised, seeking to allay any concerns following Deputy Finance Minister Thomas “Tommy” Djiwandono’s nomination as a deputy BI governor. Indonesia aims for garlic self-sufficiency in 2029 Roughly 95 percent of the country’s consumption is currently met through imports. Prabowo’s $6 billion rescue plan leaves textile industry puzzled A state-owned textile enterprise is to tackle industrywide problems, including rehiring tens of thousands of workers laid off after the Sritex bankruptcy. Catch-up costs loom as Prabowo revives semiconductor dream Prabowo's nephew enters race for senior central bank post Deputy finance minister Thomas \"Tommy\" Djiwandono, who is also a nephew of President Prabowo Subianto, has been lined up to become a deputy governor of Bank Indonesia (BI), raising questions about the central bank’s independence. Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Legacy, landscapes and lives: The tales of Nusantara Black and White of RI Fiesta of Democracy Silent, invisible danger on Cirebon coast Some 5.7 tonnes of shrimp contaminated with Cesium 137 disposed InterContinental Bali Resort introduces restorative Silent Retreat BPJS Kesehatan ends 2024 with prestigious international awards Love unveiled at Adriana Cocina & Bar: A new Mexican rooftop experience in Bali Get the latest news in your inbox",
    "negative_score": 46,
    "sentiment_score": 0.9337,
    "is_negative": true,
    "source": "jakartapost_business",
    "processed_at": "2026-02-18T04:17:23.385058"
  },
  {
    "title": "",
    "url": "http://www.thejakartapost.com/index.php/business/markets",
    "published_date": "",
    "summary": "Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers An employee displays US dollar banknotes at Bank Syariah Indonesia in South Tangerang, Banten, on Jan. 21, 2026. Dollar holds gains in thin trading as markets await Fed minutes, US GDP The dollar held gains on Tuesday as markets awaited signals, expected later this week, about the potential timing of rate cuts by the Federal Reserve. Get the latest news in your inbox Asian markets sluggish as Lunar New Year holiday looms Asian markets were subdued on Monday, as the extended Lunar New Year holiday approached and Japan reported lackluster economic growth. ... Asian shares step back from record as tech jitters return, bonds rally Asian shares retreated from record highs on Friday as worries about shrinking margins in the tech sector hit the likes of Apple, driving investors into safe-haven bonds ahead of key US inflation data. ... Gold edges lower on firmer dollar after strong US jobs data Gold prices dipped on Thursday, as the U.S. dollar firmed after stronger-than-expected January jobs data dented expectation for near-term interest rate cuts, while investors awaited inflation data due on Friday for more monetary policy cues. Danantara’s IDX ownership plan gets guarded welcome Danantara CEO Rosan Roeslani pointed out that it is common practice for sovereign wealth funds (SWFs) to hold stakes in bourses, typically ranging from 15 percent to 30 percent. Buoyant stocks pause for breath on signs of softening US consumption Bonds jumped and a rebound in stock markets slowed down on Wednesday after softer-than-expected US retail sales figures, while a rally in the yen has extended and might be beginning to signal a shift in investor thinking since Japan's election. FTSE Russell postpones Indonesia index review Asian markets rally as Japan shares surge to record peak Nikkei jumped 4.2 percent to all-time highs as the government's decisive majority after the election clears the way for more spending and tax cuts. Indonesian markets slide again after Moody's cuts outlook Stocks dive, silver and cryptos look for cover after rout Global stocks extended losses into a third day on Friday as a selloff on Wall Street intensified, leaving investors dazed as wrenching volatility gripped precious metals and cryptocurrencies. Stocks in retreat as traders reconsider tech investment Asian stocks fell Thursday to track more losses on Wall Street, where tech firms were again under pressure as fears over vast AI investments and extended valuations gained momentum. India's January palm oil imports hit four-month high as buyers cut soy oil purchases Higher palm oil imports by India, the world's largest buyer of vegetable oils, could help reduce inventories in top producers Indonesia and Malaysia, supporting benchmark Malaysian palm oil futures, while pressuring US soy oil futures. Equities, metals, oil rebound after Asia-wide rout Stocks rallied while precious metals and crude rebounded as some stability returned Tuesday following a rout fueled by a perfect storm that sent shivers through across Asian trading floors. Stocks plunge again as doubts persist over reform plan Indonesian shares plunged again on Monday, showing that a leadership shakeup at stock market institutions and government assurances about planned reforms have not allayed investor concerns. Oil tumbles on Iran hopes, precious metals hit by stronger dollar Oil prices tanked Monday on easing US-Iran tensions while precious metals swung wildly following last week's dollar-fueled collapse sparked by Donald Trump's hawkish pick to lead the Federal Reserve. Asian stocks hit by fresh tech fears as gold retreats from peak What is MSCI and what has it done to Indonesia's stock market? Goldman Sachs estimates that foreign investor outflow could reach $7.8 billion if Indonesia is downgraded to frontier market, a scenario the investment bank and some investors deem unlikely. Indonesia stocks tank as downgrade risk triggers capital flight MSCI's warning is the latest setback for Southeast Asia's largest economy as foreign capital flows out due to concerns about how President Prabowo Subianto is widening the fiscal deficit and ramping up the state's involvement in financial markets. IDX halts trading again as stocks plunge further The Indonesia Stock Exchange (IDX) Composite index has nosedived for a second day in a row due to investability flags from Morgan Stanley Capital International (MSCI), prompting another trading halt. IDX plunges after MSCI warning about RI stocks The Indonesia Stock Exchange (IDX) temporarily halted trading on Wednesday after shares plunged on a warning from global index provider MSCI that it could downgrade Indonesian stocks to frontier-market status. Dollar reels near four-year low after blow from Trump comments As investors have grown increasingly nervous about their exposure to US assets, other currencies and gold have shot up in the past couple of weeks. IDX Composite index nosedives at open The Indonesia Stock Exchange (IDX) Composite index nosedived as trading opened on Wednesday following an evaluation by Morgan Stanley Capital International (MSCI) that flags Indonesian stocks. How coal production cuts affect Indonesia’s economy The coal sector to come under further pressure this year, as the correction in coal prices is likely to continue in line with a deeper decline in Indonesia’s coal production. Stocks up as earnings hopes offset Trump's Korea tariff move, dollar wobbles Asian shares advanced on Tuesday as investors hoped for the best from a barrage of US mega-cap earnings, though uncertainty caused by President Donald Trump’s latest tariff moves on South Korea limited broader gains while boosting gold and silver. Yen surges as intervention risks lurk, gold surpasses $5,000 Gold surged past US$5,000 per ounce early on Monday following a turbulent week where tensions over Greenland and Iran rattled sentiment, while markets remained on tenterhooks after a rout in bonds and violent spikes in the yen. Gold nears $5,000, stocks muted after turbulent week Stocks were subdued and precious metals hit fresh highs Friday after a turbulent week that saw US President Donald Trump back down from threats to seize Greenland and to issue tariffs against European allies. Industry urges palm oil output boost amid biodiesel uncertainty Implementing B50 amid stagnant production could trigger a sharp rise in CPO prices and derivative products such as cooking oil, as well as reduce export volumes. RI bond yield spikes on BI independence worries, uncertainty The yield on Indonesian government bonds has climbed to its highest level in more than three months on the back of general uncertainty, fiscal worries and concerns about the independence of Bank Indonesia (BI) following the nomination of Thomas “Tommy” Djiwandono as deputy governor. Japan should respond 'decisively' to bond sell-off, opposition head says Japan should act decisively against excessive market moves, Yuichiro Tamaki, head of an influential opposition party, told Reuters on Wednesday, after a brutal sell-off of Japanese government bonds sent a chill through global financial markets. Stocks stable after tariff-fueled selloff but uncertainty boosts gold Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Legacy, landscapes and lives: The tales of Nusantara Black and White of RI Fiesta of Democracy Silent, invisible danger on Cirebon coast Some 5.7 tonnes of shrimp contaminated with Cesium 137 disposed InterContinental Bali Resort introduces restorative Silent Retreat BPJS Kesehatan ends 2024 with prestigious international awards Love unveiled at Adriana Cocina & Bar: A new Mexican rooftop experience in Bali Get the latest news in your inbox",
    "category": "market",
    "author": "",
    "content": "Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers An employee displays US dollar banknotes at Bank Syariah Indonesia in South Tangerang, Banten, on Jan. 21, 2026. Dollar holds gains in thin trading as markets await Fed minutes, US GDP The dollar held gains on Tuesday as markets awaited signals, expected later this week, about the potential timing of rate cuts by the Federal Reserve. Get the latest news in your inbox Asian markets sluggish as Lunar New Year holiday looms Asian markets were subdued on Monday, as the extended Lunar New Year holiday approached and Japan reported lackluster economic growth. ... Asian shares step back from record as tech jitters return, bonds rally Asian shares retreated from record highs on Friday as worries about shrinking margins in the tech sector hit the likes of Apple, driving investors into safe-haven bonds ahead of key US inflation data. ... Gold edges lower on firmer dollar after strong US jobs data Gold prices dipped on Thursday, as the U.S. dollar firmed after stronger-than-expected January jobs data dented expectation for near-term interest rate cuts, while investors awaited inflation data due on Friday for more monetary policy cues. Danantara’s IDX ownership plan gets guarded welcome Danantara CEO Rosan Roeslani pointed out that it is common practice for sovereign wealth funds (SWFs) to hold stakes in bourses, typically ranging from 15 percent to 30 percent. Buoyant stocks pause for breath on signs of softening US consumption Bonds jumped and a rebound in stock markets slowed down on Wednesday after softer-than-expected US retail sales figures, while a rally in the yen has extended and might be beginning to signal a shift in investor thinking since Japan's election. FTSE Russell postpones Indonesia index review Asian markets rally as Japan shares surge to record peak Nikkei jumped 4.2 percent to all-time highs as the government's decisive majority after the election clears the way for more spending and tax cuts. Indonesian markets slide again after Moody's cuts outlook Stocks dive, silver and cryptos look for cover after rout Global stocks extended losses into a third day on Friday as a selloff on Wall Street intensified, leaving investors dazed as wrenching volatility gripped precious metals and cryptocurrencies. Stocks in retreat as traders reconsider tech investment Asian stocks fell Thursday to track more losses on Wall Street, where tech firms were again under pressure as fears over vast AI investments and extended valuations gained momentum. India's January palm oil imports hit four-month high as buyers cut soy oil purchases Higher palm oil imports by India, the world's largest buyer of vegetable oils, could help reduce inventories in top producers Indonesia and Malaysia, supporting benchmark Malaysian palm oil futures, while pressuring US soy oil futures. Equities, metals, oil rebound after Asia-wide rout Stocks rallied while precious metals and crude rebounded as some stability returned Tuesday following a rout fueled by a perfect storm that sent shivers through across Asian trading floors. Stocks plunge again as doubts persist over reform plan Indonesian shares plunged again on Monday, showing that a leadership shakeup at stock market institutions and government assurances about planned reforms have not allayed investor concerns. Oil tumbles on Iran hopes, precious metals hit by stronger dollar Oil prices tanked Monday on easing US-Iran tensions while precious metals swung wildly following last week's dollar-fueled collapse sparked by Donald Trump's hawkish pick to lead the Federal Reserve. Asian stocks hit by fresh tech fears as gold retreats from peak What is MSCI and what has it done to Indonesia's stock market? Goldman Sachs estimates that foreign investor outflow could reach $7.8 billion if Indonesia is downgraded to frontier market, a scenario the investment bank and some investors deem unlikely. Indonesia stocks tank as downgrade risk triggers capital flight MSCI's warning is the latest setback for Southeast Asia's largest economy as foreign capital flows out due to concerns about how President Prabowo Subianto is widening the fiscal deficit and ramping up the state's involvement in financial markets. IDX halts trading again as stocks plunge further The Indonesia Stock Exchange (IDX) Composite index has nosedived for a second day in a row due to investability flags from Morgan Stanley Capital International (MSCI), prompting another trading halt. IDX plunges after MSCI warning about RI stocks The Indonesia Stock Exchange (IDX) temporarily halted trading on Wednesday after shares plunged on a warning from global index provider MSCI that it could downgrade Indonesian stocks to frontier-market status. Dollar reels near four-year low after blow from Trump comments As investors have grown increasingly nervous about their exposure to US assets, other currencies and gold have shot up in the past couple of weeks. IDX Composite index nosedives at open The Indonesia Stock Exchange (IDX) Composite index nosedived as trading opened on Wednesday following an evaluation by Morgan Stanley Capital International (MSCI) that flags Indonesian stocks. How coal production cuts affect Indonesia’s economy The coal sector to come under further pressure this year, as the correction in coal prices is likely to continue in line with a deeper decline in Indonesia’s coal production. Stocks up as earnings hopes offset Trump's Korea tariff move, dollar wobbles Asian shares advanced on Tuesday as investors hoped for the best from a barrage of US mega-cap earnings, though uncertainty caused by President Donald Trump’s latest tariff moves on South Korea limited broader gains while boosting gold and silver. Yen surges as intervention risks lurk, gold surpasses $5,000 Gold surged past US$5,000 per ounce early on Monday following a turbulent week where tensions over Greenland and Iran rattled sentiment, while markets remained on tenterhooks after a rout in bonds and violent spikes in the yen. Gold nears $5,000, stocks muted after turbulent week Stocks were subdued and precious metals hit fresh highs Friday after a turbulent week that saw US President Donald Trump back down from threats to seize Greenland and to issue tariffs against European allies. Industry urges palm oil output boost amid biodiesel uncertainty Implementing B50 amid stagnant production could trigger a sharp rise in CPO prices and derivative products such as cooking oil, as well as reduce export volumes. RI bond yield spikes on BI independence worries, uncertainty The yield on Indonesian government bonds has climbed to its highest level in more than three months on the back of general uncertainty, fiscal worries and concerns about the independence of Bank Indonesia (BI) following the nomination of Thomas “Tommy” Djiwandono as deputy governor. Japan should respond 'decisively' to bond sell-off, opposition head says Japan should act decisively against excessive market moves, Yuichiro Tamaki, head of an influential opposition party, told Reuters on Wednesday, after a brutal sell-off of Japanese government bonds sent a chill through global financial markets. Stocks stable after tariff-fueled selloff but uncertainty boosts gold Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Legacy, landscapes and lives: The tales of Nusantara Black and White of RI Fiesta of Democracy Silent, invisible danger on Cirebon coast Some 5.7 tonnes of shrimp contaminated with Cesium 137 disposed InterContinental Bali Resort introduces restorative Silent Retreat BPJS Kesehatan ends 2024 with prestigious international awards Love unveiled at Adriana Cocina & Bar: A new Mexican rooftop experience in Bali Get the latest news in your inbox",
    "negative_score": 36,
    "sentiment_score": 0.9893,
    "is_negative": true,
    "source": "jakartapost_business",
    "processed_at": "2026-02-18T04:17:23.447119"
  },
  {
    "title": "",
    "url": "https://www.thejakartapost.com/business/2026/02/17/dollar-holds-gains-in-thin-trading-as-markets-await-fed-minutes-us-gdp.html",
    "published_date": "",
    "summary": "Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Dollar holds gains in thin trading as markets await Fed minutes, US GDP Published on 2026-02-17T09:40:42+07:00 http://www.thejakartapost.com/business/2026/02/17/dollar-holds-gains-in-thin-trading-as-markets-await-fed-minutes-us-gdp.html An employee displays US dollar banknotes at Bank Syariah Indonesia in South Tangerang, Banten, on Jan. 21, 2026. (Antara/Hafidz Mubarak A) he dollar held gains on Tuesday as markets awaited signals, expected later this week, about the potential timing of rate cuts by the Federal Reserve. The yen trimmed losses from a day earlier when worse-than-expected Japanese economic data stirred expectations that the government would ramp up stimulus. The Aussie dollar edged lower after the release of Reserve Bank of Australia's minutes from its February meeting. Trading was thin with many markets in Asia closed for the Lunar New Year holiday and following the President's Day holiday in the US Key economic events lie later in the week, with minutes from the Fed's last meeting and advance figures on US gross domestic product. \"We're quite positive on the US economy,\" said Kristina Clifton, senior currency strategist at Commonwealth Bank of Australia in Sydney. \"The market is currently pricing a high chance of a June interest rate cut, which is also our view. However, we differ from the market in that we expect a follow-up cut in July.\" \"We judge that the most important driver of the dollar through 2026 will be the narrative of US exceptionalism,\" she added. The dollar index, which measures the greenback against a basket of currencies, was little changed at 97.12, after a 0.2 percent gain in the previous session. The euro fell 0.06 percent to $1.1843. With exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape. By registering, you agree with for signing up our newsletter! Please check your email for your newsletter subscription. The yen strengthened 0.15 percent to 153.28 per dollar. Sterling weakened 0.07 percent to $1.3616. Data on Friday showed US consumer prices increased less than expected in January, giving the Fed additional leeway for policy easing this year. Money market traders are pricing in 62 basis points of easing for the rest of this year, implying two quarter-point cuts and about a 50 percent chance of a third. The next cut is likely in June, with markets assigning an 80 percent chance of a 25-basis-point reduction. The Federal Open Market Committee issues minutes from its January meeting on Wednesday. Other key data points this week include inflation readings for Britain, Canada and Japan, as well as preliminary readings of global business activity on Friday. A recent rally in the yen stalled on Monday when official figures showed Japan's economy barely grew last quarter, eking out an annualized 0.2 percent expansion. The Australian dollar weakened 0.07 percent versus the greenback to $0.7064. New Zealand's kiwi weakened 0.08 percent to $0.6026 ahead of the Reserve Bank of New Zealand's policy meeting on Wednesday, when it is widely expected to hold rates steady. Australia's central bank concluded inflation would stay stubbornly high if it had not hiked interest rates as it did this month and it was not yet sure if further tightening would be necessary. Minutes of the RBA's board meeting last month showed members were worried that the risks to its inflation and employment mandates had \"shifted materially.\" In cryptocurrencies, bitcoin gained 0.05 percent to $68,881.72, while ether was little changed at $1,999.11. Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund Dollar holds gains in thin trading as markets await Fed minutes, US GDP Dollar risk premium is rebuilding Pushing rupiah to 15,000 per dollar ‘not that difficult’, says Purbaya Dollar holds gains in thin trading as markets await Fed minutes, US GDP Dollar risk premium is rebuilding Pushing rupiah to 15,000 per dollar ‘not that difficult’, says Purbaya Dollar reels near four-year low after blow from Trump comments Trump warns of 'big retaliation' if Europeans dump US Treasuries Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund Trump says Japan to invest in energy, industrial projects in Ohio, Texas and Georgia Govt urged not to compromise too much for US trade deal Unlocking regional potential to boost economic growth Indonesia ramps up UN talks ahead of Board of Peace meeting Govt urged not to compromise too much for US trade deal Indonesia, BRICS and the rise of the Global South Indonesia, BRICS and the rise of the Global South Indonesia, BRICS and the rise of the Global South Trump says Japan to invest in energy, industrial projects in Ohio, Texas and Georgia From the US-led rules-based order to multipolar international law Balancing the blaze at home: Blue in the year of fire horse Bima police chief, subordinates arrested for drug trafficking Those who most need to understand AI don't get it Get the latest news in your inbox",
    "category": "market",
    "author": "",
    "content": "Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Dollar holds gains in thin trading as markets await Fed minutes, US GDP Published on 2026-02-17T09:40:42+07:00 http://www.thejakartapost.com/business/2026/02/17/dollar-holds-gains-in-thin-trading-as-markets-await-fed-minutes-us-gdp.html An employee displays US dollar banknotes at Bank Syariah Indonesia in South Tangerang, Banten, on Jan. 21, 2026. (Antara/Hafidz Mubarak A) he dollar held gains on Tuesday as markets awaited signals, expected later this week, about the potential timing of rate cuts by the Federal Reserve. The yen trimmed losses from a day earlier when worse-than-expected Japanese economic data stirred expectations that the government would ramp up stimulus. The Aussie dollar edged lower after the release of Reserve Bank of Australia's minutes from its February meeting. Trading was thin with many markets in Asia closed for the Lunar New Year holiday and following the President's Day holiday in the US Key economic events lie later in the week, with minutes from the Fed's last meeting and advance figures on US gross domestic product. \"We're quite positive on the US economy,\" said Kristina Clifton, senior currency strategist at Commonwealth Bank of Australia in Sydney. \"The market is currently pricing a high chance of a June interest rate cut, which is also our view. However, we differ from the market in that we expect a follow-up cut in July.\" \"We judge that the most important driver of the dollar through 2026 will be the narrative of US exceptionalism,\" she added. The dollar index, which measures the greenback against a basket of currencies, was little changed at 97.12, after a 0.2 percent gain in the previous session. The euro fell 0.06 percent to $1.1843. With exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape. By registering, you agree with for signing up our newsletter! Please check your email for your newsletter subscription. The yen strengthened 0.15 percent to 153.28 per dollar. Sterling weakened 0.07 percent to $1.3616. Data on Friday showed US consumer prices increased less than expected in January, giving the Fed additional leeway for policy easing this year. Money market traders are pricing in 62 basis points of easing for the rest of this year, implying two quarter-point cuts and about a 50 percent chance of a third. The next cut is likely in June, with markets assigning an 80 percent chance of a 25-basis-point reduction. The Federal Open Market Committee issues minutes from its January meeting on Wednesday. Other key data points this week include inflation readings for Britain, Canada and Japan, as well as preliminary readings of global business activity on Friday. A recent rally in the yen stalled on Monday when official figures showed Japan's economy barely grew last quarter, eking out an annualized 0.2 percent expansion. The Australian dollar weakened 0.07 percent versus the greenback to $0.7064. New Zealand's kiwi weakened 0.08 percent to $0.6026 ahead of the Reserve Bank of New Zealand's policy meeting on Wednesday, when it is widely expected to hold rates steady. Australia's central bank concluded inflation would stay stubbornly high if it had not hiked interest rates as it did this month and it was not yet sure if further tightening would be necessary. Minutes of the RBA's board meeting last month showed members were worried that the risks to its inflation and employment mandates had \"shifted materially.\" In cryptocurrencies, bitcoin gained 0.05 percent to $68,881.72, while ether was little changed at $1,999.11. Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund Dollar holds gains in thin trading as markets await Fed minutes, US GDP Dollar risk premium is rebuilding Pushing rupiah to 15,000 per dollar ‘not that difficult’, says Purbaya Dollar holds gains in thin trading as markets await Fed minutes, US GDP Dollar risk premium is rebuilding Pushing rupiah to 15,000 per dollar ‘not that difficult’, says Purbaya Dollar reels near four-year low after blow from Trump comments Trump warns of 'big retaliation' if Europeans dump US Treasuries Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund Trump says Japan to invest in energy, industrial projects in Ohio, Texas and Georgia Govt urged not to compromise too much for US trade deal Unlocking regional potential to boost economic growth Indonesia ramps up UN talks ahead of Board of Peace meeting Govt urged not to compromise too much for US trade deal Indonesia, BRICS and the rise of the Global South Indonesia, BRICS and the rise of the Global South Indonesia, BRICS and the rise of the Global South Trump says Japan to invest in energy, industrial projects in Ohio, Texas and Georgia From the US-led rules-based order to multipolar international law Balancing the blaze at home: Blue in the year of fire horse Bima police chief, subordinates arrested for drug trafficking Those who most need to understand AI don't get it Get the latest news in your inbox",
    "negative_score": 16,
    "sentiment_score": 0.9279,
    "is_negative": true,
    "source": "jakartapost_business",
    "processed_at": "2026-02-18T04:17:23.468368"
  },
  {
    "title": "",
    "url": "https://www.thejakartapost.com/business/markets",
    "published_date": "",
    "summary": "Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers An employee displays US dollar banknotes at Bank Syariah Indonesia in South Tangerang, Banten, on Jan. 21, 2026. Dollar holds gains in thin trading as markets await Fed minutes, US GDP The dollar held gains on Tuesday as markets awaited signals, expected later this week, about the potential timing of rate cuts by the Federal Reserve. Get the latest news in your inbox Asian markets sluggish as Lunar New Year holiday looms Asian markets were subdued on Monday, as the extended Lunar New Year holiday approached and Japan reported lackluster economic growth. ... Asian shares step back from record as tech jitters return, bonds rally Asian shares retreated from record highs on Friday as worries about shrinking margins in the tech sector hit the likes of Apple, driving investors into safe-haven bonds ahead of key US inflation data. ... Gold edges lower on firmer dollar after strong US jobs data Gold prices dipped on Thursday, as the U.S. dollar firmed after stronger-than-expected January jobs data dented expectation for near-term interest rate cuts, while investors awaited inflation data due on Friday for more monetary policy cues. Danantara’s IDX ownership plan gets guarded welcome Danantara CEO Rosan Roeslani pointed out that it is common practice for sovereign wealth funds (SWFs) to hold stakes in bourses, typically ranging from 15 percent to 30 percent. Buoyant stocks pause for breath on signs of softening US consumption Bonds jumped and a rebound in stock markets slowed down on Wednesday after softer-than-expected US retail sales figures, while a rally in the yen has extended and might be beginning to signal a shift in investor thinking since Japan's election. FTSE Russell postpones Indonesia index review Asian markets rally as Japan shares surge to record peak Nikkei jumped 4.2 percent to all-time highs as the government's decisive majority after the election clears the way for more spending and tax cuts. Indonesian markets slide again after Moody's cuts outlook Stocks dive, silver and cryptos look for cover after rout Global stocks extended losses into a third day on Friday as a selloff on Wall Street intensified, leaving investors dazed as wrenching volatility gripped precious metals and cryptocurrencies. Stocks in retreat as traders reconsider tech investment Asian stocks fell Thursday to track more losses on Wall Street, where tech firms were again under pressure as fears over vast AI investments and extended valuations gained momentum. India's January palm oil imports hit four-month high as buyers cut soy oil purchases Higher palm oil imports by India, the world's largest buyer of vegetable oils, could help reduce inventories in top producers Indonesia and Malaysia, supporting benchmark Malaysian palm oil futures, while pressuring US soy oil futures. Equities, metals, oil rebound after Asia-wide rout Stocks rallied while precious metals and crude rebounded as some stability returned Tuesday following a rout fueled by a perfect storm that sent shivers through across Asian trading floors. Stocks plunge again as doubts persist over reform plan Indonesian shares plunged again on Monday, showing that a leadership shakeup at stock market institutions and government assurances about planned reforms have not allayed investor concerns. Oil tumbles on Iran hopes, precious metals hit by stronger dollar Oil prices tanked Monday on easing US-Iran tensions while precious metals swung wildly following last week's dollar-fueled collapse sparked by Donald Trump's hawkish pick to lead the Federal Reserve. Asian stocks hit by fresh tech fears as gold retreats from peak What is MSCI and what has it done to Indonesia's stock market? Goldman Sachs estimates that foreign investor outflow could reach $7.8 billion if Indonesia is downgraded to frontier market, a scenario the investment bank and some investors deem unlikely. Indonesia stocks tank as downgrade risk triggers capital flight MSCI's warning is the latest setback for Southeast Asia's largest economy as foreign capital flows out due to concerns about how President Prabowo Subianto is widening the fiscal deficit and ramping up the state's involvement in financial markets. IDX halts trading again as stocks plunge further The Indonesia Stock Exchange (IDX) Composite index has nosedived for a second day in a row due to investability flags from Morgan Stanley Capital International (MSCI), prompting another trading halt. IDX plunges after MSCI warning about RI stocks The Indonesia Stock Exchange (IDX) temporarily halted trading on Wednesday after shares plunged on a warning from global index provider MSCI that it could downgrade Indonesian stocks to frontier-market status. Dollar reels near four-year low after blow from Trump comments As investors have grown increasingly nervous about their exposure to US assets, other currencies and gold have shot up in the past couple of weeks. IDX Composite index nosedives at open The Indonesia Stock Exchange (IDX) Composite index nosedived as trading opened on Wednesday following an evaluation by Morgan Stanley Capital International (MSCI) that flags Indonesian stocks. How coal production cuts affect Indonesia’s economy The coal sector to come under further pressure this year, as the correction in coal prices is likely to continue in line with a deeper decline in Indonesia’s coal production. Stocks up as earnings hopes offset Trump's Korea tariff move, dollar wobbles Asian shares advanced on Tuesday as investors hoped for the best from a barrage of US mega-cap earnings, though uncertainty caused by President Donald Trump’s latest tariff moves on South Korea limited broader gains while boosting gold and silver. Yen surges as intervention risks lurk, gold surpasses $5,000 Gold surged past US$5,000 per ounce early on Monday following a turbulent week where tensions over Greenland and Iran rattled sentiment, while markets remained on tenterhooks after a rout in bonds and violent spikes in the yen. Gold nears $5,000, stocks muted after turbulent week Stocks were subdued and precious metals hit fresh highs Friday after a turbulent week that saw US President Donald Trump back down from threats to seize Greenland and to issue tariffs against European allies. Industry urges palm oil output boost amid biodiesel uncertainty Implementing B50 amid stagnant production could trigger a sharp rise in CPO prices and derivative products such as cooking oil, as well as reduce export volumes. RI bond yield spikes on BI independence worries, uncertainty The yield on Indonesian government bonds has climbed to its highest level in more than three months on the back of general uncertainty, fiscal worries and concerns about the independence of Bank Indonesia (BI) following the nomination of Thomas “Tommy” Djiwandono as deputy governor. Japan should respond 'decisively' to bond sell-off, opposition head says Japan should act decisively against excessive market moves, Yuichiro Tamaki, head of an influential opposition party, told Reuters on Wednesday, after a brutal sell-off of Japanese government bonds sent a chill through global financial markets. Stocks stable after tariff-fueled selloff but uncertainty boosts gold Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Legacy, landscapes and lives: The tales of Nusantara Black and White of RI Fiesta of Democracy Silent, invisible danger on Cirebon coast Some 5.7 tonnes of shrimp contaminated with Cesium 137 disposed InterContinental Bali Resort introduces restorative Silent Retreat BPJS Kesehatan ends 2024 with prestigious international awards Love unveiled at Adriana Cocina & Bar: A new Mexican rooftop experience in Bali Get the latest news in your inbox",
    "category": "market",
    "author": "",
    "content": "Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers An employee displays US dollar banknotes at Bank Syariah Indonesia in South Tangerang, Banten, on Jan. 21, 2026. Dollar holds gains in thin trading as markets await Fed minutes, US GDP The dollar held gains on Tuesday as markets awaited signals, expected later this week, about the potential timing of rate cuts by the Federal Reserve. Get the latest news in your inbox Asian markets sluggish as Lunar New Year holiday looms Asian markets were subdued on Monday, as the extended Lunar New Year holiday approached and Japan reported lackluster economic growth. ... Asian shares step back from record as tech jitters return, bonds rally Asian shares retreated from record highs on Friday as worries about shrinking margins in the tech sector hit the likes of Apple, driving investors into safe-haven bonds ahead of key US inflation data. ... Gold edges lower on firmer dollar after strong US jobs data Gold prices dipped on Thursday, as the U.S. dollar firmed after stronger-than-expected January jobs data dented expectation for near-term interest rate cuts, while investors awaited inflation data due on Friday for more monetary policy cues. Danantara’s IDX ownership plan gets guarded welcome Danantara CEO Rosan Roeslani pointed out that it is common practice for sovereign wealth funds (SWFs) to hold stakes in bourses, typically ranging from 15 percent to 30 percent. Buoyant stocks pause for breath on signs of softening US consumption Bonds jumped and a rebound in stock markets slowed down on Wednesday after softer-than-expected US retail sales figures, while a rally in the yen has extended and might be beginning to signal a shift in investor thinking since Japan's election. FTSE Russell postpones Indonesia index review Asian markets rally as Japan shares surge to record peak Nikkei jumped 4.2 percent to all-time highs as the government's decisive majority after the election clears the way for more spending and tax cuts. Indonesian markets slide again after Moody's cuts outlook Stocks dive, silver and cryptos look for cover after rout Global stocks extended losses into a third day on Friday as a selloff on Wall Street intensified, leaving investors dazed as wrenching volatility gripped precious metals and cryptocurrencies. Stocks in retreat as traders reconsider tech investment Asian stocks fell Thursday to track more losses on Wall Street, where tech firms were again under pressure as fears over vast AI investments and extended valuations gained momentum. India's January palm oil imports hit four-month high as buyers cut soy oil purchases Higher palm oil imports by India, the world's largest buyer of vegetable oils, could help reduce inventories in top producers Indonesia and Malaysia, supporting benchmark Malaysian palm oil futures, while pressuring US soy oil futures. Equities, metals, oil rebound after Asia-wide rout Stocks rallied while precious metals and crude rebounded as some stability returned Tuesday following a rout fueled by a perfect storm that sent shivers through across Asian trading floors. Stocks plunge again as doubts persist over reform plan Indonesian shares plunged again on Monday, showing that a leadership shakeup at stock market institutions and government assurances about planned reforms have not allayed investor concerns. Oil tumbles on Iran hopes, precious metals hit by stronger dollar Oil prices tanked Monday on easing US-Iran tensions while precious metals swung wildly following last week's dollar-fueled collapse sparked by Donald Trump's hawkish pick to lead the Federal Reserve. Asian stocks hit by fresh tech fears as gold retreats from peak What is MSCI and what has it done to Indonesia's stock market? Goldman Sachs estimates that foreign investor outflow could reach $7.8 billion if Indonesia is downgraded to frontier market, a scenario the investment bank and some investors deem unlikely. Indonesia stocks tank as downgrade risk triggers capital flight MSCI's warning is the latest setback for Southeast Asia's largest economy as foreign capital flows out due to concerns about how President Prabowo Subianto is widening the fiscal deficit and ramping up the state's involvement in financial markets. IDX halts trading again as stocks plunge further The Indonesia Stock Exchange (IDX) Composite index has nosedived for a second day in a row due to investability flags from Morgan Stanley Capital International (MSCI), prompting another trading halt. IDX plunges after MSCI warning about RI stocks The Indonesia Stock Exchange (IDX) temporarily halted trading on Wednesday after shares plunged on a warning from global index provider MSCI that it could downgrade Indonesian stocks to frontier-market status. Dollar reels near four-year low after blow from Trump comments As investors have grown increasingly nervous about their exposure to US assets, other currencies and gold have shot up in the past couple of weeks. IDX Composite index nosedives at open The Indonesia Stock Exchange (IDX) Composite index nosedived as trading opened on Wednesday following an evaluation by Morgan Stanley Capital International (MSCI) that flags Indonesian stocks. How coal production cuts affect Indonesia’s economy The coal sector to come under further pressure this year, as the correction in coal prices is likely to continue in line with a deeper decline in Indonesia’s coal production. Stocks up as earnings hopes offset Trump's Korea tariff move, dollar wobbles Asian shares advanced on Tuesday as investors hoped for the best from a barrage of US mega-cap earnings, though uncertainty caused by President Donald Trump’s latest tariff moves on South Korea limited broader gains while boosting gold and silver. Yen surges as intervention risks lurk, gold surpasses $5,000 Gold surged past US$5,000 per ounce early on Monday following a turbulent week where tensions over Greenland and Iran rattled sentiment, while markets remained on tenterhooks after a rout in bonds and violent spikes in the yen. Gold nears $5,000, stocks muted after turbulent week Stocks were subdued and precious metals hit fresh highs Friday after a turbulent week that saw US President Donald Trump back down from threats to seize Greenland and to issue tariffs against European allies. Industry urges palm oil output boost amid biodiesel uncertainty Implementing B50 amid stagnant production could trigger a sharp rise in CPO prices and derivative products such as cooking oil, as well as reduce export volumes. RI bond yield spikes on BI independence worries, uncertainty The yield on Indonesian government bonds has climbed to its highest level in more than three months on the back of general uncertainty, fiscal worries and concerns about the independence of Bank Indonesia (BI) following the nomination of Thomas “Tommy” Djiwandono as deputy governor. Japan should respond 'decisively' to bond sell-off, opposition head says Japan should act decisively against excessive market moves, Yuichiro Tamaki, head of an influential opposition party, told Reuters on Wednesday, after a brutal sell-off of Japanese government bonds sent a chill through global financial markets. Stocks stable after tariff-fueled selloff but uncertainty boosts gold Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Legacy, landscapes and lives: The tales of Nusantara Black and White of RI Fiesta of Democracy Silent, invisible danger on Cirebon coast Some 5.7 tonnes of shrimp contaminated with Cesium 137 disposed InterContinental Bali Resort introduces restorative Silent Retreat BPJS Kesehatan ends 2024 with prestigious international awards Love unveiled at Adriana Cocina & Bar: A new Mexican rooftop experience in Bali Get the latest news in your inbox",
    "negative_score": 36,
    "sentiment_score": 0.9893,
    "is_negative": true,
    "source": "jakartapost_business",
    "processed_at": "2026-02-18T04:17:23.523824"
  },
  {
    "title": "",
    "url": "https://www.thejakartapost.com/business/2026/02/16/idle-oil-and-gas-projects-risk-losing-licenses-bahlil-warns.html",
    "published_date": "",
    "summary": "Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Idle oil and gas projects risk losing licenses, Bahlil warns The energy minister has taken an \"all stick, no carrot\" strategy to pressure firms into start pumping oil and gas from stalled projects, threatening hundreds of wells with the prospect of losing their permits. Published on 2026-02-16T12:52:05+07:00 http://www.thejakartapost.com/business/2026/02/16/idle-oil-and-gas-projects-risk-losing-licenses-bahlil-warns.html The sun sets beyond an oil and gas rig operated by Saka Energi Muriah Limited, a wholly owned subsidiary of state gas company PGN, in the Kepodang Field of the Muriah Block off Semarang, Central Java, in this undated handout photo. (SKK Migas/SKK Migas.) nergy and Mineral Resources Minister Bahlil Lahadalia is putting pressure on oil and gas producers to make progress on stalled projects as he warned that hundreds of abandoned areas stood to lose their operating licenses. Bahlil remarked that the government had previously tried a similar approach with investors, threatening them with ultimatums to push them to realize their investments. He cited as an example the gas-rich Masela Block managed by Japanese oil and gas giant Inpex, noting that it showed little progress over its 26-year concession. “However, after they received the ‘love letter’, [praise be to God], now the investment of around US$18 billion has begun. So I think this is what we will do going forward,” the minister said. The country has experienced a long-term decline in oil production since nationwide output peaked at 1.5-1.6 million barrels per day (mbpd) in 1996-1997, gradually falling thereafter to 580,000 barrels per day (bpd) in 2024. Meanwhile, the government’s oil lifting targets have regularly gone unmet since 2016. With exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape. By registering, you agree with for signing up our newsletter! Please check your email for your newsletter subscription. However, Bahlil noted that realized production of 605,300 bpd in 2025 marginally surpassed that year’s budget target of 605,000 bpd, marking the first time the national lifting target had been met in nearly a decade. Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund Site selection for first nuclear plant expected by mid-2026, says renewables official RI meets crude lifting target for first time in years, claims Bahlil US capture of Maduro tests limits of China's diplomatic push Site selection for first nuclear plant expected by mid-2026, says renewables official RI meets crude lifting target for first time in years, claims Bahlil US capture of Maduro tests limits of China's diplomatic push Amman still eyes exports amid smelter shutdown House calls on government to investigate massive illegal gold mining near Mandalika Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund Trump says Japan to invest in energy, industrial projects in Ohio, Texas and Georgia Govt urged not to compromise too much for US trade deal Unlocking regional potential to boost economic growth Indonesia ramps up UN talks ahead of Board of Peace meeting Govt urged not to compromise too much for US trade deal Indonesia, BRICS and the rise of the Global South Trump says Japan to invest in energy, industrial projects in Ohio, Texas and Georgia From the US-led rules-based order to multipolar international law Balancing the blaze at home: Blue in the year of fire horse Bima police chief, subordinates arrested for drug trafficking Those who most need to understand AI don't get it Thousands of Aceh flood evacuees welcome Ramadan from emergency tents Indonesia must pivot from headline growth to quality job creation Get the latest news in your inbox",
    "category": "regulation",
    "author": "",
    "content": "Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Idle oil and gas projects risk losing licenses, Bahlil warns The energy minister has taken an \"all stick, no carrot\" strategy to pressure firms into start pumping oil and gas from stalled projects, threatening hundreds of wells with the prospect of losing their permits. Published on 2026-02-16T12:52:05+07:00 http://www.thejakartapost.com/business/2026/02/16/idle-oil-and-gas-projects-risk-losing-licenses-bahlil-warns.html The sun sets beyond an oil and gas rig operated by Saka Energi Muriah Limited, a wholly owned subsidiary of state gas company PGN, in the Kepodang Field of the Muriah Block off Semarang, Central Java, in this undated handout photo. (SKK Migas/SKK Migas.) nergy and Mineral Resources Minister Bahlil Lahadalia is putting pressure on oil and gas producers to make progress on stalled projects as he warned that hundreds of abandoned areas stood to lose their operating licenses. Bahlil remarked that the government had previously tried a similar approach with investors, threatening them with ultimatums to push them to realize their investments. He cited as an example the gas-rich Masela Block managed by Japanese oil and gas giant Inpex, noting that it showed little progress over its 26-year concession. “However, after they received the ‘love letter’, [praise be to God], now the investment of around US$18 billion has begun. So I think this is what we will do going forward,” the minister said. The country has experienced a long-term decline in oil production since nationwide output peaked at 1.5-1.6 million barrels per day (mbpd) in 1996-1997, gradually falling thereafter to 580,000 barrels per day (bpd) in 2024. Meanwhile, the government’s oil lifting targets have regularly gone unmet since 2016. With exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape. By registering, you agree with for signing up our newsletter! Please check your email for your newsletter subscription. However, Bahlil noted that realized production of 605,300 bpd in 2025 marginally surpassed that year’s budget target of 605,000 bpd, marking the first time the national lifting target had been met in nearly a decade. Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund Site selection for first nuclear plant expected by mid-2026, says renewables official RI meets crude lifting target for first time in years, claims Bahlil US capture of Maduro tests limits of China's diplomatic push Site selection for first nuclear plant expected by mid-2026, says renewables official RI meets crude lifting target for first time in years, claims Bahlil US capture of Maduro tests limits of China's diplomatic push Amman still eyes exports amid smelter shutdown House calls on government to investigate massive illegal gold mining near Mandalika Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund Trump says Japan to invest in energy, industrial projects in Ohio, Texas and Georgia Govt urged not to compromise too much for US trade deal Unlocking regional potential to boost economic growth Indonesia ramps up UN talks ahead of Board of Peace meeting Govt urged not to compromise too much for US trade deal Indonesia, BRICS and the rise of the Global South Trump says Japan to invest in energy, industrial projects in Ohio, Texas and Georgia From the US-led rules-based order to multipolar international law Balancing the blaze at home: Blue in the year of fire horse Bima police chief, subordinates arrested for drug trafficking Those who most need to understand AI don't get it Thousands of Aceh flood evacuees welcome Ramadan from emergency tents Indonesia must pivot from headline growth to quality job creation Get the latest news in your inbox",
    "negative_score": 14,
    "sentiment_score": -0.9697,
    "is_negative": true,
    "source": "jakartapost_business",
    "processed_at": "2026-02-18T04:17:23.541581"
  },
  {
    "title": "",
    "url": "https://www.thejakartapost.com/business/regulations",
    "published_date": "",
    "summary": "Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers The sun sets beyond an oil and gas rig operated by Saka Energi Muriah Limited, a wholly owned subsidiary of state gas company PGN, in the Kepodang Field of the Muriah Block off Semarang, Central Java, in this undated handout photo. Idle oil and gas projects risk losing licenses, Bahlil warns The energy minister has taken an \"all stick, no carrot\" strategy to pressure firms into start pumping oil and gas from stalled projects, threatening hundreds of wells with the prospect of losing their permits. Get the latest news in your inbox Site selection for first nuclear plant expected by mid-2026, says renewables official According to the ministry's renewables director general, the Bangka Belitung Islands and West Kalimantan are two priority provinces under consideration as a potential site for developing Indonesia's first nuclear power plant toward a 2032 on-grid target. ... EU proposes extending Russian oil sanctions to maritime services It has been reported that Karimun, Riau Islands, has been part of a system of traders, shippers and transshipment points, including the floating hub along the Malacca and Singapore straits and Fujairah in the United Arab Emirates, that has helped keep Russian oil and products flowing, despite the sanctions. ... Prabowo ordered purge of IDX, OJK leadership, brother says Hashim Djojohadikusumo, who is the special envoy for climate change and the brother of President Prabowo Subianto, said the five IDX and OJK officials who resigned soon after last month’s market crash did so in direct response to the President’s order. EU proposes sanctions on Indonesian ports for handling Russian oil The proposal would bar EU companies and individuals from conducting transactions with Karimun Port in Indonesia and Kulevi Port in Georgia. Indonesia proposes 3 measures to meet MSCI's transparency demands As part of their eight-point plan, Indonesian authorities have come up with three proposed measures to meet MSCI's transparency demands and avoid potential downgrading to emerging market status. Crackdown on mining permits faces legal scrutiny A potential lawsuit over halted mining operations could expose the state to fiscal risks reaching tens of trillions of rupiah, extending far beyond legal fees to include lost revenue and compensation claims. Pushing rupiah to 15,000 per dollar ‘not that difficult’, says Purbaya Finance Minister Purbaya Yudhi Sadewa says pushing the rupiah exchange rate back up to 15,000 per United States dollar should not be that difficult as the currency is undervalued when taking into account Indonesia’s economic fundamentals. Weak commitment, policy uncertainty derail RI renewable targets The contribution of renewable energy to the national energy mix, which refer to total electricity production, rose by only 1.1 percentage points to 15.75 percent in 2025. OJK, IDX name new leaders before markets open again The Financial Services Authority (OJK) has announced replacements for four of its high-ranking officials who stepped down on Friday, while the Indonesia Stock Exchange (IDX) is also set to appoint a new interim director ahead of a meeting with global stock market index compiler Morgan Stanley Capital International (MSCI) scheduled for Monday. Heads roll at IDX, OJK, as govt vows to fix stock market It is not immediately clear whether the resignations of five high-ranking officials at the Indonesia Stock Exchange (IDX) and the Financial Services Authority (OJK) were voluntary or forced. Senior minister Airlangga Hartarto said President Prabowo Subianto is monitoring the stock exchange following the market meltdown. Post-flood regulatory crackdown signals 'creeping nationalization' The abrupt revocation of mining permits and the planned transfer of assets to state firms have raised concerns of \"nationalization\", undermining legal certainty and threatening to erode Indonesia’s appeal to foreign capital. What's behind Indonesia's worst stock crash in decades? IDX director steps down after stocks plunge amid MSCI warning Indonesia Stock Exchange (IDX) president director Iman Rachman has announced his resignation following Morgan Stanley Capital International’s (MSCI) transparency warning that triggered a massive sell-off in Indonesian stocks and temporary trading halts earlier this week. Govt vows swift changes to heed MSCI demands for RI stocks Both Indonesia Stock Exchange (IDX) and the Financial Services Authority (OJK) have promised to act fast and change stock market regulations pursuant to points made by Morgan Stanley Capital International (MSCI) that prompted a massive sell-off. State-owned Perminas to assume control of Martabe gold mine The Martabe gold mine in North Sumatra, operated by PT Agincourt Resources, will be transferred to state control under the newly formed National Mineral Company (Perminas), ending recent speculation about one of Indonesia's major gold assets. BYD, VinFast to start local EV production in March, govt says Failure to meet those commitments allows the government to draw down bank guarantees posted by the companies as penalties. Danantara to manage land seized from 28 firms linked to Sumatra floods PT North Sumatra Hydro Energy (NSHE), which runs the Batangtoru hydropower facility, is among the 28 firms whose permits were revoked after the floods. The company is controlled by China's state-run SDIC Power Holdings Co. Ltd. Shell, BP to receive fuel import quotas every six months this year As private fuel retailers began seeing their annual stocks run low last August, the government refused to issue additional quotas and instead urged them to buy imported base fuel from Pertamina. Plan to build subsidized apartments in Meikarta raises doubts The Public Housing and Settlements Ministry plans to transform parts of the long-stalled Meikarta project in Bekasi, West Java, into a subsidized apartment complex (Rusun) to provide affordable homes in urban areas for low-income earners. Indonesia cuts live cattle price cap after beef traders’ strike Beef prices in Indonesia usually climb ahead of Idul Fitri, which is expected to fall on March 21 this year, as seasonal demand rises during Ramadan and the festive period. E-commerce sellers wait for tighter rules on platform fees E-commerce sellers say restrictions on platform fees under a planned new regulation would help them manage pricing more efficiently. Indonesia seeks to boost rooftop solar quota by 400 MW If approved by state electricity monopoly PLN, the total quota for 2026 would rise to around 1,400 MW. Illegal tobacco excise plan casts haze over market fairness, policy certainty Finance Minister Purbaya Yudhi Sadewa estimated that formalizing illegal cigarette production could generate additional trillions of rupiah (more than US$59 million) for the state coffers. BI to remain ‘professional’ with strong governance, Perry vows Professionalism will continue in monetary policymaking, Bank Indonesia (BI) Governor Perry Warjiyo has promised, seeking to allay any concerns following Deputy Finance Minister Thomas “Tommy” Djiwandono’s nomination as a deputy BI governor. Indonesia aims for garlic self-sufficiency in 2029 Roughly 95 percent of the country’s consumption is currently met through imports. Prabowo’s $6 billion rescue plan leaves textile industry puzzled A state-owned textile enterprise is to tackle industrywide problems, including rehiring tens of thousands of workers laid off after the Sritex bankruptcy. Catch-up costs loom as Prabowo revives semiconductor dream Prabowo's nephew enters race for senior central bank post Deputy finance minister Thomas \"Tommy\" Djiwandono, who is also a nephew of President Prabowo Subianto, has been lined up to become a deputy governor of Bank Indonesia (BI), raising questions about the central bank’s independence. Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Legacy, landscapes and lives: The tales of Nusantara Black and White of RI Fiesta of Democracy Silent, invisible danger on Cirebon coast Some 5.7 tonnes of shrimp contaminated with Cesium 137 disposed InterContinental Bali Resort introduces restorative Silent Retreat BPJS Kesehatan ends 2024 with prestigious international awards Love unveiled at Adriana Cocina & Bar: A new Mexican rooftop experience in Bali Get the latest news in your inbox",
    "category": "regulation",
    "author": "",
    "content": "Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers The sun sets beyond an oil and gas rig operated by Saka Energi Muriah Limited, a wholly owned subsidiary of state gas company PGN, in the Kepodang Field of the Muriah Block off Semarang, Central Java, in this undated handout photo. Idle oil and gas projects risk losing licenses, Bahlil warns The energy minister has taken an \"all stick, no carrot\" strategy to pressure firms into start pumping oil and gas from stalled projects, threatening hundreds of wells with the prospect of losing their permits. Get the latest news in your inbox Site selection for first nuclear plant expected by mid-2026, says renewables official According to the ministry's renewables director general, the Bangka Belitung Islands and West Kalimantan are two priority provinces under consideration as a potential site for developing Indonesia's first nuclear power plant toward a 2032 on-grid target. ... EU proposes extending Russian oil sanctions to maritime services It has been reported that Karimun, Riau Islands, has been part of a system of traders, shippers and transshipment points, including the floating hub along the Malacca and Singapore straits and Fujairah in the United Arab Emirates, that has helped keep Russian oil and products flowing, despite the sanctions. ... Prabowo ordered purge of IDX, OJK leadership, brother says Hashim Djojohadikusumo, who is the special envoy for climate change and the brother of President Prabowo Subianto, said the five IDX and OJK officials who resigned soon after last month’s market crash did so in direct response to the President’s order. EU proposes sanctions on Indonesian ports for handling Russian oil The proposal would bar EU companies and individuals from conducting transactions with Karimun Port in Indonesia and Kulevi Port in Georgia. Indonesia proposes 3 measures to meet MSCI's transparency demands As part of their eight-point plan, Indonesian authorities have come up with three proposed measures to meet MSCI's transparency demands and avoid potential downgrading to emerging market status. Crackdown on mining permits faces legal scrutiny A potential lawsuit over halted mining operations could expose the state to fiscal risks reaching tens of trillions of rupiah, extending far beyond legal fees to include lost revenue and compensation claims. Pushing rupiah to 15,000 per dollar ‘not that difficult’, says Purbaya Finance Minister Purbaya Yudhi Sadewa says pushing the rupiah exchange rate back up to 15,000 per United States dollar should not be that difficult as the currency is undervalued when taking into account Indonesia’s economic fundamentals. Weak commitment, policy uncertainty derail RI renewable targets The contribution of renewable energy to the national energy mix, which refer to total electricity production, rose by only 1.1 percentage points to 15.75 percent in 2025. OJK, IDX name new leaders before markets open again The Financial Services Authority (OJK) has announced replacements for four of its high-ranking officials who stepped down on Friday, while the Indonesia Stock Exchange (IDX) is also set to appoint a new interim director ahead of a meeting with global stock market index compiler Morgan Stanley Capital International (MSCI) scheduled for Monday. Heads roll at IDX, OJK, as govt vows to fix stock market It is not immediately clear whether the resignations of five high-ranking officials at the Indonesia Stock Exchange (IDX) and the Financial Services Authority (OJK) were voluntary or forced. Senior minister Airlangga Hartarto said President Prabowo Subianto is monitoring the stock exchange following the market meltdown. Post-flood regulatory crackdown signals 'creeping nationalization' The abrupt revocation of mining permits and the planned transfer of assets to state firms have raised concerns of \"nationalization\", undermining legal certainty and threatening to erode Indonesia’s appeal to foreign capital. What's behind Indonesia's worst stock crash in decades? IDX director steps down after stocks plunge amid MSCI warning Indonesia Stock Exchange (IDX) president director Iman Rachman has announced his resignation following Morgan Stanley Capital International’s (MSCI) transparency warning that triggered a massive sell-off in Indonesian stocks and temporary trading halts earlier this week. Govt vows swift changes to heed MSCI demands for RI stocks Both Indonesia Stock Exchange (IDX) and the Financial Services Authority (OJK) have promised to act fast and change stock market regulations pursuant to points made by Morgan Stanley Capital International (MSCI) that prompted a massive sell-off. State-owned Perminas to assume control of Martabe gold mine The Martabe gold mine in North Sumatra, operated by PT Agincourt Resources, will be transferred to state control under the newly formed National Mineral Company (Perminas), ending recent speculation about one of Indonesia's major gold assets. BYD, VinFast to start local EV production in March, govt says Failure to meet those commitments allows the government to draw down bank guarantees posted by the companies as penalties. Danantara to manage land seized from 28 firms linked to Sumatra floods PT North Sumatra Hydro Energy (NSHE), which runs the Batangtoru hydropower facility, is among the 28 firms whose permits were revoked after the floods. The company is controlled by China's state-run SDIC Power Holdings Co. Ltd. Shell, BP to receive fuel import quotas every six months this year As private fuel retailers began seeing their annual stocks run low last August, the government refused to issue additional quotas and instead urged them to buy imported base fuel from Pertamina. Plan to build subsidized apartments in Meikarta raises doubts The Public Housing and Settlements Ministry plans to transform parts of the long-stalled Meikarta project in Bekasi, West Java, into a subsidized apartment complex (Rusun) to provide affordable homes in urban areas for low-income earners. Indonesia cuts live cattle price cap after beef traders’ strike Beef prices in Indonesia usually climb ahead of Idul Fitri, which is expected to fall on March 21 this year, as seasonal demand rises during Ramadan and the festive period. E-commerce sellers wait for tighter rules on platform fees E-commerce sellers say restrictions on platform fees under a planned new regulation would help them manage pricing more efficiently. Indonesia seeks to boost rooftop solar quota by 400 MW If approved by state electricity monopoly PLN, the total quota for 2026 would rise to around 1,400 MW. Illegal tobacco excise plan casts haze over market fairness, policy certainty Finance Minister Purbaya Yudhi Sadewa estimated that formalizing illegal cigarette production could generate additional trillions of rupiah (more than US$59 million) for the state coffers. BI to remain ‘professional’ with strong governance, Perry vows Professionalism will continue in monetary policymaking, Bank Indonesia (BI) Governor Perry Warjiyo has promised, seeking to allay any concerns following Deputy Finance Minister Thomas “Tommy” Djiwandono’s nomination as a deputy BI governor. Indonesia aims for garlic self-sufficiency in 2029 Roughly 95 percent of the country’s consumption is currently met through imports. Prabowo’s $6 billion rescue plan leaves textile industry puzzled A state-owned textile enterprise is to tackle industrywide problems, including rehiring tens of thousands of workers laid off after the Sritex bankruptcy. Catch-up costs loom as Prabowo revives semiconductor dream Prabowo's nephew enters race for senior central bank post Deputy finance minister Thomas \"Tommy\" Djiwandono, who is also a nephew of President Prabowo Subianto, has been lined up to become a deputy governor of Bank Indonesia (BI), raising questions about the central bank’s independence. Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Legacy, landscapes and lives: The tales of Nusantara Black and White of RI Fiesta of Democracy Silent, invisible danger on Cirebon coast Some 5.7 tonnes of shrimp contaminated with Cesium 137 disposed InterContinental Bali Resort introduces restorative Silent Retreat BPJS Kesehatan ends 2024 with prestigious international awards Love unveiled at Adriana Cocina & Bar: A new Mexican rooftop experience in Bali Get the latest news in your inbox",
    "negative_score": 46,
    "sentiment_score": 0.9337,
    "is_negative": true,
    "source": "jakartapost_business",
    "processed_at": "2026-02-18T04:17:23.590401"
  },
  {
    "title": "",
    "url": "https://www.thejakartapost.com/business/2026/02/18/trump-says-japan-to-invest-in-energy-industrial-projects-in-ohio-texas-and-georgia.html",
    "published_date": "",
    "summary": "Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Trump says Japan to invest in energy, industrial projects in Ohio, Texas and Georgia David Lawder and Jarrett Renshaw Published on 2026-02-18T10:48:17+07:00 http://www.thejakartapost.com/business/2026/02/18/trump-says-japan-to-invest-in-energy-industrial-projects-in-ohio-texas-and-georgia.html Japanese Prime Minister Sanae Takaichi reacts as U.S. President Donald Trump speaks, aboard the aircraft carrier USS George Washington, during a visit to US Navy's Yokosuka base in Yokosuka, Japan, on Oct. 28, 2025. nited States President Donald Trump's administration on Tuesday announced three projects valued at US$36 billion to be financed by Japan, including an oil export facility in Texas, an industrial diamonds plant in Georgia and a natural gas power plant in Ohio. The projects are the first investments under Japan's $550 billion US investment pledge as part of a trade deal that cut Trump's tariffs on Japanese imports to 15 percent, Trump said on Truth Social. He gave few details about the projects. Commerce Secretary Howard Lutnick said in a statement that the Portsmouth, Ohio power plant, valued at $33 billion, would be the largest natural gas-fired generating facility in US history, generating 9.2 gigawatts of electricity annually, more than enough to power all of the homes in Ohio. The facility, to be operated by SB Energy, a subsidiary of Japanese tech investor SoftBank Group, would increase baseload power at a time of fast-growing electricity demand from data centers built to power artificial intelligence applications. The White House said Japan would invest in the $2.1 billion Texas GulfLink deepwater crude oil export facility off the Texas coast. \"This project is expected to generate $20–30 billion annually in US crude exports, secure export capacity for our refineries, and reinforce America’s position as the world’s leading energy supplier,\" Lutnick said. With exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape. By registering, you agree with for signing up our newsletter! Please check your email for your newsletter subscription. Texas GulfLink, which is being developed by Sentinel Midstream, confirmed that it was part of the initiative and was \"honored to be a trusted partner with the US Department of Commerce and the government of Japan.\" Trump said the Texas investments would include a liquefied natural gas project, but Lutnick's statement and a White House fact sheet did not mention LNG. Lutnick said the third major project in Georgia was a synthetic industrial diamond manufacturing plant that would satisfy 100 percent of US demand for synthetic diamond grit, a critical input for advanced manufacturing and semiconductor production. The US currently relies largely on China for such supplies. The high-pressure synthetic diamond plant valued at about $600 million, will be operated by Element Six, the White House said in a fact sheet. The industrial diamond company is a unit of De Beers Group, the world's largest diamond producer. It was unclear how much of the projects' costs would be funded by Japanese entities and under what conditions. Under an earlier US-Japan agreement, profits from the projects were due to be shared 50-50 between the US and Japan until Japan's initial investment costs were recouped, after which profits would be split 90-10 in favor of the US. The administration's announcements followed meetings last week between Lutnick and Japan's economic and trade minister Ryosei Akazawa. Akazawa told reporters on Thursday that several issues remained unresolved before deals could be announced. \"The scale of these projects are so large, and could not be done without one very special word, TARIFFS,\" Trump wrote on Truth Social. Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund Trump says Japan to invest in energy, industrial projects in Ohio, Texas and Georgia Whom does the state serve in Indonesia? AI tide no longer lifts all boats, and may sink today's winners Trump says Japan to invest in energy, industrial projects in Ohio, Texas and Georgia Whom does the state serve in Indonesia? AI tide no longer lifts all boats, and may sink today's winners Beyond Trump's America: Why the world needs NEFOS 2.0 Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund Trump says Japan to invest in energy, industrial projects in Ohio, Texas and Georgia Govt urged not to compromise too much for US trade deal Unlocking regional potential to boost economic growth Indonesia ramps up UN talks ahead of Board of Peace meeting Govt urged not to compromise too much for US trade deal Indonesia, BRICS and the rise of the Global South Trump says Japan to invest in energy, industrial projects in Ohio, Texas and Georgia From the US-led rules-based order to multipolar international law Balancing the blaze at home: Blue in the year of fire horse Bima police chief, subordinates arrested for drug trafficking Those who most need to understand AI don't get it Thousands of Aceh flood evacuees welcome Ramadan from emergency tents Indonesia must pivot from headline growth to quality job creation Get the latest news in your inbox",
    "category": "economy",
    "author": "",
    "content": "Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Trump says Japan to invest in energy, industrial projects in Ohio, Texas and Georgia David Lawder and Jarrett Renshaw Published on 2026-02-18T10:48:17+07:00 http://www.thejakartapost.com/business/2026/02/18/trump-says-japan-to-invest-in-energy-industrial-projects-in-ohio-texas-and-georgia.html Japanese Prime Minister Sanae Takaichi reacts as U.S. President Donald Trump speaks, aboard the aircraft carrier USS George Washington, during a visit to US Navy's Yokosuka base in Yokosuka, Japan, on Oct. 28, 2025. nited States President Donald Trump's administration on Tuesday announced three projects valued at US$36 billion to be financed by Japan, including an oil export facility in Texas, an industrial diamonds plant in Georgia and a natural gas power plant in Ohio. The projects are the first investments under Japan's $550 billion US investment pledge as part of a trade deal that cut Trump's tariffs on Japanese imports to 15 percent, Trump said on Truth Social. He gave few details about the projects. Commerce Secretary Howard Lutnick said in a statement that the Portsmouth, Ohio power plant, valued at $33 billion, would be the largest natural gas-fired generating facility in US history, generating 9.2 gigawatts of electricity annually, more than enough to power all of the homes in Ohio. The facility, to be operated by SB Energy, a subsidiary of Japanese tech investor SoftBank Group, would increase baseload power at a time of fast-growing electricity demand from data centers built to power artificial intelligence applications. The White House said Japan would invest in the $2.1 billion Texas GulfLink deepwater crude oil export facility off the Texas coast. \"This project is expected to generate $20–30 billion annually in US crude exports, secure export capacity for our refineries, and reinforce America’s position as the world’s leading energy supplier,\" Lutnick said. With exclusive interviews and in-depth coverage of the region's most pressing business issues, \"Prospects\" is the go-to source for staying ahead of the curve in Indonesia's rapidly evolving business landscape. By registering, you agree with for signing up our newsletter! Please check your email for your newsletter subscription. Texas GulfLink, which is being developed by Sentinel Midstream, confirmed that it was part of the initiative and was \"honored to be a trusted partner with the US Department of Commerce and the government of Japan.\" Trump said the Texas investments would include a liquefied natural gas project, but Lutnick's statement and a White House fact sheet did not mention LNG. Lutnick said the third major project in Georgia was a synthetic industrial diamond manufacturing plant that would satisfy 100 percent of US demand for synthetic diamond grit, a critical input for advanced manufacturing and semiconductor production. The US currently relies largely on China for such supplies. The high-pressure synthetic diamond plant valued at about $600 million, will be operated by Element Six, the White House said in a fact sheet. The industrial diamond company is a unit of De Beers Group, the world's largest diamond producer. It was unclear how much of the projects' costs would be funded by Japanese entities and under what conditions. Under an earlier US-Japan agreement, profits from the projects were due to be shared 50-50 between the US and Japan until Japan's initial investment costs were recouped, after which profits would be split 90-10 in favor of the US. The administration's announcements followed meetings last week between Lutnick and Japan's economic and trade minister Ryosei Akazawa. Akazawa told reporters on Thursday that several issues remained unresolved before deals could be announced. \"The scale of these projects are so large, and could not be done without one very special word, TARIFFS,\" Trump wrote on Truth Social. Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund Trump says Japan to invest in energy, industrial projects in Ohio, Texas and Georgia Whom does the state serve in Indonesia? AI tide no longer lifts all boats, and may sink today's winners Trump says Japan to invest in energy, industrial projects in Ohio, Texas and Georgia Whom does the state serve in Indonesia? AI tide no longer lifts all boats, and may sink today's winners Beyond Trump's America: Why the world needs NEFOS 2.0 Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund Trump says Japan to invest in energy, industrial projects in Ohio, Texas and Georgia Govt urged not to compromise too much for US trade deal Unlocking regional potential to boost economic growth Indonesia ramps up UN talks ahead of Board of Peace meeting Govt urged not to compromise too much for US trade deal Indonesia, BRICS and the rise of the Global South Trump says Japan to invest in energy, industrial projects in Ohio, Texas and Georgia From the US-led rules-based order to multipolar international law Balancing the blaze at home: Blue in the year of fire horse Bima police chief, subordinates arrested for drug trafficking Those who most need to understand AI don't get it Thousands of Aceh flood evacuees welcome Ramadan from emergency tents Indonesia must pivot from headline growth to quality job creation Get the latest news in your inbox",
    "negative_score": 12,
    "sentiment_score": 0.9968,
    "is_negative": true,
    "source": "jakartapost_business",
    "processed_at": "2026-02-18T04:17:23.615725"
  },
  {
    "title": "",
    "url": "https://www.thejakartapost.com/business/economy",
    "published_date": "",
    "summary": "Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Japanese Prime Minister Sanae Takaichi reacts as U.S. President Donald Trump speaks, aboard the aircraft carrier USS George Washington, during a visit to US Navy's Yokosuka base in Yokosuka, Japan, on Oct. 28, 2025. Trump says Japan to invest in energy, industrial projects in Ohio, Texas and Georgia United States President Donald Trump's administration on Tuesday announced three projects valued at US$36 billion to be financed by Japan, including an oil export facility in Texas, an industrial diamonds plant in Georgia and a natural gas power plant in Ohio. Get the latest news in your inbox Govt urged not to compromise too much for US trade deal The government has issued a loosely-worded statement days ahead of the expected signing of a tariff agreement with the United States, following a weekend meeting at President Prabowo Subianto’s Hambalang estate in Bogor, West Java. ... Unlocking regional potential to boost economic growth As an archipelagic country, Indonesia is endowed with diverse economic potential across regions, reflected in regional economic structures and export profiles. ... Japan's economy limps back to scant growth in Q4, raises test for Takaichi Japan's economy limped back to meager growth in the fourth quarter, significantly missing market expectations in a key test for Prime Minister Sanae Takaichi's government as cost-of-living pressures drag on confidence and domestic demand. Lunar New Year drives corporate decor boom, but retail demand falters Sellers of nian gao or kue keranjang in Glodok’s Chinatown area as well as parts of West and Central Java reporting softer sales compared to previous years. 'Be realistic' says Prabowo, while defending key programs President Prabowo Subianto has emphasized the need to be realistic in a speech on the Indonesian economy, where he promoted key initiatives of his administration to drive gross domestic product growth. Cumulative sales in high-rise condos stood at just 56 percent last year in a continuation of a decade-long downward trend, while new launches remained subdued in a lackluster market. EU leaders vow to accelerate single market, in struggle to compete with US, China European Union leaders agreed on Thursday on a wide-ranging set of commitments to improve how the bloc's border-free internal market works so Europe's businesses can be competitive and survive aggressive economic rivalry from the US and China. Indonesia ready to bridge trade, investment in Islamic world Prabowo leans on businesses to create jobs President Prabowo Subianto held meetings with Indonesian business leaders at his private Hambalang estate, during which he stated his commitment to improving the ease of doing business. New deputy finance minister guns for 5.6% first-quarter GDP growth Just under a week since he was sworn in last Thursday, the ex-Bank Indonesia deputy governor is setting his sights accelerated state spending this quarter to reach up to 5.6 percent growth from an initial 5.5 percent target. Pertamina denies Russian crude imports as EU mulls sanctions The European Union has proposed unprecedented sanctions against Indonesia’s Karimun Port for handling Russian oil. Retail sales post strong annual gain as consumer confidence holds up The retail sales index dipped slightly in January when compared with the holiday month of December but is up a strong 7 percent year-on-year. Indonesia’s growth: Resilient but uneven Although formal job creation has improved, job quality, reflected in income stability, benefits and productivity, remains unequal. Fiscal discipline remains intact, govt insists, after Moody’s outlook cut State Secretary Prasetyo Hadi said on Monday that the government continued to adhere to fiscal rules and had not breached statutory deficit limits, stressing that budget management remained on a prudent footing. Bulog proposes Mecca warehouse to stock haj rice exports Bulog’s planned warehouse in the Haj Village will also be used to store other food commodities from Indonesia, such as meat and fish, to meet the consumption needs of the haj pilgrims. Poverty at record low as govt seeks to redefine threshold The poverty rate rests at a historic low of 8.25 percent of the total population, continuing its declining trend from September 2022. Thomas Djiwandono sworn in as BI deputy governor The former deputy finance minister, who also President Prabowo Subianto's nephew, replaced Juda Agung, who resigned as BI deputy governor on Jan. 13 and was inaugurated as deputy finance minister on Thursday. Japan's Takaichi may struggle to soothe voters and markets Japanese stocks soared to record highs Monday after Prime Minister Sanae Takaichi's election triumph, but experts warned that the country's first woman leader could struggle to keep both voters and markets happy. Unemployment figure subsides despite growing layoffs Data from the Manpower Ministry in January showed a 13 percent layoff increase in 2025 compared with the preceding year. Economic fundamentals solid, govt insists, after Moody’s lowered outlook Economists interpret the rating agency’s latest assessment as a serious corrective signal, noting that a downgrade in Indonesia’s credit rating could sharply raise borrowing costs and pile pressure on the rupiah. Ex-BI deputy replaces Tommy as deputy finance minister In what appears to be a coordinated role swap, the President has appointed a former BI deputy governor to fill the deputy finance minister post left vacant by his nephew Tommy Djiwandono, who is set to take up his new job as BI deputy governor. Govt waives airfare VAT for Idul Fitri The government has announced a temporary waiver on value-added tax (VAT) for airline tickets for the upcoming Idul Fitri holiday period, when travel demand spikes across the country. Indonesian markets face more pressure after Moody's cuts outlook Indonesian stocks and currency traded weaker in early trade on Friday after Moody's lowered the country's credit rating outlook, the latest jolt in a turbulent start to the year for Southeast Asia's largest economy. Economic growth improved slightly last year but failed to meet the government’s target set out in the state budget. Indonesian economic growth tops 5% on consumption boost The figures come days after the country's stock market suffered its worst crash in decades after index compiler MSCI threatened a downgrade over the transparency of the free-float stocks. Purbaya calls out Citi economist over deficit projection The finance minister stated that the 2025 deficit was deliberately pushed close to the 3 percent limit to ensure that the economic downturn did not spiral into a recession. Weather woes, demand strain may keep inflation above target Statistics Indonesia (BPS) reported that annual inflation reached 3.55 percent year-on-year (yoy) in January, citing a low base effect after the figure fell below its normal trend in January last year because of electricity tariff discounts. WTO must 'reform or die': talks facilitator Successfully reforming the WTO is a matter of life and death for the organization, warns the facilitator of talks on revamping the global trade body. Indonesia imports Russian oil in December and January, data shows The imports, tracked by Kpler and Vortexa, came as the prospect of declining demand from India, one of the main buyers of Russian crude, has depressed prices of the western-sanctioned oil, sales of which are vital in helping fund the war in Ukraine. Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Legacy, landscapes and lives: The tales of Nusantara Black and White of RI Fiesta of Democracy Silent, invisible danger on Cirebon coast Some 5.7 tonnes of shrimp contaminated with Cesium 137 disposed InterContinental Bali Resort introduces restorative Silent Retreat BPJS Kesehatan ends 2024 with prestigious international awards Love unveiled at Adriana Cocina & Bar: A new Mexican rooftop experience in Bali Get the latest news in your inbox",
    "category": "economy",
    "author": "",
    "content": "Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers Japanese Prime Minister Sanae Takaichi reacts as U.S. President Donald Trump speaks, aboard the aircraft carrier USS George Washington, during a visit to US Navy's Yokosuka base in Yokosuka, Japan, on Oct. 28, 2025. Trump says Japan to invest in energy, industrial projects in Ohio, Texas and Georgia United States President Donald Trump's administration on Tuesday announced three projects valued at US$36 billion to be financed by Japan, including an oil export facility in Texas, an industrial diamonds plant in Georgia and a natural gas power plant in Ohio. Get the latest news in your inbox Govt urged not to compromise too much for US trade deal The government has issued a loosely-worded statement days ahead of the expected signing of a tariff agreement with the United States, following a weekend meeting at President Prabowo Subianto’s Hambalang estate in Bogor, West Java. ... Unlocking regional potential to boost economic growth As an archipelagic country, Indonesia is endowed with diverse economic potential across regions, reflected in regional economic structures and export profiles. ... Japan's economy limps back to scant growth in Q4, raises test for Takaichi Japan's economy limped back to meager growth in the fourth quarter, significantly missing market expectations in a key test for Prime Minister Sanae Takaichi's government as cost-of-living pressures drag on confidence and domestic demand. Lunar New Year drives corporate decor boom, but retail demand falters Sellers of nian gao or kue keranjang in Glodok’s Chinatown area as well as parts of West and Central Java reporting softer sales compared to previous years. 'Be realistic' says Prabowo, while defending key programs President Prabowo Subianto has emphasized the need to be realistic in a speech on the Indonesian economy, where he promoted key initiatives of his administration to drive gross domestic product growth. Cumulative sales in high-rise condos stood at just 56 percent last year in a continuation of a decade-long downward trend, while new launches remained subdued in a lackluster market. EU leaders vow to accelerate single market, in struggle to compete with US, China European Union leaders agreed on Thursday on a wide-ranging set of commitments to improve how the bloc's border-free internal market works so Europe's businesses can be competitive and survive aggressive economic rivalry from the US and China. Indonesia ready to bridge trade, investment in Islamic world Prabowo leans on businesses to create jobs President Prabowo Subianto held meetings with Indonesian business leaders at his private Hambalang estate, during which he stated his commitment to improving the ease of doing business. New deputy finance minister guns for 5.6% first-quarter GDP growth Just under a week since he was sworn in last Thursday, the ex-Bank Indonesia deputy governor is setting his sights accelerated state spending this quarter to reach up to 5.6 percent growth from an initial 5.5 percent target. Pertamina denies Russian crude imports as EU mulls sanctions The European Union has proposed unprecedented sanctions against Indonesia’s Karimun Port for handling Russian oil. Retail sales post strong annual gain as consumer confidence holds up The retail sales index dipped slightly in January when compared with the holiday month of December but is up a strong 7 percent year-on-year. Indonesia’s growth: Resilient but uneven Although formal job creation has improved, job quality, reflected in income stability, benefits and productivity, remains unequal. Fiscal discipline remains intact, govt insists, after Moody’s outlook cut State Secretary Prasetyo Hadi said on Monday that the government continued to adhere to fiscal rules and had not breached statutory deficit limits, stressing that budget management remained on a prudent footing. Bulog proposes Mecca warehouse to stock haj rice exports Bulog’s planned warehouse in the Haj Village will also be used to store other food commodities from Indonesia, such as meat and fish, to meet the consumption needs of the haj pilgrims. Poverty at record low as govt seeks to redefine threshold The poverty rate rests at a historic low of 8.25 percent of the total population, continuing its declining trend from September 2022. Thomas Djiwandono sworn in as BI deputy governor The former deputy finance minister, who also President Prabowo Subianto's nephew, replaced Juda Agung, who resigned as BI deputy governor on Jan. 13 and was inaugurated as deputy finance minister on Thursday. Japan's Takaichi may struggle to soothe voters and markets Japanese stocks soared to record highs Monday after Prime Minister Sanae Takaichi's election triumph, but experts warned that the country's first woman leader could struggle to keep both voters and markets happy. Unemployment figure subsides despite growing layoffs Data from the Manpower Ministry in January showed a 13 percent layoff increase in 2025 compared with the preceding year. Economic fundamentals solid, govt insists, after Moody’s lowered outlook Economists interpret the rating agency’s latest assessment as a serious corrective signal, noting that a downgrade in Indonesia’s credit rating could sharply raise borrowing costs and pile pressure on the rupiah. Ex-BI deputy replaces Tommy as deputy finance minister In what appears to be a coordinated role swap, the President has appointed a former BI deputy governor to fill the deputy finance minister post left vacant by his nephew Tommy Djiwandono, who is set to take up his new job as BI deputy governor. Govt waives airfare VAT for Idul Fitri The government has announced a temporary waiver on value-added tax (VAT) for airline tickets for the upcoming Idul Fitri holiday period, when travel demand spikes across the country. Indonesian markets face more pressure after Moody's cuts outlook Indonesian stocks and currency traded weaker in early trade on Friday after Moody's lowered the country's credit rating outlook, the latest jolt in a turbulent start to the year for Southeast Asia's largest economy. Economic growth improved slightly last year but failed to meet the government’s target set out in the state budget. Indonesian economic growth tops 5% on consumption boost The figures come days after the country's stock market suffered its worst crash in decades after index compiler MSCI threatened a downgrade over the transparency of the free-float stocks. Purbaya calls out Citi economist over deficit projection The finance minister stated that the 2025 deficit was deliberately pushed close to the 3 percent limit to ensure that the economic downturn did not spiral into a recession. Weather woes, demand strain may keep inflation above target Statistics Indonesia (BPS) reported that annual inflation reached 3.55 percent year-on-year (yoy) in January, citing a low base effect after the figure fell below its normal trend in January last year because of electricity tariff discounts. WTO must 'reform or die': talks facilitator Successfully reforming the WTO is a matter of life and death for the organization, warns the facilitator of talks on revamping the global trade body. Indonesia imports Russian oil in December and January, data shows The imports, tracked by Kpler and Vortexa, came as the prospect of declining demand from India, one of the main buyers of Russian crude, has depressed prices of the western-sanctioned oil, sales of which are vital in helping fund the war in Ukraine. Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Prabowo says Indonesia may need an authoritarian touch to fight corruption Norway, Indonesia launch fourth period of Environmental Fund How to create jobs for the world's 1.2b new workers EU to take part in Trump's 'Board of Peace' but not as member Riza Chalid’s son faces 18 years in Pertamina graft case TNI prepares 8,000 troops for Gaza peace mission as Prabowo heads to US Navy receives hydro-oceanographic survey ship from German shipyard Indonesia slips in corruption index in Prabowo’s first year Legacy, landscapes and lives: The tales of Nusantara Black and White of RI Fiesta of Democracy Silent, invisible danger on Cirebon coast Some 5.7 tonnes of shrimp contaminated with Cesium 137 disposed InterContinental Bali Resort introduces restorative Silent Retreat BPJS Kesehatan ends 2024 with prestigious international awards Love unveiled at Adriana Cocina & Bar: A new Mexican rooftop experience in Bali Get the latest news in your inbox",
    "negative_score": 39,
    "sentiment_score": 0.9898,
    "is_negative": true,
    "source": "jakartapost_business",
    "processed_at": "2026-02-18T04:17:23.675437"
  }
]